{
    "id": "0",
    "author": "Ислам форум",
    "category": "Aqidah",
    "published": "2010",
    "lang": "Ru",
    "title": "Свидетельство Мухаммад (ﷺ) посланник Аллаха",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FsecondshadahRu.jpeg?alt=media&token=f2c9b844-585d-4f94-a260-4aab0cf731c2&_gl=1*1rzc3y4*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5Nzg4NDc3My4zNi4xLjE2OTc4ODQ5MDQuNDMuMC4w",
    "chapters": [
        
        {
            "id": 1,
            "subtitle": "Общий смысл второго свидетельства",
            "text": "Смысл данного высказывания в том, что следует уверовать в то, что Мухаммад (мир ему и благословение Аллаха) является пророком, посланным Аллахом. Также обязательна любовь по отношению к нему, повиновение его приказам, признание сообщений от него и предпочтение его слов перед словами других людей. Оба эти свидетельства не отделимы друг от друга. Именно по этой причине оба эти высказывания упоминаются во время чтения призыва на молитву азан и слов ташаххуда. Аллах Всевышний сказал: « **Разве Мы не возвеличили твое поминание?** » Муджахид, да смилостивиться над ним Аллах, сказал: «(Это значит) если станут поминать Меня, то обязательно станут поминать и тебя. Свидетельствую, что нет божества (достойного поклонения), кроме Аллаха, и что Мухаммад – раб Аллаха и Его посланник²»  Произнесение этих выражений включает в себя также и твердую веру в них. Всевышний Аллах сказал: « **О Пророк! Мы отправили тебя свидетелем, добрым вестником и предостерегающим увещевателем, призывающим к Аллаху с Его дозволения, и освещающим светочем** ³»  Поэтому следует признать все то, что он сказал о прошлом и будущем, и все то, что он разрешил и запретил. Следует также повиноваться его приказам и удерживаться от всего того, что он запретил. Всевышний Аллах сказал: «Скажи: « **Если вы любите Аллаха, то следуйте за мной, и тогда Аллах возлюбит вас и простит вам ваши грехи, ведь Аллах – Прощающий, Милосердный** ⁴» Передается со слов Абу Хурайры и ‘Абдар-Рахмана бин Сахра (да будет доволен ими Аллах), что Пророк (мир ему и благословение Аллаха) сказал: « **Избегайте того, что я вам запретил, а из того, что я вам приказал, совершайте столько, сколько вам под силу. Поистине тех, которые были до вас, погубило то, что они задавали много вопросов и противились своим пророкам** ⁵» ",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура аль-Инширах: 4)"
                },
                {
                    "source": "²(Ибн Исхак «Фадль ас-саляти ‘аля ан-наби» стр. 86. Аль-Альбани сказал хадис мурсаль)"
                },
                {
                    "source": "³(Сура «аль-Ахзаб», аяты 45-46)"
                },
                {
                    "source": "⁴(Сура «Али Имран», аят 31)"
                },
                {
                    "source": "⁵(Аль-Бухари, Муслим)"
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Повиновение Пророку (ﷺ)",
            "text": "Повиноваться Пророку (ﷺ), это значит повиноваться Аллаху, а отказ от повиновения Пророку (ﷺ) означает отказ от повиновения Аллаху. Сказал Всевышний Аллах: « **Кто покорился Посланнику, тот покорился Аллаху. А если кто отворачивается, то ведь Мы не отправили тебя их хранителем** ¹»  Повиновение Пророку (ﷺ) обязательно, так как он является тем человеком, который довел до нас послание от Аллаха. Он оставил свою умму на ясном пути и, поистине, после него заблудится только тот, кто сошел с его пути. Сказал Всевышний Аллах: « **Пусть же остерегаются те, которые противятся его воле, как бы их не постигло искушение или не постигли их мучительные страдания** ²»  Имам Ахмад, да смилостивиться над ним Аллах, сказал: «Знаете ли вы, что такое фитна?! Фитна – это многобожие (ширк)! Ибо отвержение некоторых из его (мир ему и благословение Аллаха) высказываний может стать причиной того, что отклонение войдет в сердце, и тем самым (человек) будет погублен»  См. Шейх Мухаммад бин Салих аль-‘Усаймин комментарий к «Трем основам». Он (мир ему и благословение Аллаха) – раб Аллаха, и нельзя поклоняться ему. Мы не должны верить в божественность Мухаммада (ﷺ), в то, что он управляет Вселенной, и принимать его как объект поклонения. Напротив, он – раб, ему не принадлежит поклонение, он один из посланников. Он не способен принести пользу или вред кому-либо без соизволения Аллаха, даже самому себе. Сказал Всевышний Аллах: « **Скажи: «Я не говорю вам, что при мне сокровищницы Аллаха, и я не ведаю сокровенного. Я не говорю вам, что являюсь ангелом. Я следую лишь тому, что ниспосылается мне в откровении». Скажи: «Разве равны слепой и зрячий? Неужели вы не поразмыслите?** »",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «ан-Ниса», аят 80)"
                },
                {
                    "source": "²(Сура «ан-Нур», аят 63)"
                },
                {
                    "source": "³(Сура «аль-Ан’ам», аят 50)"
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Нельзя обожествлять Пророка (ﷺ)",
            "text": "Пророк (ﷺ) из тех, которые повинуются тому, что ему приказано Аллахом. Всевышний Аллах сказал: **Скажи: Не в моей власти навредить вам или наставить вас на прямой путь**. Скажи: Никто не защитит меня от Аллаха, и мне не найти убежища, кроме как у Него**¹ Скажи: **Я не властен принести себе пользу или причинить себе вред, если того не пожелает Аллах. Если бы я знал сокровенное, то приумножил бы для себя добро, и зло не коснулось бы меня. Однако я – всего лишь предостерегающий увещеватель и добрый вестник для верующих людей** ² Передается со слов ‘Умара (да будет доволен им Аллах), что Пророк (мир ему и благословение Аллаха) сказал: **Не превозносите меня так, как превозносят христиане ‘Ису сына Марйам. Я всего лишь раб и посему говорите: «Раб Аллаха и Его посланник». Не излишествуйте, восхваляя меня, и не возвышайте меня выше той степени, которую определил для меня Аллах. Восхваляйте меня так же, как это делает мой Господь** ³ Передается со слов Джундаба бин ‘Абдуллаха (да будет доволен им Аллах), что Пророк (ﷺ)  за пять дней до своей кончины сказал: **Поистине жившие до вас избирали могилы своих пророков местами для совершения молитв, но вы не поступайте так, ибо я запрещаю вам это** Муслим. Передается от Абу Хурайры (да будет доволен им Аллах), что Пророк (ﷺ)  сказал: **О Аллах! Не делай мою могилу идолом, которому поклоняются. Поистине силен гнев Аллаха на людей, которые превращают могилы своих пророков в мечети**  Имам Малик, Ахмад. Пророк (ﷺ)  также сказал:  **Да падет проклятие Аллаха на иудеев и христиан, которые превратили могилы своих пророков в храмы**  Аль-Бухари, Муслим. Таким образом, нам становится ясно, что ни Посланник Аллаха (ﷺ), ни те, которые ниже него по степени, не достойны того, чтобы им поклонялись. Поклонение принадлежит одному лишь Аллаху, Господу миров! Мухаммад (ﷺ)  самый достойный из всех творений Аллаха. Он самый лучший и самый ценный человек у Аллаха. Он –приближенный Аллаха, обладатель высокой степени. Всевышний Аллах сказал: **Мы отправили тебя только в качестве милости к мирам** ⁴",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Джинн», аяты 21-22)"
                },
                {
                    "source": "²(Сура «аль-А’раф», аят 188)"
                },
                {
                    "source": "³(Аль-Бухари, Муслим)"
                },
                {
                    "source": "⁴(Сура «аль-Анбия», аят 107)"
                }
            ]
        },
        { "id": 4,
            "subtitle": "Только заблудшие люди отворачиваются от милости Аллаха",
            "text": "Пророк (ﷺ) сказал: **В день Воскресения я буду господином сынов Адама. Я буду первым [воскресшим], над которым разверзнется земля, и я буду первым заступником и первым, кого будут просить о заступничестве** ¹ Аллах даровал ему Писание, сделал его Своим доверенным в распространении религии и уберег его от ошибок и упущений. Всевышний Аллах сказал об этом: **Он не говорит по прихоти. Это – всего лишь откровение, которое внушается** ² Если человек не уверует в его пророческую миссию и не признает его пророком, его вера не будет достоверной. Повинующийся ему войдет в рай, а тот, кто воспротивился ему, окажется в аду. Всевышний Аллах сказал: **Но нет – клянусь твоим Господом! – они не уверуют, пока они не изберут тебя судьей во всем том, что запутано между ними, не перестанут испытывать в душе стеснение от твоего решения и не подчинятся полностью** ³ **А того, кто воспротивится Посланнику после того, как ему стал ясен прямой путь, и последует не путем верующих, Мы направим туда, куда он обратился, и сожгем в Геенне. Как же скверно это место прибытия!** ⁴ Все пророки были посланы к своим племенам и народам, а Мухаммад (ﷺ)  – ко всему человечеству. Всевышний Аллах сказал: **Мы отправили тебя ко всем людям добрым вестником и предостерегающим увещевателем… ** ⁶ Передается от Джабира (да будет доволен им Аллах), что Пророк (ﷺ)  сказал: **Все пророки посылались к своим народам, я же был послан ко всем без исключения** Аль-Бухари, Муслим. Пророк Мухаммад (ﷺ) является последним из пророков и посланников. Он последний из пророков, которого Аллах выбрал для распространения его послания и даровал ему самое великое Писание из всех Писаний. Он величайший из всех пророков и посланников, а также любимец и друг Аллаха. Всевышний Аллах сказал: **Мухаммад не является отцом кого-либо из ваших мужей, а является Посланником Аллаха и печатью пророков (или последним из пророков)** ⁷",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Муслим, Абу Дауд 4673, Муснад 2/540)"
                },
                {
                    "source": "²(Сура «ан-Наджм», аяты 3-4)"
                },
                {
                    "source": "³(Сура «ан-Ниса», аят 65)"
                },
                {
                    "source": "⁴(Сура «ан-Ниса», аят 115)"
                },
                {
                    "source": "⁶(Сура «Саба», аят 28)"
                },
                {
                    "source": "⁷(Сура «аль-Ахзаб», аят 40)"
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Каждый, кто провозгласит себя пророком после него (ﷺ), является неверным",
            "text": "Каждый, кто провозгласит себя пророком после него, является неверным, и каждый, кто станет поддерживать лжепророка, также является неверным. Кто сомневается в этом, также является неверным. Верующий признает, что не будет пророков после него. Передают со слов Абу Хурайры (да будет доволен им Аллах), что посланник Аллаха (ﷺ) сказал: **Я и другие пророки до меня подобны прекрасному и великолепному зданию, в одном из углов которого не хватает кирпича. Люди обходят вокруг него и, удивляясь, восклицают: «Если бы и этот кирпич был на своем месте!» Я и есть этот кирпич. Я – последний из посланников** Аль-Бухари, Муслим. Передают со слов Джубайра бин Мут’има (да будет доволен им Аллах), что посланник Аллаха (ﷺ) сказал: **У меня есть пять имен: я – Мухаммад и Ахмад, и я – аль-Махи, посредством которого Аллах сотрет неверие, и я – аль-Хашир, у ног которого будут собраны люди, и я - аль-‘Акъиб** Аль-Бухари, Муслим. Аллах послал его ради благоденствия и призыва на истинный путь. Отрицание его миссии является злословием в адрес Аллаха, даже отрицанием самого Всевышнего Аллаха. Передается со слов Саубана (да будет доволен им Аллах), что Пророк (ﷺ) сказал: **Поистине появиться среди моей общины тридцать лжецов, каждый из которых провозгласит себя пророком, хотя я – последний из пророков, и после меня уже не будет другого пророка**  Он самый богобоязненный из людей. Пророк (ﷺ) сказал: **Я самый богобоязненный из вас и лучше всех вас осведомлен о границах, установленных Аллахом** Аль-Бухари, версия переданная со слов Анаса бин Малика. Аллах возлюбил и выбрал его из числа людей, и сделал его Своим приближенным. Посланник Аллаха (ﷺ) сказал: **Аллах сделал меня Своим возлюбленным, подобно тому как Он сделал Своим возлюбленным Ибрахима** Муслим. Всевышний Аллах сказал: **Для верующего мужчины и верующей женщины нет выбора при принятии ими решения, если Аллах и Его Посланник уже приняли решение. А кто ослушается Аллаха и Его Посланника, тот впал в очевидное заблуждение** ² Безусловно, каждый, кто подчинился пророку Мухаммаду (ﷺ), является богобоязненным. **Когда верующих зовут к Аллаху и Его Посланнику, чтобы он рассудил их, они говорят: «Слушаем и повинуемся!» Именно они являются преуспевшими** ³",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Аль-Бухари, Муслим, Абу Дауд 4252, Муснад 5/278)"
                },
                {
                    "source": "²(Сура «аль-Ахзаб», аят 33.)"
                },
                {
                    "source": "³(Сура «ан-Нур», аят 51)"
                }
               
            ]
        },
        {
            "id": 6,
            "subtitle": "Условия произнесения свидетельства «Мухаммад – посланник Аллаха» (Мухаммадан расулю Ллах)",
            "text": "Эти слова свидетельства имеют семь условий, подобно тому, как имеют условия слова свидетельства «Ля иляха илляЛлах». Эти слова не принесут пользу человеку до тех пор, пока он не станет их соблюдать и не поймет их в соответствии с Кораном и достоверной Сунной. Условия, указанные ниже, были отмечены авторитетными учеными Ислама в соответствии с Кораном и Сунной. Эти условия следующие:",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
      
        {
            "id": 7,
            "subtitle": "1 - Признание Мухаммада (ﷺ) пророком и убежденность в этом",
            "text": "Всевышний Аллах сказал: **Верующими являются только те, которые уверовали в Аллаха и Его Посланника, а потом не испытывали сомнений…** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Худжурат», аят 15)"
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "2 - Произнесение этого свидетельства языком и подтверждение этого",
            "text": "Всевышний Аллах сказал: **Таковы аяты Аллаха. Мы читаем их тебе во истине, и ты – один из посланников** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Бакара», аят 252.)"
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "3 - Подчинение Пророку (ﷺ), выполнение его приказов и отказ от всего того, что он запретил",
            "text": "Всевышний Аллах сказал: **Скажи: Если вы любите Аллаха, то следуйте за мной, и тогда Аллах возлюбит вас и простит вам ваши грехи, ведь Аллах – Прощающий, Милосердный** ¹ Аллах связал Свою любовь с подчинением пути Пророка (ﷺ), поэтому тот, кто желает добиться любви Аллаха, пусть подчиниться Сунне пророка Мухаммада (ﷺ).",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «Али Имран», аят 31.)"
                }
            ]
        },
        {
            "id": 10,
            "subtitle": "4 - Признание всех изречений Пророка (ﷺ)",
            "text": "то есть приказы, запреты, сообщения относительно событий в прошлом и будущем. Всевышний Аллах сказал: **Берите же то, что дал вам Посланник, и сторонитесь того, что он запретил вам. Бойтесь Аллаха, ведь Аллах суров в наказании**",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Хашр», аят 7)"
                }
            ]
        },
        {
            "id": 11,
            "subtitle": "5 - Любовь к Пророку (ﷺ) должна превосходить любовь испытываемую к другим творениям",
            "text": "Сказал Всевышний Аллах: **Пророк ближе к верующим, чем они сами…** ¹ Передают со слов Анаса (да будет доволен им Аллах), что Пророк (ﷺ) сказал: **Не уверует никто из вас, пока не станет любить меня больше, чем любит своего отца, и своих детей, и всех людей вообще** Аль-Бухари, Муслим.",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Ахзаб», аят 6)"
                }
            ]
        },
        {
            "id": 12,
            "subtitle": "Предпочтение слов Пророка (ﷺ) словам остальных людей и соблюдение его Сунны",
            "text": "Сказал Всевышний Аллах: **О те, которые уверовали! Не опережайте Аллаха и Его Посланника…** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Худжурат», аят 1.)"
                }
            ]
        },
        {
            "id": 13,
            "subtitle": "7 - Уважение и почитание Пророка (ﷺ)",
            "text": " Сказал Всевышний Аллах: **Воистину, Мы отправили тебя свидетелем, добрым вестником и предостерегающим увещевателем, чтобы вы уверовали в Аллаха, Его Посланника, почитали и уважали его, прославляли Его утром и перед закатом** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Сура «аль-Фатх», 8-9)"
                }
            ]
        }
    ]
}