{
    "id": "02",
    "author": "Islam forum",
    "category": "Aqidah",
    "published": "2009",
    "lang": "En",
    "title": "Conditions of La ilaha illallah from the Quran and Sunnah",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FconditionOfShadahEn.png?alt=media&token=fb8784fd-8474-4a1e-ac30-5fad43edec79",
  
   
    "chapters": [
        {
            "id": 1,
            "subtitle": "Seven Conditions of Shadah",
            "text": "Sheikh Abdur-Rahman ibn Hasan Ali Sheikh said, The testimony 'La ilaha illallah' requires seven conditions, and pronouncing this testimony will not be beneficial if any of these conditions is missing. The first: Knowledge, excluding ignorance. The second: Conviction, excluding doubt. The third: Acceptance, incompatible with rejection. The fourth: Obedience, excluding disobedience (neglect). The fifth: Sincerity, excluding polytheism. The sixth: Truthfulness, excluding hypocrisy. The seventh: Love, incompatible with hatred (enmity)¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(See “Fathul-Majid” page 190)"
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "**1 - Arguments from the Quran and Sunnah on these seven conditions**",
            "text": "Knowledge that negates ignorance Allah, the Most High, said: **Know, there is no one worthy of worship except Allah, and seek forgiveness for your sin.** (47:19). It is narrated from Usman ibn 'Affan that the Messenger of Allah (peace and blessings of Allah be upon him) said: **One who dies knowing that there is no one worthy of worship except Allah will enter Paradise.** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Muslim 26)"
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "**2 - Certainty that negates doubt**",
            "text": "Allah, the Most High, said: **The believers are only those who have believed in Allah and His Messenger, and then they did not doubt.** (49:15). Allah, the Most High, also said: **Set forth to them the parable of two men. We made for one of them two gardens of vine, and We surrounded both with date-palms, and placed crops in the midst of them. Both gardens yielded their fruits, and failed not in the least therein, and We caused a river to gush forth in the midst of them. He had abundance, and he said to his companion while he was conversing with him: 'I am more than you in wealth and have a mightier man.' And he went into his garden while he was unjust to himself. He said: 'I do not think that this will ever perish, and I do not think that the Hour will come. And if indeed I am brought back to my Lord, I surely shall find something better than this as a return.' His companion said to him while he was conversing with him: 'Do you disbelieve in Him Who created you out of dust, then out of Nutfah (a minute quantity of semen), then fashioned you into a man?' But as for my Lord, He is Allah, and I do not associate anyone with my Lord.** (18:33-38). Abu Hurairah also narrated that the Messenger of Allah (peace and blessings of Allah be upon him) said: **I bear witness that there is no deity worthy of worship except Allah, and I bear witness that I am the Messenger of Allah. Whichever servant of Allah meets Him with these two testimonies, having no doubt about their truth, will surely enter Paradise.** ²\nSheikh Abu Butayn said, 'The Quran indicates that doubt in the fundamentals of religion is disbelief. Doubt (shakk) is wavering between two things, like one who does not affirm the truthfulness of the Messenger (peace and blessings of Allah be upon him) but also does not accuse him of lying. Or one who does not affirm the obligation of prayer but also does not deny it, and so on. All of this is disbelief by unanimous agreement!' However, a distinction must be made between doubt and the fleeting suggestions of Satan. Ibn Taymiyyah said, 'Whispering (waswas) is what enters the heart without a person's will. If a servant of Allah detests these suggestions and rejects them, his aversion to them is a true manifestation of faith!'⁴",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Muslim 27)"
                },
                {
                    "source": "²(Muslim 31)"
                },
                {
                    "source": "³(See 'Hukmu takfir al-mu’ayyin' 17)"
                },
                {
                    "source": "⁴(See 'ad-Diya ash-Sharik' 374)"
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "**3 - Acceptance Incompatible with Rejection**",
            "text": "The Most High Allah said: **In the same way, whenever We sent a warner to any town, its luxurious inhabitants, despite their indulgence, would say, We have indeed found our fathers committed to this path, and we will certainly follow in their footsteps!** (43: 23). The Most High Allah also said: **Certainly, this is how We deal with the wrongdoers. When they were told, There is no god but Allah, they became arrogant and said, Shall we forsake our gods for the sake of a possessed poet?** (37: 34-36). Abu Musa reported that the Prophet (peace and blessings of Allah be upon him) said: **The guidance and knowledge that Allah has sent me with to the people are like abundant rain that fell on the earth. A part of the land was fertile, absorbed the water, and produced various plants and vegetation. Another part of it was hard, it retained the water, and Allah made it beneficial to the people who used the water for drinking, watering animals, and irrigation. Rain also fell on another part of the land, which was like a plain that did not retain the water, and nothing grew on it. These parts of the land are like the people who have embraced the religion of Allah, benefitted from what Allah sent me with, acquired knowledge themselves, and passed it on to others, as well as those who did not turn to it themselves and did not accept the guidance of Allah, with which I was sent to the people.** ¹ Abdullah ibn Mas'ud used to say, Whoever shows disbelief in even a single letter of the Quran has disbelieved in it in its entirety! Abdur-Razzaq 8/472. Sheikhul-Islam Ibn Taymiyyah affirmed its authenticity. See al-Fatawa al-Kubra 5/48. Imam Ibn Battah said, Anyone who denies what Allah has ascribed in His Book or what the Messenger of Allah (peace and blessings of Allah be upon him) has established in the Sunnah, and rejects it, deeming it false, is an unbeliever! See al-Ibana al-Kubra 2/764. Imam Ibn Abi'l-Izz said, There is no disagreement among scholars that if someone openly shows non-acceptance of well-known obligations, which are conveyed through multiple ways, or well-known prohibitions, and the like, then they should be called to repentance, and in case of persistence, treated as an apostate².",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Al-Bukhari 79, Muslim 2282)"
                },
                {
                    "source": "²(See 'Sharh Aqida at-Tahawiyya' 355)"
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "4 - Obedience that excludes disobedience",
            "text": "Allah, the Most High, said: **But he who has submitted (in Islam) to Allah, while being a doer of good, has indeed grasped the most trustworthy handhold** (31:22). Allah, the Most High, also said: **But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission** (4:65). Abdullah ibn 'Amr reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: **None of you will truly believe until his desires follow that with which I have come.** ¹\nThere is a difference of opinion among scholars regarding the authenticity of this hadith. However, Imam Abu Nu'aym, Imam an-Nawawi, Sheikh Ibn al-Qayyim, Imam Ibn Muflih, Hafiz as-Suyuti, Sheikh Muhammad ibn 'Abdul-Wahhab, Sheikh Siddiq Hasan Khan, and Hafiz al-Hakami considered it authentic.²\nEven if this hadith were weak in terms of its chain of narration, its meaning is correct because it is supported by the Quran. Allah, the Most High, said: **It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error** (33:36). Allah, the Most High, also said: **And if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah?** (28:50). However, not every act of disobedience to Allah makes a person a disbeliever. There are types of disobedience that make a person a disbeliever, and there are types that make a person sinful but not a disbeliever!",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Ibn Abi 'Asim in 'as-Sunnah' 15, al-Bayhaqi in 'al-Madhkal' 209, al-Hatib in 'at-Tarikh' 4/469)"
                },
                {
                    "source": "²(See 'al-Arba'in' #41,'al-Adabu-sh-Shar'iya' 3/69, 'Usul al-iman' 1/264, 'Ma'aridj al-kabul' 2/78)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "**5 - Sincerity that excludes polytheism**",
            "text": "The Most High and Almighty Allah said: **So worship Allah, [being] sincere to Him in religion** (39:2). Abu Huraira reported: Once I asked, O Messenger of Allah, who will be the happiest of people because of your intercession on the Day of Resurrection? The Messenger of Allah (peace be upon him) said to me, **O Abu Huraira, I thought no one would ask me about it before you, as I have seen how eagerly you have been listening to my words. The happiest of people because of my intercession on the Day of Resurrection will be those who said, La ilaha illallah'(none has the right to be worshipped but Allah), with sincerity in their hearts.** ¹",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Al-Bukhari 99)"
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "**6 - Truthfulness that excludes hypocrisy**",
            "text": "The Most High Allah said: **Among the people are some who say, We believe in Allah and the Last Day, but they are not believers. They [think to] deceive Allah and those who believe, but they deceive not except themselves, and perceive [it] not** (2:8-9). Allah, the Most High, also said: **When the hypocrites come to you, [O Muhammad], they say, We testify that you are the Messenger of Allah. And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars** (63:1). Mu'adh ibn Jabal reported that the Prophet (peace and blessings be upon him) said: **Whoever testifies that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah sincerely from his heart, Allah will make the Fire forbidden for him.** ¹\nImam Abu Muzaffar as-Sam'ani said, 'The disbelief of hypocrisy is the confession with the tongue of what is not in the heart.'²\nQadi Abu Bakr ibn al-'Arabi said, 'Hypocrisy is the declaration with the tongue or the action that contradicts what is in the heart of words and beliefs. Hypocrisy in monotheism is outright disbelief, and hypocrisy in actions is a great sin.'³\nHafiz Ibn Kathir said, 'Hypocrisy is the display of good and the concealment of evil, and it comes in various forms. Hypocrisy in conviction, which leads one to eternal Hell, and hypocrisy in deeds, which is the greatest of sins.'⁴\nHypocrisy in deeds includes qualities that the Prophet (peace and blessings be upon him) mentioned in a famous hadith: **The true hypocrite is the one in whose hand and tongue the believers are safe. And the true martyr is the one who has been killed in the way of Allah.** ⁵",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Al-Bukhari 128, Muslim 32)"
                },
                {
                    "source": "²(See 'Tafsir as-Sam'ani' 1/46)"
                },
                {
                    "source": "³(See 'Aridatu-l-ahuwazi' 10/110)"
                },
                {
                    "source": "⁴(See 'Tafsir Ibn Kathir' 1/87)"
                },
                {
                    "source": "⁵(Al-Bukhari 34, Muslim 58)"
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "**7 - Love Incompatible with Hatred (Enmity)**",
            "text": "The Most High Allah said: **Woe to those who disbelieve! They will make futile their deeds. That is because they have disliked what Allah has sent down, so He rendered worthless their deeds** (47:9). Allah, the Most High, also said: **O you who have believed, whoever of you should revert from his religion - Allah will bring forth [in place of them] a people He will love and who will love Him** (5:54). Anas reported that the Messenger of Allah (peace and blessings be upon him) said: **Three qualities, whoever possesses them, will find the sweetness of faith: Whoever loves Allah and His Messenger more than anyone else, loves a person only for the sake of Allah, and hates to return to disbelief after Allah has saved him from it, as much as he hates to be thrown into the Fire.** ¹\nThis great hadith indicates that the sweetness of faith is experienced by those who love Allah and His Messenger (peace and blessings be upon him) more than anything else, love and hate solely for the sake of Allah, and have no desire to return to disbelief after Allah has blessed them with Islam, just as they would abhor being cast into the Fire.²",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Al-Bukhari 16, Muslim 43)"
                },
                {
                    "source": "²(See 'al-Mufhim' 1/215, 'al-Ikmal' 1/278)"
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "**8 - Disavowal and Renunciation of Any Other Religion and All That Is Worshiped Besides Allah**",
            "text": "The Most High Allah said: **Whoever disbelieves in Taghut and believes in Allah has grasped the most trustworthy handhold that never breaks. And Allah is Hearing and Knowing** (2:256). The Most High Allah conveyed the words of the prophet Hud (peace be upon him), saying: **Verily, I call Allah to witness and bear you witness that I am free from whatever you associate with Allah** (11:54-55). The Most High Allah also said: **And [Ibrahim] said to his father and his people, 'Indeed, I am disassociated from that to which you worship except for He who created me; and indeed, He will guide me** (43:26-27). Furthermore, Allah, the Most High, said: **Indeed, the religion in the sight of Allah is Islam** (3:19). Also, Allah, the Most High, said: **And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers** (3:85). From the narration of Tariq ibn Ashyamah, it is reported that the Messenger of Allah (peace and blessings be upon him) said: **Whoever says, La ilaha illallah, and then rejects all that is worshiped besides Allah, their property and blood become inviolable, and their affair rests with Allah.** ¹\nThis condition is highly important and is one of the most fundamental. Even if a person testifies the La ilaha illallah, utters it sincerely and believes it in their heart, worships only Allah, but still doesn't consider all other objects of worship by people as false, their testimony becomes invalid!²\nIf, under all the conditions of the Shahada mentioned, a person still believes that there is, for example, another religion that is also true, like those who claim that Christians and Jews are not disbelievers and that they will be judged based on their scriptures, their testimony of La ilaha illallah is invalidated! Finally, all praise is due to Allah, the Lord of the worlds. Peace and blessings be upon our Prophet Muhammad, his family, his companions, and all those who sincerely followed in their path!",
            "url": "",
            "isAudioUrl" : false,
            "sources": [
                {
                    "source": "¹(Muslim 23)"
                },
                {
                    "source": "²(See 'Taysir al-Aziz al-Hamid' 286)"
                }
            ]
        }
    ]
}