{
    "id": "06",
    "author": "Ислам форум",
    "category": "Fiqh",
    "published": "2012",
    "lang": "Ru",
    "title": "Обряды, связанные с рождением ребёнка",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2Fobryadi.jpeg?alt=media&token=70174a14-50cf-41db-acd5-02e246c48224&_gl=1*1gdxln2*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5ODc0NzI0My42OS4xLjE2OTg3NDg1ODYuNTEuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Предисловие",
            "text": "Хвала Аллаху – Господу миров, мир и благословение Аллаха нашему пророку Мухаммаду, членам его семьи и всем его сподвижникам! А затем:Каждый мусульманин должен знать, что Ислам установил наилучшие и самые красивые обряды, связанные с рождением детей. И эти обряды включают в себя благодарность Аллаху в виде жертвоприношения, в котором есть польза, как для самого новорожденного ребёнка, так и для других мусульман, которые не остаются безучастными в этом благом деле, ведь и им достается часть жертвенного животного, как и милостыня, подаваемая на вес волос новорожденного. Поэтому, пусть каждый мусульманин стремится совершать эти красивые обряды, возрождая тем самым Сунну нашего Посланника (мир ему и благословение Аллаха), ведь в достоверном хадисе сказано: **«Тот, кто оживит мою Сунну, которую умертвили люди после меня, получит награду подобную тем, кто совершал эту Сунну, что не уменьшит их собственной награды! А тот, кто внесет нововведение, которое будут совершать люди, понесет на себе бремя этого, что не уменьшит и бремени тех, кто совершал нововведения!»**¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(Ибн Маджах 209, ат-Тирмизи 2677. Этот хадис имеет несколько путей передач, усиливающих друг друга. И его достоверность подтвердили имам Абу ‘Иса ат-Тирмизи, имам аль-Багъауи, шейх аль-Альбани. См. “Сунан ат-Тирмизи” 3/128, “Шарху-Сунна” 1/198, “аз-Зауаджир” 1/98, “Сахих Сунан Ибн Маджах”.)"
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "О том, что желательно радовать родителя новостью о рождении ребёнка, а также поздравлять его в связи с этим и обращаться за них с мольбами",
            "text": "Рождение ребёнка – это радостная весть для родителя. И Всевышний Аллах, радовавший этим известием Своих посланников, именует это важное событие «радостной вестью» во многих аятах Корана. Так, Аллах сказал: **«Когда он (Закария) стоял на молитве в молельне, ангелы воззвали к нему: “Аллах радует тебя вестью о Яхье”»**\n(Али ‘Имран 3: 39).\n Также Всевышний Аллах сказал: **«Мы сообщили ей (жене Ибрахима) радостную весть об Исхакъе, а вслед за Исхакъом – о Я’къубе»**\n(Худ 11: 71). Поэтому, пусть тот, кто узнал, что у мусульманина родился ребёнок, поспешит обрадовать его этой радостной вестью. К тому же, радовать верующих – это одно из наилучших деяний пред Аллахом, ведь передаётся, что Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«Самое любимое деяние пред Аллахом Всемогущим и Великим – эта радость, которую ты приносишь мусульманину».**¹\nИмам Ибн аль-Къайим сказал: “Желательно радовать того, у кого родился ребёнок, и поздравлять родителя”.\nСм. “Тухфатуль-маудуд” 32.Следует обращаться с мольбами за новорожденного, как отцу, так и тем, кто его поздравляет. Му’ауия ибн Къурра, сын сподвижника Къурры аль-Музани (да будет доволен ими Аллах) рассказывал: “Когда у меня родился Ийяс, я пригласил некоторых сподвижников Пророка (мир ему и благословение Аллаха) и накормил их. Они обратились с мольбами к Аллаху, и я сказал им: «Вы обращались с мольбами, и да благословит вас Аллах в том, что вы просили! И поистине, я тоже хочу обратиться с мольбами, а вы говорите на мои слова «Амин». И я стал много обращаться с мольбами к Аллаху за сына, прося за его религию и за его разум”. аль-Бухари в “аль-Адаб аль-муфрад” 1255. Шейх аль-Альбани подтвердил достоверность.Имам Ибн аль-Къайим сказал: “Если человек опоздал с радостной вестью о рождении ребёнка, то ему желательно поздравить родителя. Разница между этими вещами в том, что в первом случае – это сообщение родителю радостной вести, а во втором – это его поздравление и обращение за него с мольбой о благе после того, как он уже узнал об этой новости. По этой причине, когда Аллах принял покаяние сподвижника Ка’ба ибн Малика и его сторонников, к нему прибежал тот, кто принес эту радостную новость. А когда он пришёл в мечеть, то люди уже подходили и поздравляли его”. См. “Тухфатуль-маудуд” 33.Что же касается известных слов поздравления в связи с рождением ребенка, которые передаются от аль-Хасана аль-Басри, которые приводятся в книге «аль-Азкар» имама ан-Науауи и в книге «Крепость мусульманина» аль-Къахтани: “Да сделает Аллах для тебя благословенным того, кто был дарован тебе, да воздашь ты Дарителю благодарностью. И да достигнет новорожденный полной зрелости и да будет тебе дано увидеть проявления его почтительности”, - то это сообщение является слабым.Однако имам ат-Табарани в своей книге «ад-Ду’а» в главе, которую он назвал «Как следует поздравлять с рождением ребенка», привел следующее сообщение: “Однажды у одного человека, который часто находился в обществе аль-Хасана аль-Басри, родился сын, и тогда один из людей поздравил его словами: «Поздравляю тебя с рождением всадника!» На это аль-Хасан сказал: «Откуда тебе знать, что он будет всадником? Быть может он будет плотником или портным». Тогда тот человек спросил: «А как мне говорить?» На что аль-Хасан ответил: «Говори: “Пусть Аллах сделает его благословенным для тебя и для общины Мухаммада (мир ему и благословение Аллаха)”»²\nТакже со слов Хаммада ибн Зайда сообщается: “Когда Айюб (ас-Сахтияни) поздравлял с рождением ребенка, то говорил:\n**Джа’аляху-Ллаху мубаракан ‘алейк, уа ‘аля уммати Мухаммад**\n\n**جَعَلَهُ اللَّهُ مُبَارَكًا عَلَيْكَ وَعَلَى أُمَّةِ مُحَمَّد**\n\n“Пусть Аллах сделает его благословенным для тебя и для общины Мухаммада, мир ему и благословение Аллаха”. ³Мольба в связи с рождением ребёнка не установлена от Пророка (мир ему и благословение Аллаха), но это не означает, что нельзя произносить за новорожденного определенные мольбы. И именно данный вид мольбы передаётся достоверно от двух известных таби’инов (последователей сподвижников).",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(Ибн Аби ад-Дунья в “Къада аль-хауаидж” 36, аль-Байхакъи в “Шу’аб аль-иман” 2/452, ат-Табарани в “аль-Кабир” 3/209. Хадис хороший. См. “ас-Сильсиля ас-сахиха” 2291, «Сахих аль-джами’» 176.)"
                },
                {
                    "source": "²(ат-Табарани в “ад-Ду’а” 945, Ибн Аби ад-Дунья в “аль-“Ияль” 1/363. Исследователь книги «ад-Ду’а» назвал иснад хорошим)"
                },
                {
                    "source": "³(ат-Табарани в “ад-Ду’а” 945, Ибн Аби ад-Дунья в “аль-“Ияль” 1/363. Исследователь книги «Усуль аль-амани би-усуль ат-тахани» назвал иснад хорошим)"
                }
            ]
        },

        {
            "id": 3,
            "subtitle": "О желательности совершения ат-Тахник для новорожденного",
            "text": "**Что такое ат-тахник?**\nТахник – практикующееся по примеру Пророка (мир ему и благословение Аллаха) разжёвывание финика и протирание образовавшейся кашицей нёба новорожденного, с последующим попаданием ее в желудок, сразу после рождения или вскоре после этого.\nСм. “аль-Мисбах аль-мунир” 150, “Фатхуль-Бари” 4/12.\n**Законность совершения тахника**\nАбу Муса аль-Аш’ари (да будет доволен им Аллах) рассказывал: “Когда у меня родился сын, я принес его к Пророку (мир ему и благословение Аллаха), который назвал его Ибрахимом. Он сделал ему тахник фиником и призвал на него благословение, а потом отдал его мне”. аль-Бухари 6198.Также ‘Аиша (да будет доволен ею Аллах) рассказывала: “Новорожденных детей обычно приносили Посланнику Аллаха (мир ему и благословение Аллаха), и он призывал на них благословения Аллаха и протирал прожеванным фиником их нёбо”. Муслим 2147.Имам ан-Науауи говорил: “Учёные сошлись в желательности тахника для ребёнка сразу после того, как он родился”. См. “Шарх Сахих Муслим” /122.Также ан-Науауи говорил: “Необходимо, чтобы совершающий тахник был из числа праведных людей, и даже если это не мужчина, то чтобы была праведная женщина”. См. «аль-Маджму’» 8/443.О желательности совершения тахника также говорили имамы Ибн аль-Къайим, ас-Сан’ани и др. См. “Тухфатуль-маудуд” 43, “Субулю-с-Салям” 4/195.Тахник может сделать любой праведный мусульманин. И тому, кто делает тахник для ребенка, следует обратиться к Аллаху за него с мольбой по примеру Пророка (мир ему и благословение Аллаха) и призвать на него благословения Аллаха.\n**Мудрость совершения тахника**\nЗдесь необходимо разъяснить мудрость в совершении тахника. Ученые высказывали два мнения относительно того, по какой причине сподвижники носили своих детей к Пророку (мир ему и благословение Аллаха), чтобы он делал их детям тахник. Некоторые ученые говорили, что причина этого состояла в том, чтобы первым, что попадет в желудок новорожденного, была слюна Пророка (мир ему и благословение Аллаха), которого Всевышний Аллах создал благословенным.Второе мнение заключается в том, что мудрость этого состояла в том, чтобы первым, что попадет в желудок новорожденного, было нечто сладкое, а в частности финик, плод дерева которое Пророк (мир ему и благословение Аллаха) сравнил с верующим. Хафиз Ибн Хаджар говорил: “Это делалось для того, чтобы подготовить новорожденного к принятию пищи, чтобы тем самым укрепить его”. См. “Фатхуль-Бари” 4/12.Нет сомнения в том, что в тахнике, который совершал Пророк (мир ему и благословение Аллаха) новорожденным присутствовали обе вышеназванные причины.Шейх Ибн ‘Усаймин говорил: “Тахник делался для снискания благодати посредством слюны Пророка (мир ему и благословение Аллаха), чтобы первым, что попадет в желудок ребенка, была его слюна. Сподвижники, когда у них рождались мальчики или девочки, приходили к Посланнику Аллаха (мир ему и благословение Аллаха) со своими детьми и с финиками, чтобы он сделал тахник. Для чего делался тахник: чтобы первым, что попадет в желудок новорожденного, была слюна Посланника (мир ему и благословение Аллаха), или же чтобы был первым финик, что попадет в желудок ребенка? Если мы скажем, что смысл этого в первом варианте, то тогда тахник – это лишь особенность Пророка (мир ему и благословение Аллаха), и никто не может делать тахник после него, поскольку нельзя искать благословение посредством слюны или пота кого-либо, кроме Посланника Аллаха (мир ему и благословение Аллаха). Если же мы скажем, что мудрость тахника во втором, т.е. чтобы первым, что попадет в желудок новорожденного, был финик, то тогда мы скажем: «Тахник следует совершать каждому ребенку»”. См. “Шарх Рияду-ссалихин” 1/271.Таким образом, если тахник совершается с целью снискать благословения для ребёнка посредством совершающего тахник, кем бы он ни был, помимо Посланника Аллаха (мир ему и благословения Аллаха), то это не дозволено! Имам аш-Шатыби передал единогласное мнение сподвижников, что после смерти Пророка (мир ему и благословение Аллаха) нельзя искать благословение посредством какого-либо человека. Сказал аш-Шатыби: “Нельзя искать благословение посредством кого-либо после Пророка (мир ему и благословение Аллаха), а тот, кто будет делать это, подражая Пророку (мир ему и благословение Аллаха), тот совершит нововведение! Это все равно, что если бы человек взял в жены больше, чем четыре жены, говоря, что он следует в этом примеру Пророка (мир ему и благословение Аллаха)!” См. “аль-И’тисам” 2/11.Если же тахник совершается с намерением поступать в соответствии с Сунной Пророка (мир ему и благословение Аллаха), чтобы первым, что попало в желудок младенца, был финик, то в таком случае поступать так желательно, о чем говорили имамы ан-Науауи, Ибн аль-Къайим и др.И то мнение, что тахник не был особенностью лишь Пророка (мир ему и благословение Аллаха), является более сильным. Ведь Умм Сулейм (да будет доволен ею Аллах) сказала: “Когда я забеременела ‘Абдуллахом, я родила его ночью. И я не желала, чтобы кто-либо сделал ему тахник прежде, чем это сделает Посланник Аллаха (мир ему и благословение Аллаха)”. Ахмад 3/105. Хадис достоверный, и основа его есть у аль-Бухари и Муслима.В этом хадисе ясное указание на то, что сподвижники не ограничивали тахник лишь Пророком (мир ему и благословение Аллаха), однако они предпочитали, чтобы именно он делал его их детям из-за его благословения.Также сообщается, что когда родился аль-Хасан аль-Басри, то тахник ему сделал ‘Умар ибн аль-Хаттаб (да будет доволен им Аллах). См. “аль-Бидая уа-ннихая” 9/303.Также сообщается, что когда у имама Ахмада родила жена, он велел ей взять финики, разжевать их и сделать новорожденному тахник.¹\n**Можно ли сделать тахник чем-либо помимо финика, если его нет?**\nХафиз Ибн Хаджар сказал: “Если нет возможности найти сушенный финик, то можно использовать свежий финик, но если и это недоступно, то можно использовать что-либо сладкое, например, мед”².\nО мудрости того, почему Пророк (мир ему и благословение Аллаха) выбирал именно финик, говорили и многие современные врачи. Так, например, доктор Мухаммад ‘Али Альбар говорил, что уровень содержания глюкозы в крови новорожденного весьма низкий, и чем меньше вес новорожденного, тем меньше глюкозы содержится в крови. И как раз сладости повышают уровень глюкозы в крови, а наилучшим и полезным из сладостей является финик.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(См. “Тухфатуль-маудуд)"
                },
                {
                    "source": "²(См. “Фатхуль-Бари” 9/588)"
                }
            ]
        },

        {
            "id": 4,
            "subtitle": "О произнесении слов азана в ухо новорожденного",
            "text": "Относительно данного положения и желательности произнесения слов азана в ухо новорожденного было разногласие среди имамов по причине разногласия в достоверности доводов данной главы.Ученые, считавшие этот поступок желательным, опирались на хадис от Абу Рафи’а (да будет доволен им Аллах), который рассказывал: “Я видел, как Посланник Аллаха (мир ему и благословение Аллаха) читал азан в ухо аль-Хасану ибн ‘Али, когда его родила Фатима”. Абу Дауд 5105, ат-Тирмизи 1514. Достоверность этого хадиса подтвердили имам Абу ‘Иса ат-Тирмизи и имам аль-Хаким.Однако многие ученые говорили, что этот хадис является слабым по причине передатчика по имени ‘Асым ибн ‘Убайдуллах. Такие имамы, как Шу’ба, Ибн Ма’ин, Ахмад, аль-Бухари, Ибн Хаджар и др. назвали его слабым передатчиком. См. “Тахзиб аль-камаль” 13/500.Поэтому, имам аз-Захаби возразил на слова аль-Хакима, что данный хадис с достоверным иснадом, и сказал: «Этот ‘Асым – слабый передатчик». См. “аль-Мустадрак” 3/179.Также и после слов имама ат-Тирмизи, что этот хадис достоверный, шейх аль-Мубаракфури не согласился с ним и стал разъяснять причину слабости этого хадиса. См. “Тухфатуль-ахуази” 5/108.Этот хадис назвали слабым также имамы Ибн аль-Къаттан, Ибн Хаджар и аль-Мунауи. См. “аль-Уахм уаль-ихам” 4/594, “Тальхысуль-хабир” 4/149, “Файдуль-Къадир” 5/217.Что касается шейха аль-Альбани, то он в одно время считал данный хадис достоверным, в силу существования других хадисов по данной теме. Однако впоследствии он пересмотрел это мнение и тоже назвал данный хадис слабым. См. “ас-Сильсиля ад-да’ифа” 1/491.Сторонники желательности произнесения слов азана также усиливали это и другими хадисами:Со слов Ибн ‘Умара (да будет доволен им Аллах) сообщается, что он сказал: “Пророк (мир ему и благословение Аллаха) произносил слова азана в ухо аль-Хасана и аль-Хусайна, когда они родились”. Таммам в “аль-Фауад” 333.Однако этот хадис очень слабый, так как в иснаде этого хадиса передатчик по имени аль-Къасим ибн Хафс, которого имам Ахмад обвинял во лжи. См. “ар-Рауд аль-басим би-тартиб уа-ттахридж Фауаид Таммам” 3/447.Также это мнение усиливали хадисом, который передается со слов Ибн ‘Аббаса (да будет доволен им Аллах): «Когда родился аль-Хасан, Посланник Аллаха (мир ему и благословение Аллаха) произнёс азан в правое его ухо, а икъама в левое». аль-Байхакъи 6/390.Этот хадис также недостоверный. В его иснаде целых три проблемы: Мухаммад ибн Юнус и Хасан ибн ‘Амр, которых имамы аль-Бухари, ад-Даракъутни, Абу Дауд и др. называли лжецами, а также аль-Къасим ибн Мутайиб, который является неприемлемым передатчиком. Поэтому имам аль-Байхакъи, шейх аль-Альбани и другие назвали этот хадис недостоверным. См. “Тахзиб аль-камаль” 26/66-78, “Тарих аль-кабир” 2/299, “ас-Сильсиля ад-да’ифа” 321.Также сторонники желательности азана для новорожденного усиливали этот поступок хадисом, который передается от Умм аль-Фадль бинт аль-Харис (да будет доволен ею Аллах), которая рассказывала: “Когда я родила сына, я принесла его к Пророку (мир ему и благословение Аллаха), который произнес слова азана в правое ухо, а слова икъама в левое, и назвал его ‘Абдуллахом”. ат-Табарани в “аль-Аусат” 9/101, Ибн ‘Асакир в “Тарих Димашкъ” 26/352.Однако этот хадис также недостоверный. Имам аль-Хайсами сказал: “В иснаде этого хадиса передатчик по имени Ахмад ибн Рашид аль-Хиляли, которого обвиняли во лжи по причине данного хадиса”. См. “Маджма’у-ззауаид” 5/187.И наконец, они усиливали его пятым хадисом, который передается со слов аль-Хасана ибн ‘Али (да будет доволен им Аллах), что Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Если у человека родился ребенок, и он произнес азан ему в правое ухо, а икъама в левое, то ему не причинит вреда джин по имени Умм Сыбьян». Абу Я’ля 6747, Ибн ас-Сунни 2/173.Этот хадис также недостоверный, и слабым его назвали аль-Байхакъи, аль-Хайсами, аль-Бусыри и др. См. “аль-Итхаф” 7/91, “Маджма’у-ззауаид” 4/59.Однако шейх аль-Альбани не был согласен с такой оценкой и сказал, что данный хадис не просто слабый, а выдуманный, поскольку в его цепи присутствуют два передатчика: Яхья ибн аль-‘Аля и Маруан ибн Салим, которых обвиняли в выдумывании хадисов. Имам Ахмад сказал: “Яхья ибн аль-‘Аля лжец, выдумывавший хадисы!” А Маруана ибн Салима называли лжецом, выдумывавшим хадисы, имамы Абу ‘Аруба аль-Харрани и ас-Сиджи. См. “Тахзиб аль-камаль” 27/393 и 31/486.По этой причине аль-Альбани назвал этот хадис вымышленным. См. “ас-Сильсиля ад-да’ифа” 321.Также, сторонники правомочности произнесения азана и икъама в ухо новорожденного подкрепляют это мнение поступком халифа – ‘Умара ибн ‘Абдуль-‘Азиза, от которого передают, что когда у него рождался ребенок, он произносил слова азана в правое ухо, а слова икъама в левое.Это сообщение упомянул хафиз Ибн Хаджар и сказал: “Я не видел у этого сообщения иснада. Его приводил Ибн аль-Мунзир”. См. “Тальхыс аль-хабир” 4/149.Однако это сообщение от ‘Умара ибн ‘Абдуль-‘Азиза приводится в сборнике ‘Абду-р-Раззакъа «аль-Мусаннаф» (№ 7985) с непрерывным иснадом. Но это сообщение недостоверное, поскольку в цепи этого сообщения присутствует передатчик по имени Ибрахим ибн Аби Яхья, которого обвиняли во лжи. Абу Хамам говорил о нем: “Я слышал, как он ругал некоторых саляфов”. Когда имама Малика спросили о нем: «Является ли он надежным в хадисах?», - он сказал: “Нет! И в религии тоже ненадежный!” Имам Ахмад сказал о нем: “Он къадарит, джахмит, и всё зло содержится в нем”. Имам аль-Бухари сказал: “Он къадарит и джахмит, его оставили Ибн аль-Мубарак и другие”. Ибн Ма’ин и Абу Дауд сказали о нем: “Рафидит и лжец!” См. “Тазкира аль-хуффаз” 1/246.И это и есть все аргументы, касающиеся вопроса произнесения азана и икъама в ухо новорожденного. И как нам стало ясно, нет ничего достоверного в Шариате относительно этого поступка, и по этой причине Ашхаб передавал, что имам Малик порицал чтение азана в ухо новорожденного. См. “ан-Науадир уа-ззиядат” 4/337.Однако следует отметить, что самый первый хадис в этой главе от Абу Рафи’а, о произнесении азана в ухо новорожденного, является менее слабым из всех хадисов на эту тему. По этой причине многие имамы, которые высказывались относительно слабости данного хадиса, говорили о желательности этого поступка, усиливая его упомянутыми ранее хадисами данной главы.Хафиз Ибн аль-Муляккъин сказал: “Вероятно, этот хадис усиливается для них (ат-Тирмизи и аль-Хакима) другим путем и становится достоверным”. См. “аль-Бадр аль-мунир” 9/348.Шейх аль-Мубаракфури сказал: “Слова ат-Тирмизи: «На этот хадис опирались», т.е. на хадис от Абу Рафи’а относительно произнесения слов азана в ухо младенца сразу после его рождения. Если ты скажешь: «Как на этот хадис можно опираться, если он слабый? Ведь в иснаде хадиса ‘Асым ибн ‘Абдуллах, как тебе известно». Я скажу: «Да, он слабый передатчик, однако хадис усиливается тем хадисом, который передаётся от аль-Хасана ибн ‘Али, да будет доволен им Аллах, который приводят Абу Я’ля и Ибн ас-Сунни»”. См. “Тухфатуль-ахуази” 5/109.Имам аль-Байхакъи сказал: “Каждый мусульманин, у которого родился ребенок, независимо от того, мальчик это или девочка, должен воздать хвалу Аллаху и возблагодарить Его за то, что Он вывел из его хребта потомство, которое будет обращаться за него с мольбой, причисляться к нему, поклоняться Аллаху и увеличивать число жителей земли, покорных Аллаху. Затем ему следует воплотить касательно своего новорожденного два хадиса. Первый – произнесение азана в его ухо после рождения, произнося азан в правое ухо, а икъама в левое. Второй – сделать ему тахник при помощи финика или при его отсутствии чем-либо сладким”. См. “Шу’аб аль-иман” 11/104.Имам ан-Науауи говорил: “Сунной является произнесение слов азана в ухо ребенка при его рождении, независимо от того мальчик это или же девочка”. См. «аль-Маджму’» 8/442.Имам Ибн аль-Къайим писал: “Смысл произнесения слова азана в ухо ребенка состоит в том, чтобы первыми словами, которые услышит ребенок, были слова, возвеличивающие Аллаха и свидетельствующие о Его единовластном господстве. Также известно, что слова азана прогоняют шайтана. Также в этом поступке есть и другой смысл, а это призыв ребенка с рождения к Аллаху, Его религии Ислам и поклонении Ему одному”. См. “Тухфатуль-маудуд” 37.Однако другие ученые считали, что на данную тему нет ничего достоверного ни от Посланника Аллаха (мир ему и благословение Аллаха), ни от кого-либо из числа сподвижников и саляфов. И говорили, что хадис Абу Рафи’а не может усиливаться упомянутыми хадисами на эту тему, поскольку эти хадисы не просто слабы, ибо в них есть лживые и выдумывавшие хадисы передатчики, как нам стало известно. А для того, чтобы слабые хадисы усиливали друг друга необходимо, чтобы слабость хадисов заключалась в плохой памяти или ошибках передатчиков, но, ни в коем случае не в лживости, нечестии или выдумывании хадисов. См. “Къауа’ид ат-тахдис” 90, “Шарх ан-нухба” 25.Но если кто-то всё же будет опираться на хадис Абу Рафи’а и слова упомянутых имамов, говоривших о желательности произнесения азана в ухо новорожденного, то нет в этом ничего порицаемого. И не следует за это порицать и обвинять мусульман в нововведении, поскольку у этого поступка есть основа, хоть и слабая, но все же есть. А шейх Ибн Баз касательно произнесения слов азана в ухо новорожденного говорил: “Вопрос этот широкий, и если кто-то будет это делать, опираясь на данные хадисы, то нет в этом проблем, а если кто-то не будет этого делать, то и в этом нет проблем”. Сл. “Фатауа нурун ‘аля ад-дарб”.Следует мудро и мягко объяснять, что все хадисы в этой теме недостоверные, и что совершение этого не является установленной Посланником (мир ему и благословение Аллаха) Сунной.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Что такое ‘акыка?",
            "text": "Сказал аль-Джаухари о языковом значении слова «‘акыка»: “Волосы каждого новорожденного из людей или животных, которые были на их теле в момент появления на свет, называются «‘акыка». И отсюда взято название овцы, которую приносят в жертву за новорожденного на седьмой день”. См. “ас-Сыхах” 4/1527.Хафиз Ибн ‘Абдуль-Барр сказал: “Так называется жертвенное животное по той причине, что ребенку сбривают волосы во время закалывания животного”. См. “ат-Тамхид” 4/308.И это же мнение они передали от имама Абу ‘Убайда.Однако имам Ахмад не был согласен с таким определением этого слова и говорил: “Поистине, слово ‘акыка – это само жертвоприношение. И нет довода на то, о чем сказал Абу ‘Убайд”. См. “Масаиль аль-имам Ахмад” 267-268.Хафиз Ибн ‘Абдуль-Барр сказал: “То, что сказал Ахмад известно в языковом значении. Ведь говорится «‘аккъа» – это когда что-то режут, и отсюда взято выражение «‘аккъа уалидейх» (ослушался родителей), когда порываешь с ними”. См. “ат-Тамхид” 4/310.Затем Ибн ‘Абдуль-Барр сказал, что мнение Ахмада в языковом значении данного слова правильнее, чем мнение Абу ‘Убайда. См. “ат-Тамхид” 4/311.Но некоторые языковеды говорили, что оба эти значения правильны.Что же касается шариатского определения слова «‘акыка», то это жертвоприношение, совершаемое на седьмой день после рождения ребенка, в знак благодарности Всевышнему Аллаху за оказанную милость.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(См. “аль-Мугъни” 9/458, «аль-Маджму’» 8/426, “Нейлюль-аутар” 5/149.)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "О важности ‘акыки в Исламе",
            "text": "Сальман ибн ‘Амир ад-Дабби (да будет доволен им Аллах) рассказывал: “Я слышал, как Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«За новорожденного мальчика следует приносить жертву (‘акыка). Выпускайте из животного кровь и устраняйте то, что доставляет страдания (младенцу)»**”. аль-Бухари 5472. Мухаммад ибн Сирин говорил: “Если «страдание» в этом хадисе – это не бритье головы, тогда я не знаю, что это”. Также ат-Тахауи передал от Ибн Сирина, что он сказал: “Я не нашел того, кто указал бы мне на толкование слова «страдание»”. Однако аль-Асма’и однозначно утверждал, что речь идет о бритье головы. Также и Абу Дауд передает такое же мнение с достоверным иснадом от Хасана аль-Басри. См. “Фатхуль-Бари” 11/12, “Тухфатуль-ахуази” 5/196. Умм Курз аль-Ка’бия (да будет доволен ею Аллах) рассказывала: “Я слышала, как Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«За мальчика следует принести в жертву два одинаковых барана, а за девочку одного»**. Ахмад 6/422, Абу Дауд 2834, Ибн Маджах 3162. Достоверность подтвердили имам Ибн Хиббан, хафиз аз-Захаби, имам ан-Науауи и шейх аль-Альбани. Посланник Аллаха (мир ему и благословение Аллаха) также говорил: **«За ребёнка следует совершить ‘акыку, но не смазывать его голову кровью (жертвенного барана)»**. Ибн Маджах 3166, ад-Дайлями 2/335. Хафиз аль-Бусайри и шейх аль-Альбани подтвердили достоверность хадиса. Сказал аль-Джаухари о языковом значении слова «‘акыка»: “Волосы каждого новорожденного из людей или животных, которые были на их теле в момент появления на свет, называются «‘акыка». И отсюда взято название овцы, которую приносят в жертву за новорожденного на седьмой день”. См. “ас-Сыхах” 4/1527.Хафиз Ибн ‘Абдуль-Барр сказал: “Так называется жертвенное животное по той причине, что ребенку сбривают волосы во время закалывания животного”. См. “ат-Тамхид” 4/308.И это же мнение они передали от имама Абу ‘Убайда.Однако имам Ахмад не был согласен с таким определением этого слова и говорил: “Поистине, слово ‘акыка – это само жертвоприношение. И нет довода на то, о чем сказал Абу ‘Убайд”. См. “Масаиль аль-имам Ахмад” 267-268.Хафиз Ибн ‘Абдуль-Барр сказал: “То, что сказал Ахмад известно в языковом значении. Ведь говорится «‘аккъа» – это когда что-то режут, и отсюда взято выражение «‘аккъа уалидейх» (ослушался родителей), когда порываешь с ними”. См. “ат-Тамхид” 4/310.Затем Ибн ‘Абдуль-Барр сказал, что мнение Ахмада в языковом значении данного слова правильнее, чем мнение Абу ‘Убайда. См. “ат-Тамхид” 4/311.Но некоторые языковеды говорили, что оба эти значения правильны.Что же касается шариатского определения слова «‘акыка», то это жертвоприношение, совершаемое на седьмой день после рождения ребенка, в знак благодарности Всевышнему Аллаху за оказанную милость.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(См. “аль-Мугъни” 9/458, «аль-Маджму’» 8/426, “Нейлюль-аутар” 5/149.)"
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "Является ли совершение ‘акыки обязательным?",
            "text": "Относительно обязательности совершения ‘акыки за ребёнка, существует разногласие среди ученых. Большинство ученых считает, что ‘акыка является твёрдной Сунной (аль-муаккада). См. “Мугъни аль-мухтадж” 4/293, «аль-Маджму’» 8/429, “Бидаятуль-муджтахид” 1/275, “Нейлюль-аутар” 5/150.Необходимо отметить, что некоторые имамы приводили даже единогласное мнение (иджма’) о том, что ‘акыка является твёрдой Сунной, но не обязанностью. См. “аль-Мугъни” 9/459.Второе мнение состоит в том, что совершение ‘акыки является обязательным. Это было мнением захиритов – Дауда и Ибн Хазма. Также это мнение передается из числа сподвижников от Бурайды, а также от аль-Хасана аль-Басри, аль-Лейса ибн Са’да, и это одно из двух мнений имама Ахмада, которому следовали некоторые ханбалиты. И этому мнению отдал предпочтение шейх аль-Альбани. См. “аль-Мухалля” 6/234, “ат-Тамхид” 4/311, “аль-Инсаф” 4/110.Также есть и третье мнение, в частности среди ханафитов, что совершение ‘акыки не является ни Сунной, ни чем-либо желательным. Абу аз-Зинад относительно сторонников этого мнения говорил: “Они так посчитали по причине малого знания и слабой осведомленности о хадисах”. См. “аль-Мугъни” 11/120.\nЧто же касается тех, кто посчитал ‘акыку нежелательной, то они опирались на следующий хадис: “Когда Пророка (мир ему и благословение Аллаха) спросили про ‘акыку, он ответил: «Поистине, Аллах не любит ‘укукъ».Однако этот хадис никак не указывает на нежелательность ‘акыки, поскольку полный хадис прекрасно поясняет его смысл. Со слов ‘Абдуллаха ибн ‘Амра (да будет доволен им Аллах) сообщается: “Когда Пророка (мир ему и благословение Аллаха) спросили про ‘акыку, он ответил: **«Поистине, Аллах не любит ‘укукъ»** Как будто ему не понравилось это название. Затем он сказал: **«У кого родился ребенок и кто пожелает совершить за него жертвоприношение (нусук), то пусть приносит в жертву за мальчика двух одинаковых барашек, а за девочку одного»**\nАхмад 2/194, Абу Дауд 2842, ан-Насаи 3/884. Достоверность хадиса подтвердили аль-Хаким, аз-Захаби, Ахмад Шакир, аль-Альбани, Ибн Баз и Шу’айб аль-Арнаут.\nИтак, мы видим, что Пророку (мир ему и благословение Аллаха) не понравилось именно название «‘акыка», а не сам обряд, поскольку такое название данный обряд имел ещё во времена невежества (джахилийя), поэтому он сказал, что Аллах не любит ‘укукъ (ослушания). Максимум, на что указывает данный хадис, так это нежелательность использовать данное название «‘акыка», но никак не само жертвоприношение. Однако ученые считали, что нет никаких проблем использовать и слово «‘акыка», поскольку впоследствии сам Пророк (мир ему и благословение Аллаха) упоминал это слово много раз, побуждая свою общину совершать ‘акыка. Также некоторые имамы, опираясь на хадис: «Удхия отменила любое жертвоприношение», считали, что ‘акыка была отменена Исламом и заменена праздничным жертвоприношением (удхия). Однако, это мнение весьма слабое. Во-первых, хадис: «Удхия отменила любое жертвоприношение» недостоверный, относительно которого имам ан-Науауи сказал: “Все знатоки хадисов единогласны в том, что этот хадис слабый”. См. «аль-Маджму’» 8/386. А во-вторых, от десятков сподвижников достоверно передается, что они совершали ‘акыку за своих детей и внуков и после смерти Посланника Аллаха (мир ему и благословение Аллаха). Множество сообщений о том, как сподвижники и их последователи совершали ‘акыку за своих детей, например, приводит имам Ибн Аби ад-Дунья в своей книге «аль-‘Ияль» (1/188-243). Имам Ахмад сказал: “Передают от некоторых, кто порицал ‘акыку, что она из числа дел времен джахилии. Однако, это заявление является следствием их малой осведомленности о хадисах. Ведь Пророк (мир ему и благословение Аллаха) совершал ‘акыку за аль-Хасана и аль-Хусайна, и его сподвижники делали ее”. См. “Тухфатуль-маудуд” 60. Тут следует отметить, что некоторые ученые приписывали имаму Абу Ханифе слова, что он называл совершение ‘акыки нововведением. На самом деле это не так. Ханафитский имам Бадруддин аль-‘Айни относительно этого сказал: “Это является ложью, и нельзя приписывать такое Абу Ханифе, да убережет Аллах говорить подобное! Он говорил, что это не Сунна, имея в виду не твердая Сунна”. См. “Умдатуль-Къари” 14/463.\nИмам аш-Шаукани прекрасно объяснил такое мнение Абу Ханифы, найдя ему достойное оправдание, как это и подобает поступать ученым в отношении друг друга. Он говорил: “Автор книги «аль-Бахр» передал, что Абу Ханифа сказал в отношении ‘акыки, что это из деяний времен язычества (джахилийя), которое отменил Ислам. Если это действительно сказал Абу Ханифа, то вероятно до него не дошли достоверные хадисы относительно этой темы”. См. “Нейлюль-аутар” 5/150. Что же касается мнения тех имамов, которые говорили об обязательности ‘акыки, то их доводом являются следующие хадисы: Со слов Хасана ибн Самуры (да будет доволен им Аллах) сообщается, что Посланник Аллаха (мир ему и благословение Аллаха) говорил: **«Каждый новорожденный является заложником своей ‘акыки, которую следует совершить на седьмой день после рождения, дать ему в этот день имя и побрить его голову»**\nАбу Дауд 2838, ат-Тирмизи 1522, Ибн Маджах 3165. Достоверность хадиса подтвердили имамы Ахмад, ат-Тирмизи, Ибн Къудама, Ибн ‘Абдуль-Барр ‘Абдуль-Хаккъ аль-Ишбили, Ибн аль-Муляккъин, аз-Захаби и аль-Альбани. ‘Аиша (да будет доволен ею Аллах) говорила: “Посланник Аллаха (мир ему и благословение Аллаха) повелевал нам приносить в жертву двух баранов за мальчика и одного за девочку”. Ибн Маджах 3163, ат-Тирмизи 1513. Хадис достоверный. См. “Ируауль-гъалиль” 1166. Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«За мальчика следует принести в жертву два одинаковых барана, а за девочку одного»**\nАхмад 6/422, Абу Дауд 2834, Ибн Маджах 3162. Достоверность подтвердили имам Ибн Хиббан, хафиз аз-Захаби, имам ан-Науауи и шейх аль-Альбани.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "Является ли совершение ‘акыки обязательным? - 2",
            "text": "Веления в этих и подобных хадисах сторонники этого мнения отнесли к обязательному. Имам Ибн аль-Мунзир сказал: “Было разногласие относительно обязательности ‘акыки, и сказала группа: «‘Акыка является обязательной, поскольку Пророк (мир ему и благословение Аллаха) повелевал ее совершать, а веления его указывают на обязательность (фард)»”. См. “аль-Ишраф” 3/416. Также они опирались и на слова Бурайды, который говорил: **В Судный день люди предстанут со своей ‘акыкой также, как предстанут со своими пятикратными молитвами**\nСм. “аль-Мухалля” 6/637, “аль-Мугъни” 13/393. Однако относительно достоверности этого сообщения от Бурайды есть сомнения, поэтому хафиз Ибн Хаджар сказал, упомянув его: “Если бы это было достоверным, то стало бы еще одним доводом для тех, кто сказал про обязательность ‘акыки”. См. “Фатхуль-Бари” 9/742. Также следует отметить, что Къатада и аль-Хасан аль-Басри считали, что ‘акыка обязательна именно за мальчиков, и необязательна и даже неправомочна в отношении девочек. См. “Фатх аль-Малик” 7/107. При этом они опирались на хадисы, в которых сказано: **«За новорожденного мальчика следует приносить жертву (‘акыка)»** аль-Бухари 5472. Это мнение опровергается другими ясными и достоверными хадисами, в которых упоминаются как мальчик, так и девочка, часть которых уже приводилась. Поэтому имам Ибн аль-Мунзир говорил: “Это мнение очень слабое и нельзя на него опираться по причине того, что оно противоречит достоверной Сунне!” См. “Файдуль-Къадир” 5624. Что же касается большинства ученых, то они отнесли веления, упомянутые в хадисах, к желательным. Нет сомнения, что если есть повелевающие тексты Корана и Сунны, и нет ничего исключающего, то это веление несет в себе обязательный характер. Однако, если есть другие тексты Корана и Сунны, которые сводят эти веления с основы, тогда веление уже носит желательный характер, но не обязательный. И в данном случае есть тексты, которые сводят данные веления к желательности, как например, слова Пророка (мир ему и благословение Аллаха), который, когда был спрошен про ‘акыку, сказал: **«У кого родился ребенок и кто пожелает совершить за него жертвоприношение, то пусть приносит в жертву за мальчика двух одинаковых барашек, а за девочку одного»**\nАхмад 2/194, Абу Дауд 2842, ан-Насаи 3/884. Достоверность хадиса подтвердили имам аль-Хаким, хафиз аз-Захаби, шейх Ахмад Шакир, шейх аль-Альбани, шейх Ибн Баз и Шу’айб аль-Арнаут.\nТаким образом, Пророк (мир ему и благословение Аллаха) связал совершение ‘акыки с желанием людей, не обязав их этим. Хафиз Ибн ‘Абдуль-Барр сказал: “В этом хадисе доказательство на то, что ‘акыка не является обязательной, поскольку в отношении обязательных вещей не говорится: «Кто желает пусть совершает»!”См. “ат-Тамхид” 9/295. Шейх Сыддыкъ Хасан Хан говорил: “В этом хадисе доказательство на то, что все хадисы, побуждающие совершать ‘акыку, носят необязательный, а только желательный характер. И если бы это было обязательно, то не было бы совершение этого деяния связано с желанием людей!”См. “ар-Раудату-ннадийя” 3/144. А имам аш-Шафи’и говорил: “Впали в крайность в отношении ‘акыки два вида людей. Одни из них говорят: «Это нововведение!», а другие: «Это обязательно!»” См. “Фатхуль-Бари” 4/12. На основании всего сказанного следует, что правильным мнением является то мнение, что ‘акыка является твёрдо–установленной Сунной и весьма желательным деянием, в котором множество пользы. И оно узаконено как в отношении мальчика, так и девочки. Что же касается хадиса: **«Каждый новорожденный является заложником своей ‘акыки»**, то ученые разошлись в толковании этого хадиса на множество мнений, что ослабляет силу аргументации им. Тем более такое толкование, что ребенок, за которого не сделали ‘акыку, не будет заступаться за своих родителей, не передается ни от Пророка (мир ему и благословение Аллаха), ни от кого-либо из его сподвижников. Но даже если бы и передавалось такое толкование от них, то это не указывает на совершение греха при оставлении ‘акыки или отчёт за это в Судный день, однако указывает на его важность и достоинство. См. “Задуль-ма’ад” 2/326, “Фатхуль-Бари” 9/488. И даже от имама Ахмада, придерживавшегося этого мнения, передает Ахмад ибн аль-Къасим, что когда его спросили: «О Абу ‘Абдуллах, является ли обязательной ‘акыка?», - он ответил: “Что касается ее обязательности, то я не знаю. Я не говорю, что она обязательна. Но самое строгое, что было на счет нее – это то, что человек является ее заложником”. См. “Тухфатуль-маудуд” 54. Нет сомнения в том, что если есть возможность, лучше совершить ‘акыку за детей, не оставляя эту важную Сунну и не делая ребенка ее заложником. Имам Малик говорил: “Совершение ‘акыки не является обязательным, однако это желательно, ибо это деяние, которое не переставали совершать люди”. См. “аль-Мууатта” 2/400.\nАбу аз-Зинад говорил: «‘Акыка – это деяние мусульман, оставление которого они порицали». См. “Тарх ат-тасриб” 5/206.Салих, сын имама Ахмада рассказывал, что он спросил своего отца: “Если у человека родился ребенок, однако у него нет возможности совершить ‘акыку, то, что для тебя предпочтительнее, чтобы он взял в долг и совершил ‘акыку или же чтобы он отложил это до тех пор, пока у него не появится возможность?” Ахмад сказал: “Самое строгое, что мы слышали в отношении ‘акыки, это хадис от Хасана ибн Самуры, что Пророк (мир ему и благословение Аллаха) сказал: «Каждый новорожденный является заложником своей ‘акыки». Поистине, я надеюсь, что если он возьмет в долг, то Аллах даст облегчение такому человеку, ибо он оживил сунну из числа Сунны Посланника Аллаха (мир ему и благословение Аллаха), последовав за тем, что пришло от него”. См. “Масаиль аль-имам Ахмад” 2/208.На основании изложенного следует, что совершение ‘акыки не является обязательным, оставление чего влечет грех, однако не следует оставлять этот обряд при наличии возможности. Ведь в этом обряде множество польз, из числа которых: оживление Сунны Пророка (мир ему и благословение Аллаха); благодарность Всевышнему; и польза для ребёнка, о которой в полной мере ведомо только Одному Аллаху.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "О том, что совершение ‘акыки лучше, чем раздача милостыни на эту сумму",
            "text": "Спросили имама Ахмада: «Что для тебя предпочтительнее: совершение ‘акыки, или же выплата этой суммы нуждающимся?» Он ответил: “Акыка!” ¹ Также это мнение передал Ибн аль-Мунзир от Ахмада и Исхакъа ибн Рахауайха и сказал: “Истину сказал Ахмад, ибо следование Сунне лучше!”² Имам Ибн аль-Къайим сказал: “Не оспаривается то, что ‘акыка может служить защитой для новорожденного от вреда шайтана после его рождения, как и поминание Аллаха перед половым актом и зачатием этого ребенка служит защитой для него от вреда шайтана. По этой причине было мало случаев, когда родитель оставлял совершение ‘акыки, чтобы тем самым ребёнок не попал под поражение шайтана”.³",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Масаиль Аби Дауд” 256."
                },
                {
                    "source": "²См. “аль-Ишраф” 3/421."
                },
               
                {
                    "source": "³См. “Тухфатуль-маудуд” 91"
                }
            ]
        },
        {
            "id": 10,
            "subtitle": "Требования к животному, предназначенному для ‘акыки",
            "text": "Имам Малик говорил: “Поистине, ‘акыка по положению подобна праздничному жертвоприношению (удхия), и не дозволено для этого использовать слепое, хромое, с поломанными рогами и больное животное!”¹ Со слов аль-Бары ибн ‘Азиба (да будет доволен им Аллах) сообщается, что Пророк Аллаха (мир ему и благословение Аллаха) сказал: **«Не дозволено приносить в качестве жертвоприношения четыре типа животных: одноглазое, изъян которого очевиден; больное, болезнь которого очевидна; хромое, хромота которого очевидна; и истощенное, слабость которого очевидна»**²\nИбн ‘Абдуль-Барр сказал: “Относительно этих четырех дефектов все ученые единогласны, я не знаю никаких разногласий относительно этого. Также известно, что все, входящее в подобный смысл, тоже имеет к этому отношение. Если не дозволено одноглазое животное, то слепое не дозволено тем более. Или если не дозволено хромое, то безногое – тем более. Все это – ясно и известно, и нет относительно этого разногласий”. См. “Фатх аль-Малик” 7/16. Ибн Къудама сказал: “Положение ‘акыки в отношении возраста жертвенного животного подобно положению удхия”.³\nИбн аль-Хадж аль-Малики сказал: “Положение ‘акыки в отношении возраста животного и отсутствии недостатков подобно положению удхия”. См. “аль-Мадхаль” 3/277. Что же касается возраста жертвенных животных, то известно, что минимальный возраст для верблюда – от пяти лет, для быка и коровы – от двух лет, а для козла и овцы – от одного года. См. “аль-Мудаууана” 2/12, “аль-Мабсут” 9/12, “аль-Мугъни” 9/348, “аль-Хауи” 19/29. Ибн ‘Абдуль-Барр сказал: “Ученые единогласны, кроме тех, кто от них отклонился, и чье разногласие не берется в счет, что в ‘акыке не дозволено приносить в жертву кроме восьми парных животных”. См. “аль-Истизкар” 15/383. Восемь парных животных, это: верблюд-верблюдица, бык-корова, баран-овца, козел-коза. Таким образом, условия для ‘акыки полностью подобны условиям для удхия, кроме того, что в удхия могут принимать участие в закалывании крупнорогатого скота семь человек. Имам аль-Мардауи упомянув о том, что ‘акыка по положению подобна удхия, сказал: “Однако исключением является то, что в ‘акыке нельзя принимать совместное участие в закалывании верблюда или коровы”. См. “аль-Инсаф” 4/113. То же самое говорил и Ибн аль-Къайим, что одно животное должно приносится в жертву за одного ребенка. См. “Тухфатуль-маудуд” 64. Что же касается сообщения от Ибрахима ат-Тайми, сказавшего: “Желательно совершать ‘акыка даже птицей” (Малик 1176), то ученые сказали, что смысл этого в желательности, а не в том, что даже птицей дозволено совершать жертвоприношение. Это подобно хадису, побуждающему строить мечеть, в котором сказано: **«Кто построит мечеть ради Аллаха, даже с размером гнезда куропатки или меньше нее, тому Аллах возведет дом в Раю»** Ибн Маджах 738. Хадис достоверный. См. «Сахих аль-джами’» 6128. Поэтому Ибн Хабиб сказал о словах Ибрахима: “Он не имел в виду, что птицы будет достаточно”. Поэтому аз-Зуркъани в «Шарх аль-Мууатта» после этих слов Ибрахима ат-Тайми привел слова Ибн ‘Абдуль-Барра о единогласном мнении, что совершая ‘акыку не дозволено приносить в жертву что-либо, кроме упомянутых восьми парных животных. ",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “аль-Мууатта” 2/400."
                },
                {
                    "source": "²Ахмад 4/284, Абу Дауд 2802, ат-Тирмизи 1497, ан-Насаи 4/215, Ибн Маджах 3144.. Имамы Абу ‘Иса ат-Тирмизи, Ибн Хиббан, аль-Хаким и аль-Альбани подтвердили достоверность хадиса."
                },
                {
                    "source": "³См. “аль-Мугъни” 9/369."
                }
            ]
        },
        {
            "id": 11,
            "subtitle": "Какое именно животное следует приносить в жертву за новорожденного?",
            "text": "Некоторые ученые считали, что нельзя закалывать что-либо помимо барана или овцы. Также к ним относится козёл и коза, поскольку в хадисе упоминается слово “аш-шаh”. Имам Ибн Хазм сказал: “Слово “аш-шаh” включает в себя как барана, так и козла, без разногласий”. См. “аль-Мухалля” 6/236. Большинство же ученых считали, что ‘акыка по положению своему подобна праздничному жертвоприношению (удхия), и по этой причине на нее распространяются те же условия, что и для удхия, т.е. жертвенные животные не должны быть из птиц, а в них входят баран, козел, крупнорогатый скот и верблюд. То же самое сказали имам Ибн Къудама из ханбалитов и имам ан-Науауи из шафиитов. Имам аш-Шаукани сказал: “Упоминание в хадисах слова «баран» не указывает на недозволенность другого животного”. См. “Нейлюль-аутар” 5/156. Тем более от некоторых сподвижников передается, что они резали за своих детей в качестве ‘акыки и верблюдов. Хасан аль-Басри говорил: “Анас ибн Малик зарезал за своего сына верблюда”. Ибн Аби Шейба 8/57. Более того, слово «аш-шаh» включает в себя и крупных животных. Известный имам в арабском языке Ибн Манзур говорил: “Аш-Шаh – животное, которое может быть как мужского, так и женского пола. Также сказано, что шаh – это и баран, и козел, и корова, и бык, и мул, и осёл”. См. “Лисануль-‘араб” 7/244. Теперь, что касается хадиса: **«У кого родился ребенок, пусть совершает ‘акыку за него верблюдом, коровой или бараном»** (ат-Табарани в “ас-Сагъир” 45), то этот хадис является выдуманным. См. “Ируа аль-гъалиль” 1168. Лучше всего делать ‘акыку именно барашком, ведь именно это животное принес в жертву за своих внуков Пророк (мир ему и благословение Аллаха), и именно его он велел приносить в жертву своим сподвижникам. Ибн Аби Муляйка рассказывал, что когда ‘Аиша (да будет доволен ею Аллах) услышала, что люди говорят, чтобы за сына ее сестры принесли в жертву верблюда, она сказала: “Да упасет Аллах! Однако Посланник Аллаха (мир ему и благословение Аллаха) говорил: **«Два одинаковых барана»”**. ат-Тахауи 1/457, Ибн Абу ад-Дунья в “аль-‘Ияль” 1/201. Иснад хороший. См. “Ируауль-гъалиль” 4/394. И имам Малик считал, что наилучшим животным для ‘акыки является именно баран. Он говорил: “Овца предпочтительней для меня в ‘акыке, нежели корова, а баран предпочтительней, нежели верблюд. Но корова и верблюд предпочтительнее для меня во время жертвоприношения хаджа, нежели баран и овца”. См. “аль-Ишраф” 3/416, “ат-Тамхид” 4/315. Упомянув эти слова Малика, имам Ибн аль-Мунзир сказал: “Как прекрасно то, что сказал Малик”.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “аль-Ишраф” 3/416."
                }
               
            ]
        },
        {
            "id": 12,
            "subtitle": "Можно ли принести в жертву за мальчика одного барана?",
            "text": "За мальчика следует принести в жертву двух барашек, на что указывают множество хадисов. Умм Курз аль-Ка’бия (да будет доволен ею Аллах) рассказывала: “Я слышала, как Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«За мальчика следует принести в жертву два одинаковых барана, а за девочку одного»**. Ахмад 6/422, Абу Дауд 2834, Ибн Маджах 3162. Достоверность подтвердили имам Ибн Хиббан, имам ан-Науауи, хафиз аз-Захаби и шейх аль-Альбани. Однако в качестве исключения можно принести в жертву и одного барана, если у человека, скажем, есть возможности принести за мальчика в жертву одно животное и нет возможности на двух. Довод этому – одна из версий хадиса, в которой сообщается, что Ибн ‘Аббас сказал: “Посланник Аллаха (мир ему и благословение Аллаха) зарезал за аль-Хасана и аль-Хусайна по одному барану”. Абу Дауд 2841, ат-Табарани 11/316. Ученые разошлись относительно достоверности данной версии хадиса, поскольку в других версиях говорится о двух баранах. Однако достоверность упомянутой версии подтвердили имамы Ибн Хузайма, Ибн аль-Джаруд, ‘Абдуль-Хаккъ аль-Ишбили, Ибн Дакыкъ аль-‘Ид, Ибн ‘Абдуль-Хади, аль-Альбани и др. Также передается, что Ибн ‘Умар приносил в жертву за своих детей, как мальчиков, так и девочек по одному барану. Также подобным образом поступал и ‘Уруа ибн аз-Зубайр, который приносил за своих детей обоих полов по одному барану. См. “аль-Мууатта” 2/401, имама Малика и “ас-Сунан аль-кубра” 9/302, имама аль-Байхакъи. Шу’айб аль-Арнаут подтвердил достоверность иснадов обоих сообщений. Имам ан-Науауи сказал: “Сунной является принести в жертву за мальчика двух баранов, а за девочку одного. Однако если за мальчика зарезали одно животное, то и это соответствует Сунне”. См. «аль-Маджму’» 8/429. Имам ас-Сан’ани говорил: “Дозволено принести в жертву одного барана за мальчика, и этого достаточно, однако желательно принести в жертву именно двух баранов”¹ Поэтому, если есть возможность, то лучше, конечно же, принести в жертву двух баранов, тогда как один баран будет в виде исключения.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Субулю-с-Салям” 4/182."
                }
               
            ]
        },
        {
            "id": 13,
            "subtitle": "Можно ли принести в жертву одно животное за двух близнецов?",
            "text": "Хафиз Ибн Хаджар сказал: “Если женщина родит двойню, то желательно совершить за каждого ‘акыку”.¹ А хафиз Ибн ‘Абдуль-Барр приведя слова аль-Лейса ибн Са’да: «Если женщина родила двоих, то следует совершить ‘акыку за обоих», сказал: “Я не знаю кого-либо из учёных, кто противоречил бы этому”.²",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Фатхуль-Бари” 9/12."
                },
                {
                    "source": "²См. “ат-Тамхид” 9/297."
                }
               
            ]
        },
        {
            "id": 14,
            "subtitle": "Можно ли объединить удхия и ‘акыку?",
            "text": "Среди ученых есть два мнения по этому поводу. Мнение многих ханафитов, а также это одно из мнений ханбалитов, состоит в том, что это дозволено. Одни считали, что суть обоих жертвоприношений – это пролитие крови жертвенного животного для приближения к Аллаху. И из числа саляфов этого мнения также придерживались Къатада, Мухаммад ибн Сирин и аль-Хасан аль-Басри, сказавший: “Если удхия будет совершена от имени ребенка, то это заменит собой и ‘акыку”. Ибн Абу Шейба 5/534. Иснад достоверный. Это же мнение выбрал и шейх Мухаммад ибн Ибрахим Али Шейх. См. “Фатауа Ибн Ибрахим” 6/159. Однако некоторые сторонники этого мнения ставили различные условия, как, например, совпадение времени. Сказал аль-Бухути: “Если совпали время ‘акыки и удхии, как это, скажем, седьмой день или какой-то из дней, в которые совершаются жертвоприношения, то если совершать жертвоприношение с намерением на ‘акыку, то этого будет достаточно и для удхия. А если заколоть животное с намерением для удхия от имени ребёнка, то достаточно и для ‘акыки. Это как если бы совпал день ‘Ида и пятницы, и человек искупался для одной из причин”. См. “Шарх Мунтаха аль-ирадат” 1/617. Что же касается других ученых, среди которых маликиты и шафииты, а также это второе мнение ханбалитов, то они считали, что это не дозволено, поскольку речь идет о двух жертвоприношениях по двум совершенно разным причинам. Ведь, несмотря на схожесть ситуации, ученые не дозволяли приносить в жертву одного барана, скажем, за двух близнецов, а что говорить о совершенно разных причинах жертвоприношения?¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Тухфатуль-маудуд” 68, “Тухфатуль-минхадж” 9/371."
                }
               
            ]
        },
        {
            "id": 15,
            "subtitle": "Можно ли человеку совершить ‘акыка за себя, если родители не совершили за него ‘акыку при его рождении?",
            "text": "Что же касается совершеннолетнего человека: следует ли ему совершить ‘акыку за себя или нет, если он знает, что за него ее не делали, то в этом вопросе есть два мнения. Одни ученые считали это неприемлемым. Другие же считали это дозволенным, и среди тех, кто об этом говорил, был имам аш-Шафи’и, и это также одно из мнений Ахмада, и этому мнению отдали предпочтение имам аш-Шаукани и шейх аль-Альбани. Те ученые, которые считали это приемлемым, опирались на хадис от Анаса, который сказал: “Посланник Аллаха (мир ему и благословение Аллаха) совершил за себя ‘акыку после того, когда Аллах его послал с пророчеством”. ‘Абду-р-Раззакъ 4/329, аль-Баззар 1237 и др. Но ученые сильно разногласили в достоверности этого хадиса, и большинство имамов считали этот хадис слабым. Однако у этого хадиса есть и другие версии, усиливающие его. Хафиз аль-‘Иракъи говорил: “У этого хадиса есть другие пути, в которых нет серьезных проблем”. См. “Тарх ат-тасриб” 5/210. Хафиз аль-Хайсами называл передатчиков версии этого хадиса, что приводит ат-Табарани, надежными. См. “Маджма’у-ззауаид” 4/59. Также этот хадис усилил хафиз ‘Абдуль-Хаккъ аль-Ишбили в “аль-Ахкам”. И шейх аль-Альбани, разъяснив подробно все плюсы и минусы этого хадиса, назвал его достоверным. См. “ас-Сильсиля ас-сахиха” 2726. Этот хадис также усиливается и мнением некоторых саляфов. Так, например, Мухаммад ибн Сирин говорил: “Если бы я узнал, что за меня не совершили ‘акыку, то я совершил бы ее за себя”. Ибн Аби Шейба 8/235. Иснад достоверный. Также говорили аль-Хасан аль-Басри и ‘Ата.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “аль-Мухалля” 8/322, “аль-Мугъни” 13/396."
                }
               
            ]
        },
        {
            "id": 16,
            "subtitle": "Когда следует совершать ‘акыку?",
            "text": "Что касается срока ‘акыки, то Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«Каждый новорожденный является заложником своей ‘акыки, которую следует совершить на седьмой день после рождения»** Абу Дауд 2838, ат-Тирмизи 1522, Ибн Маджах 3165. Достоверность хадиса подтвердили имамы Ахмад, ат-Тирмизи, Ибн Къудама, Ибн ‘Абдуль-Барр ‘Абдуль-Хаккъ аль-Ишбили, Ибн аль-Муляккъин, аз-Захаби и аль-Альбани. Это и есть самое лучшее время для Жертвоприношения. Однако, если человек не успел или не смог совершить ‘акыку на седьмой день, то он может сделать это на 14 или 21 первый день после рождения ребенка. От Бурайды (да будет доволен им Аллах) передается, что Пророк (мир ему и благословение Аллаха) сказал: ** «‘Акыка совершается на седьмой, на четырнадцатый или на двадцать первый день (после рождения ребёнка)»**. аль-Байхакъи 9/303. Шейх аль-Альбани подтвердил достоверность хадиса. См. «Сахих аль-джами’» 4132. Относительно достоверности этого хадиса были разногласия среди ученых. Но даже если этот хадис и слабый, нет проблем в соблюдении упомянутых в нём чисел, ибо на это опирались многие имамы. Салих – сын имама Ахмада, рассказывал: “Сказал мой отец относительно ‘акыки: «Следует принести в жертву животное на седьмой день, а если не получилось, то на четырнадцатый, а если нет, то на двадцать первый»”. См. “Масаиль аль-имам Ахмад” 2/210. Также аль-Маймуни рассказывал: “Я спросил у Абу ‘Абдуллаха (имама Ахмада): «Когда следует совершать ‘акыку?» Он ответил: «Что касается ‘Аиши, то она говорила: “На седьмой день, на четырнадцатый и на двадцать первый”. См. “Тухфатуль-маудуд” 86. ‘Ата говорил: “За мальчика следует принести в жертву два барана, а за девочку одного, что следует совершать на седьмой день, если есть на это возможность. Если же нет, то на четырнадцатый, а если нет, то на двадцать первый”. Ибн Аби ад-Дунья в “аль-‘Ияль” № 62. Исследователь этой книги назвал иснад достоверным. Имам Абу ‘Иса ат-Тирмизи сказал: “Ученые считали желательным совершение ‘акыки на седьмой день. Если же это не получилось сделать на седьмой день, то на четырнадцатый. Если же не получилось и на четырнадцатый, то на двадцать первый”. См. “Сунан ат-Тирмизи” 5/115. Но если человек не учёл эту конкретизацию, и сделал не на 14-ый или 21-ый, а скажем на 8-ой или 12-ый день, то нет в этом проблем. Хафиз Ибн ‘Абдуль-Барр сказал: “Если человек не смог совершить жертвоприношение на седьмой день, то нет ничего страшного в том, чтобы он совершил это после. И не является обязательным совершать ‘акыку именно по прошествии каждых семи дней”. См. “аль-Истизкар” 15/375.\nИбн аль-Къайим сказал: “Конкретизация седьмого дня указывает лишь на желательность этого. В ином случае, если он совершит Жертвоприношение на восьмой, или десятый или иной день – это будет засчитано”. См. “Тухфатуль-маудуд” 89.Однако все же лучше, если человек не сможет совершить ‘акыку седьмого числа, соблюдать указанные числа и совершить жертвоприношение на 14-ый или 21-ый день от рождения ребёнка.Маликиты говорили, что нельзя совершать жертвоприношение раньше, чем на седьмой день, и это говорил Ибн Хазм, а также ас-Сан’ани, поскольку это противоречит велению Пророка (мир ему и благословение Аллаха). См. “аль-Мухалля” 6/234, “Субулю-с-Салям” 1/181.И это мнение является правильным, поскольку Шариат установил время для этого деяния, а ничего исключающего на этот счет не передается. Следовательно, совершение ‘акыка до седьмого дня неправомочно. См. “аль-Мунтакъа” 4/201, “Субулю-с-Салям” 1/181.Что касается вопроса: «Какой именно день считать седьмым?», то среди ученых на этот счёт есть разногласие. Хафиз Ибн Хаджар сказал: “Слова в хадисе - «на седьмой день»; нужно ли считать их с момента рождения? Сказал Ибн ‘Абдуль-Барр: «Малик сказал, что первый из семи дней начинается после дня, когда родился ребенок, если только он не родился до восхода солнца». То же самое передал аль-Бууейты от аш-Шафи’и. Но ар-Рафи’и передал два мнения и отдал предпочтение тому, что первый день его рождения учитывается”. См. “Фатхуль-Бари” 9/489.Шейх Ибн ‘Усаймин говорил: “Сунной является совершать Жертвоприношение на седьмой день после рождения ребенка. Если, например, ребенок родился в субботу, то жертвоприношение совершается в пятницу, за день до дня, в который он родился. Таково правило. Если же он родился в четверг, то ‘акыка совершается в среду, и т.д.”.¹Также и комментатор сборника ат-Тирмизи – шейх аль-Мубаракфури отдал предпочтение тому, что первым днем считается день родов. Это же мнение поддержал и шейх ‘Абдуль-Мухсин аль-‘Аббад, комментируя сборник «Сунан Аби Дауд». Он сказал: “Если ребенок родился в пятницу, то пятница и есть первый день. Следовательно, седьмым днем будет четверг”.Таким образом, тому, кто желает совершать ‘акыку за ребенка на седьмой день, следует учитывать первый день, в который родился ребенок.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. «Шарх аль-мумти’» 7/538."
                }
               
            ]
        },
        {
            "id": 17,
            "subtitle": "Кто может принести в жертву животное за новорожденного?",
            "text": "Нет такого условия, чтобы именно отец или кто-то из родных должен совершать ‘акыку за новорожденного, ведь Посланник Аллаха (мир ему и благословение Аллаха) не конкретизировал это отцом или опекуном или кем-либо из родных, однако, сказал: **«За новорожденного мальчика следует приносить жертву (‘акыка)»** аль-Бухари 5472. Хафиз Ибн Хаджар упомянув данный хадис, сказал: “В нём не конкретизируется, кто именно должен совершить ‘акыку”. См. “Фатхуль-Бари” 12/13. Имам аш-Шаукани сказал: “В этом хадисе содержится доказательство на то, что дозволено совершать ‘акыку за ребёнка постороннему так же, как и дозволено это сделать кому-то из числа его родных”. См. “Нейлюль-аутар” 5/150. То же самое говорил и имам ас-Сан’ани.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Субулю-с-Салям” 4/183."
                }
               
            ]
        },
        {
            "id": 18,
            "subtitle": "Что следует произносить во время принесения жертвы?",
            "text": "Со слов ‘Аиши сообщается, что Посланник (мир ему и благословение Аллаха) принес жертву за аль-Хасана и аль-Хусайна, и сказал: **«Совершайте жертвоприношение от имени ребенка и говорите: “С именем Аллаха, Аллах велик. О Аллах, это для Тебя. Это ‘акыка такого-то”»**¹\n\n **(بسم الله، الله أكبر، اللهم لك وإليك هذه عقيقة فلان)** \n\n Къатада говорил: “Следует помянуть имя Аллаха при совершении ‘акыки так же, как во время праздничного жертвоприношения (удхия). Следует сказать: «О Аллах, это от Тебя и для Тебя, это ‘акыка такого-то. С именем Аллаха, Аллах велик», а затем принести в жертву животное”. См. “Фатхуль-Бари” 9/734. Имам аль-Халляль в главе «Что следует произносить во время ‘акыка» привел сообщение от Абу ат-Талиба, спросившего у имама Ахмада: «Что следует произносить тому, кто желает заколоть животное для ‘акыки?» Он ответил: “Следует сказать: «С именем Аллаха» и принести жертву с намерением так же, как он совершает удхия с намерением, и сказать: «Это ‘акыка такого-то сына такого-то»”. См. “Тухфатуль-маудуд” 138. Имам Ибн аль-Мунзир сказал: “Если у человека было намерение совершить жертвоприношение в качестве ‘акыки, однако он не произнёс ничего, то его намерения будет достаточно с дозволения Аллаха”.² ",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹Абу Я’ля 4521, ль-Байхакъи 9/304. Имам Ибн аль-Мунзир и имам ан-Науауи назвали хадис хорошим. См. «аль-Маджму’» 8/428, “Тухфатуль-маудуд” 137."
                },
                {
                    "source": "²См. “Тухфатуль-маудуд” 137."
                }
               
            ]
        },
        {
            "id": 19,
            "subtitle": "Как следует распределять мясо ‘акыки?",
            "text": "Ученые говорили, что если всё жертвенное животное (удхия) будет съедено семьей, и не будет ничего роздано в качестве садакъа, то жертвоприношение не засчитывается. Что же касается ‘акыки, то в отношении неё все не так строго. Имам аль-Халляль в «аль-Джами’» сказал: “Спросили имама Ахмада об ‘акыке: “Что с ней делать?”, - и он ответил: «Что пожелаешь»”. Но лучше, конечно же, раздать садакъа с части акыки. ‘Аиша (да будет доволен ею Аллах) говорила о распределении мяса ‘акыки: “Следует есть самим и кормить других”. Ибн Аби Шейба 5/172. Когда Мухаммада ибн Сирина спросили: “Можно ли кормить ‘акыкой свою семью?” Он ответил: “Да. Но не ешь все, а ешь сам и корми с этого”. Ибн Аби Шейба 8/54. Хишам ибн ‘Уруа рассказывал, что его отец приносил в жертву за девочку и за мальчика по одному барану, и давал им имя в тот же день. Джарир спросил Хишама: “А кого он кормил этой ‘акыкой?” Хишам сказал: “Свою семью и соседей”. Ибн Аби ад-Дунья в “аль-“Ияль” 65. Мясо жертвенного животного может быть распределено в приготовленном или неприготовленном виде, но предпочтительнее первое, поскольку в этом больше блага, и это упомянуто многими учеными. Имам аль-Багъауи сказал: “Желательно не раздавать всё мясо сырым, однако лучше приготовить его и раздать нуждающимся. И если созвать на угощение людей, то и это дозволено”. См. “ат-Тахзиб” 8/49. Самое же лучшее распределение ‘акыки – это её распределение, подобное распределению удхия: часть для семьи, часть для угощения и часть для садакъи, как об этом сообщается в хадисе, переданном со слов Ибн ‘Аббаса (да будет доволен им Аллах), что Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«Треть мяса следует оставить для своей семьи, треть использовать в качестве угощения, а треть раздать нуждающимся»** Абу Муса аль-Асфахани в “аль-Уазаиф”. Хадис хороший. См. “аль-Мугъни” 9/448, “Мир’атуль-мафатих” 5/247. Сказал аль-Хасан аль-Басри: «‘Акыка распределяется так же, как распределяется ухдия». См. “аль-Мухалля” 4/237. Передается от имама аш-Шафи’и, что он говорил: “Мясо ‘акыки в употреблении и милостыне, подобно праздничному жертвоприношению (удхия)”. См. “ар-Раудату-ннадийя” 3/145. Со слов ‘Аты и Муджахида передают, что они говорили: “Относительно ‘акыки было сказано: «Треть для соседей, треть для бедных и треть для семьи»”. См. “аль-Машяха аль-Багъдадия” 8. Хафиз Ибн ‘Абдуль-Барр сказал: “Следует распределять ‘акыку так же, как и мясо удхия: часть есть самим, частью раздать садакъа, и частью угостить соседей. Это передается от ‘Аиши, и на этом мнении большинство учёных”.¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. “Фатх аль-Малик” 7/109."
                }
            ]
        },
        {
            "id": 20,
            "subtitle": "Можно ли давать что-либо из мяса жертвенного животного в качестве садакъа неверному?",
            "text": "Разрешается дать что-либо от жертвенного животного неверному, будь это родственник, сосед или совершенно посторонний человек, если он беден, с целью раскрытия его сердца для Ислама, о чем говорил шейх Ибн Баз. Шейх Ибн ‘Усаймин сказал: “Дозволено давать неверному мясо жертвенного животного в качестве садакъа, но при условии, что этот неверный не является тем, кто воюет с мусульманами. В противном случае ему нельзя ничего давать!¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. Фатауа Ибн ‘Усаймин” 2/663."
                }
            ]
        }
    ]
}
