{
    "id": "08",
    "author": "Ибн Серик",
    "category": "Adab",
    "published": "2023",
    "lang": "Ru",
    "title": "Как стать богатым?",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FHow%20to%20become%20rich%3F.jpeg?alt=media&token=fe163771-c283-48f4-b134-0a5448298bfa&_gl=1*xz05ia*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTI1NzEwMS44NC4xLjE2OTkyNjExMzAuMzIuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Как приобрести богатство?",
            "text": "Во имя Аллаха Милостивого Милосердного. Богатство - мечта многих. Бедность - страх всех. Но мы заблуждаемся, думая, что  денег достаточно для счастья. Богатство - это не только деньги, но и все милости, которые  Аллах дал нам для нашего блага. Богатство - это также наша вера, наша мудрость,  наша доброта, наша семья, наши друзья и наше здоровье. Богатство - это то, что  делает нас счастливыми и благодарными. Но как приобрести это самое богатство? Хвала Аллаху, в нашей религии есть ответ и на этот вопрос. Первое, что нужно понять, это то, что богатство принадлежит Аллаху, а не нам. Мы  лишь временные хранители и распорядители того, что Он дал нам. Аллах говорит в  Коране: **И Аллаху принадлежит всё, что на небесах и всё, что на земле** (2:284). Аллах говорит в Коране: **А посредством того, что Аллах даровал тебе, стремись к  Последней обители, но не забывай о своей доле в этом мире! Твори добро, подобно  тому, как Аллах сотворил добро для тебя, и не стремись распространять нечестие  на земле, ведь Аллах не любит распространяющих нечестие.** (28:77). Сказал ибн  Касир комментируя этот аят: «Используй огромное богатство и великую благо,  которыми одарил тебя Аллах, на служение твоему Господу. Старайся приблизиться  к Нему, совершая разного рода поклонения, которые принесут тебе награду при  жизни и в жизни вечной». Не забывай о своей доле в этом мире – т.е. «про еду,  питье, одежду, жилье, жён, из того, что дозволил Аллах. Аллах имеет права на тебя,  так и у тебя есть собственные права. Также твоя семья и твоя жена имеют права на  тебя. Соблюдай права каждого из них». Твори добро, подобно тому, как Аллах  сотворил добро для тебя – т.е. будь щедрым к творениям Аллаха, как Он был щедр с  тобой; ведь Аллах не любит распространяющих нечестие! Второе, чтобы получить богатство от Аллаха, нам следует использовать все  возможные причины которые известны.  Богобоязненность, мольба, покаяние,  упование, благодарность и раздача милостыни - каждый может изменить себя и  получить желаемое как в этом мире так и в будущем. Аллах говорит в Коране: **Воистину, Аллах не меняет положения людей, пока они не  изменят самих себя** (13:11)",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F01-kakstatBogatim.mp3?alt=media&token=afca117f-0579-48ed-9f99-2ff7b68b0368&_gl=1*13t0cpb*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMTc3MjEuNTcuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Богобоязненность",
            "text": "Богобоязненность (Ат-Таква) можно понимать как твердую убежденность в том что только один Всевышний Аллах достоин поклонения, испытывать  страх перед Ним и надежду на Него, неукоснительно соблюдать основы ислама и имана, отрешаться о всего греховного и праздного и неуклонное выполнять предписания религии. Аллах говорит в Коране: **“Поистине, Аллах принимает поклонение лишь от богобоязненных”** (5:27), **“О те, которые уверовали! Бойтесь Аллаха и говорите слово правильное! Исправит Он для вас дела ваши и простит вам ваши грехи. А кто повинуется Аллаху и Его посланнику, тот достиг великого успеха!** (33:70-71), **“Тому, кто боится Аллаха, Он создает выход из положения и наделяет его уделом оттуда, откуда он даже не предполагает”** (65: 2-3), **“Тому, кто боится Аллаха, Он облегчает дела. Таково повеление Аллаха, которое Он ниспослал вам. Тому, кто боится Аллаха Он простит прегрешения и увеличит награду”** (65: 4-5), **“О те, которые уверовали! Бойтесь Аллаха и веруйте в Его Посланника, и тогда Он одарит вас вдвойне из Своей милости, и дарует вам свет, при котором вы будете идти, и простит вас. Аллах — Прощающий, Милосердный.** (57:28) Богобоязненность наш щит на тернистом пути к Раю и первая ступень к достатку. И взойти на нее несложно, нужно искренне захотеть, сделать первый шаг  и просить помощи у Аллаха. Как сказал Всевышний: «Если Мои рабы спросят тебя обо Мне, то ведь Я близок и отвечаю на зов молящегося, когда он взывает ко Мне.” (2:186)",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F02-kakstatBogatim.mp3?alt=media&token=853460f6-2496-4b0d-96f2-9ecb9766207b&_gl=1*1oy7mkz*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTA5MDcxNC43OS4xLjE2OTkwOTExNzMuNTEuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Мольба",
            "text": "Взывать к Аллаху с мольбой это следующая ступень на дороге к обретению  желаемого богатства. Мольба (дуа) - это обращение к Всевышнему Аллаху с  просьбами о помощи и защите. Дуа это обязательная часть поклонения как сказал  об этом Аллах в коране: “Ваш Господь сказал: «Взывайте ко Мне, и Я отвечу вам.  Воистину, те, которые превозносятся над поклонением Мне, войдут в Геенну  униженными».” (40:60).  Каждый желающий получить ответ на свою мольбу должен использовать  инструменты известные из сунны - к ним относится - времена, состояние и  содержание мольбы. В какое время взывать с мольбой лучше? Например во время  дождя, в третью часть ночи, между азаном и икамой, в определённый промежуток  времени в пятницу, в Ночь предопределения, в день Арафа. В состоянии молитвы,  как об этом передал Абу Хурейра: “посланник Аллаха (мир ему и благословение  Аллаха) сказал: «Ближе всего к своему Господу раб оказывается во время  совершения земного поклона, так почаще же обращайтесь к Нему с мольбами в  этом состоянии»¹. Также важно взывать к Аллаху используя Его прекрасные имена. Сказал Аллах в  Коране: “Аллаху принадлежат наипрекраснейшие имена, так взывайте к Нему ими”  (7:180).  В контексте нашей статьи остановимся подробнее на трех именах Аллаха - Аль-Гани (Богатый). В Коране: “О люди! Вы нуждаетесь в Аллахе, тогда как Аллах — Богатый,  Достохвальный.” (35:15). Имя Аллаха Богатый указывает на то что только Ему  принадлежат все богатства этого мира и как Владыка только он распоряжается кого  одарить ими а кого лишить. Сказал Аллах в Коране: “Он избавляет от нужды (или  дарует богатство) и наделяет собственностью (или удовлетворяет).” (53:48). Второе  имя которые нужно использовать в своих обращениях это имя Ар-Раззак и означает  “Наделяющий уделом”, и сказано в Коране: **Воистину, Аллах является Наделяющим  уделом, Обладающим могуществом, Крепким,  Аллах дарует удел без расчета,  кому пожелает.** (2:212). Третье имя Аль-Ваххаб что значит “Дарующий”, в Коране  говорится: **Или же у них есть сокровищницы милости твоего Господа,  Могущественного, Дарующего?** (38:9), **Господь наш! Не уклоняй наши сердца в  сторону после того, как Ты наставил нас на прямой путь, и даруй нам милость от  Себя, ведь Ты — Дарующий!** (3:8).  Каждое из этих имен трактуется в широких смыслах, мы же представили прямой  перевод с примерами использования имен в Коране.  И хотя взывать к Аллаху можно своими словами, не стоит забывать о коранических  мольбах и известных словах с которыми обращался Пророк (да благословит и  приветствует его Аллах).  Во многих из которых посланник Аллаха (да благословит и  приветствует его Аллах) просил **о защите от бедности и трудностей, от скупости и  лености, от малодушия и слабости.** Он (да благословит и приветствует его Аллах)  говорил: **О Аллах! Поистине я прибегаю к Твоей защите от слабости, лени,  малодушия, старческой дряхлости и скупости, я прибегаю к Твоей защите от  мучений могилы, и я прибегаю к Твоей защите от испытаний жизни и смерти.** От  Абдуллаха ибн Масуда (да будет доволен им Аллах) нам известно что Пророк (да  благословит и приветствует его Аллах) многократно повторял такие слова мольбы: **О Аллах, поистине, я прошу у Тебя руководство, богобоязненность, воздержание и  богатство**. Муслим (2721). Комментируя хадис в котором приводится эта мольба,  шейх Абдур-Рахман ибн Насир ас-Саади сказал: “Это обращение с мольбой к  Аллаху относится к числу самых емких и полезных обращений. Тот, кому даруются  руководство и благочестие, способность к воздержанию и богатство, о которых  говорится в этом хадисе, обретёт счастье в обоих мирах, достигнет всего  желаемого и спа­сётся от всего устрашающего, а Аллах знает об этом лучше.”",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F03-kakstatBogatim.mp3?alt=media&token=f7b2ad7e-fd71-426f-8e49-33d8caaaf9f0&_gl=1*1nmv1is*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTA5MDcxNC43OS4xLjE2OTkwOTE2MjAuNTEuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹Муслим 482"
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "Покаяние",
            "text": "Важная веха на пути мусульманина и еще одна ступень к богатству- покаяние. Но  следует помнить, для принятия Аллахом, важно соблюсти следующие условия: во- первых следует перестать совершать греховное из страха перед Всевышнем, во- вторых сожалеть из-за совершенного, в-третьих возыметь решимость никогда  более не возвращаться к этому греху ради Аллаха. Всевышний Аллах сказал: **“О  верующие! Обращайтесь к Аллаху с покаянием все вместе, — быть может, вы  преуспеете.”** (24:31). Пророк Нух (мир ему и благословение Аллаха) обращаюсь к  своему народу говорил: **“Я говорил: «Просите у вашего Господа прощения, ведь Он  — Всепрощающий. Он ниспошлет вам с неба обильные дожди, поддержит вас  имуществом и детьми, взрастит для вас сады и создаст для вас реки. Почему вы не  чтите величия Аллаха?”** (71:10-13). Конечно, из прекрасных плодов покаяние в  первую очередь это Рай, и в коране множество сообщений по этому поводу, однако  мы привели слова Аллаха в контексте нашей статьи и опустили сообщения о  Райской обители. Однако стоит помнить что именно рай является той единственной, по настоящему желаемой, наградой и великим успехом для праведного  мусульманина.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F04-kakstatBogatim.mp3?alt=media&token=798afb57-2826-4e16-85a5-658bcd817fb5&_gl=1*1kpog2e*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTA5MDcxNC43OS4xLjE2OTkwOTIwNzYuNTMuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹Муслим 482"
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Упование",
            "text": "Еще одна ступень и непременное условие на пути к богатству в обоих мирах - Упование. Но что значит уповать? Это полностью полагаться на Аллаха в получении блага и защите от зла а также в облегчении положения. Всевышний Аллах сказал: **«А кто уповает на Аллаха, для того Он достаточен!»** (65:3). В комментариях к этому аяту ибн Касир привел сообщение от имама Ахмада, который передал что как-то раз Ибн Аббас ехал верхом позади Посланника Аллаха (да благословит его Аллах и приветствует), и Посланник Аллаха (да благословит его Аллах и приветствует) сказал ему: **«Однажды, когда я сидел верхом позади посланника Аллаха, да благословит его Аллах и приветствует, он сказал: “О мальчик, я научу тебя нескольким словам: помни об Аллахе, и Он будет хранить тебя, помни об Аллахе, и ты обнаружишь Его перед собой. Если (захочешь) попросить (о чём-либо), проси Аллаха, если (захочешь) обратиться за помощью, обращайся за ней к Аллаху, и знай, что если все люди соберутся вместе, чтобы сделать для тебя что-нибудь полезное, они принесут тебе пользу лишь в том, что было предопределено тебе Аллахом, и если соберутся они вместе, чтобы нанести тебе вред, они повредят тебе лишь в том, что было предопределено тебе Аллахом, ибо перья уже подняты, а страницы высохли»**¹ Однако стоит остерегаться крайностей в этом вопросе упования. Не думать раз уже  все предрешено то и делать ничего не надо потому что Посланник Аллаха (да  благословит его Аллах и приветствует) на вопрос “мне привязать верблюда и уповать на Аллаха, или же отвязать и уповать?” ответил: **“Привяжи и уповай!”.** Ибн Аббас передал что Всевышний Аллах ниспослал аят: **“Берите с собой припасы,  но лучшим припасом является богобоязненность”** по причине йеменцев которые  отправились в хадж не взяв с собой провизию, сказав: **«Мы уповающие на Аллаха».** Упование мусульманина - уверенность в милости Аллаха, в наделении пропитанием и избавлением от бед. Посланник Аллаха (мир ему и благословение Аллаха) сказал:  **“Если бы вы уповали на Аллаха истинным упованием, то получали бы свой удел так, как получает его птица, которая улетает утром с пустым животом, а возвращается  вечером с полным”.**",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F05-kakstatBogatim.mp3?alt=media&token=cbded9df-531a-4f2f-9119-8ab69d90ec15&_gl=1*2zwp6e*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMTg0NDYuNTIuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹(Ахмад 2669, ат-Тирмизи 2516)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Благодарность ",
            "text": "Благодарность. Пятая ступень это благодарность. Сказал Аллаха в Коране: **“Поклоняйся же одному  Аллаху и будь в числе благодарных.”** (39:66). Благодарность мусульманина Аллаху  это жизнь в поклонении и беспрестанном поминании Аллаха, признание милостей и. дарованных благ. Каждый желающий богатства должен помнить слова Аллаха: **Вот ваш Господь  возвестил: Если вы будете благодарны, то Я одарю вас еще большим. А если вы будете неблагодарны, то ведь мучения от Меня тяжки** (14:7), **Тому, кто желает вознаграждения в этом мире, Мы дадим его, и тому, кто желает вознаграждения в Последней жизни, Мы дадим его. Мы вознаградим благодарных.** (3:145), комментируя слова **“Мы вознаградим благодарных”**  Ибн Касир сказал: “т.е. Аллах воздаст им из Своей милости в этом мире и в мире вечном в соответствии с их благодарностью и деяниями. Пророк, мир ему и благословение Аллаха, сказал: **«Не благодарит Аллаха тот, кто не благодарит людей»**¹",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F06-kakstatBogatim.mp3?alt=media&token=62996494-4034-48bf-a9bb-310e92f6a332&_gl=1*50r6jo*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMTkxMzguNTIuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹(Тирмизи, 1954)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Раздача милостыни (Садака)",
            "text": "Обязательная (закят) и добровольные пожертвования шестой шаг на лестнице к богатству. Мы лишь кратко коснемся некоторых аятов и хадисов.  Сказал Всевышний Аллах: **“Воистину, для мужчин и женщин, которые раздавали милостыню и одолжили Аллаху прекрасный заем, он будет увеличен. Им уготована щедрая награда”** (57:18) и сказал: **Скажи: Воистину, мой Господь увеличивает или ограничивает удел тому из Своих рабов, кому пожелает. Он возместит все, что бы вы ни израсходовали. Он — Наилучший из дарующих удел** (34:39). Передают со слов Абу Хурайры что пророк, да благословит его Аллах и приветствует, сказал: **Благой и Всевышний Аллах сказал: «О сын Адама! Расходуй, и Я буду расходовать на тебя. И Он сказал: «Десница Аллаха, из которой ночью и днём обильно изливаются милости, полна, и ничто из неё не исчезает»**. Из приведенного становится кристально ясно что милостыня обязательный атрибут на пути к богатству и довольству Аллаха.Завершая, мы должны помнить что мусульманин это не тот кто сидит сложа руки и ждет **“манны небесной”**, мусульманин это деятельный человек который взращивает плоды своих трудов с верой в Аллаха, с Его помощью и дозволения и помнит что Посланник Аллаха (мир ему и благословение Аллаха) сказал: **«Богатство человека не в изобилии мирских благ. Истинное богатство – это богатство души».**¹ Он ищет дозволенные методы для заработка и знает что он в этом мире всего лишь путник который уйдет из этого мира с багажом наполненным благими делами. И хвала Аллаху господу миров!",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FkakstatBogatim%2F07-kakstatBogatim.mp3?alt=media&token=9331dbea-ab84-4a8f-83cc-e68a4f7850d2&_gl=1*1303elo*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMTk5OTIuNTAuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹(аль-Бухари 6446, Муслим 1051)."
                }
            ]
        }
    ]
}
