{
    "id": "09",
    "author": "Ibn Serik",
    "category": "Adab",
    "published": "2023",
    "lang": "En",
    "title": "How to become rich?",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FHow%20to%20become%20richEn%3F.jpeg?alt=media&token=f369e171-81e3-46a4-aff5-f87299346afa&_gl=1*142q646*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTI1NzEwMS44NC4xLjE2OTkyNTk1NDkuMTYuMC4w",
    
    "chapters": [
        {
            "id": 1,
            "subtitle": "How to acquire wealth?",
            "text": "In the name of Allah the Most Merciful. How to become rich? Wealth is the dream of many. Poverty is the fear of all. But we are mistaken in thinking that money is everything. Wealth is not only money, but all the benefits that Allah has given us for our good. Wealth is also our faith, our wisdom, our kindness, our family, our friends and our health. Wealth is what makes us happy and grateful. But how do we acquire this very wealth? Praise be to Allah, our religion has an answer to this question as well. The first thing to realize is that wealth belongs to Allah and not to us. We are only temporary custodians and stewards of what He has given us. Allah says in the Qur'an, **And to Allah belongs all that is in the heavens and all that is on the earth** (2:284). Allah says in the Qur'an: **And by means of that which Allah has bestowed upon you, strive for the Last Abode, but do not forget your share in this world! Do good, just as Allah has done good for you, and do not seek to spread wickedness in the earth, for Allah does not love those who spread wickedness.** (28:77). Ibn Kathir commenting on this ayah said: Use the great wealth and the great boon that Allah has bestowed upon you in the service of your Lord. Try to draw near to Him by performing all kinds of worship, which will bring you reward in your lifetime and in the eternal life. Do not forget your share in this world - i.e., food, drink, clothing, shelter, wives, of what Allah has permitted. Allah has rights over you, so you have your own rights. Also your family and your wife have rights over you. Observe the rights of each of them. Do good just as Allah has done good for you - that is, be generous to Allah's creations as He has been generous to you; for Allah does not like those who spread wickedness! Second, to get wealth from Allah, we should use every possible reason that is known.  Piety, supplication, repentance, trust, gratitude and giving alms - everyone can change himself and get what he wants in this world and in the hereafter. Allah says in the Qur'an, ** Verily, Allah does not change the condition of people until they change themselves.** (13:11)",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F01-HowToBecomeRich.mp3?alt=media&token=7c9c3688-1836-48bf-8dcc-cf951900c455&_gl=1*1srwrcj*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMjE3MzYuMjcuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Piety",
            "text": "Piety. Fear of Allah (At-Taqwa) is a firm conviction that Allah Almighty alone is worthy of worship, it is fear of Him and hope in Him, strict observance of the fundamentals of Islam and iman, renunciation of everything sinful and idle, and unswerving fulfillment of the rules of religion. And the reward will not be long in coming.  Allah says in the Qur'an: **Verily, Allah accepts worship only from the God-fearing.** (5:27) **O those who have believed! Fear Allah and speak the right word! He will rectify for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger, he has attained great success!** (33:70-71), **To the one who fears Allah, He creates a way out and bestows upon him an inheritance from a place from which he does not even presume.** (65: 2-3), **To the one who fears Allah, He makes things easy. Such is the command of Allah which He has sent down to you. To him who fears Allah, He forgives transgressions and increases the reward.** (65: 4-5), **O those who have believed! Fear Allah and believe in His Messenger, and then He will bestow upon you doubly out of His mercy, and grant you light in which to walk, and forgive you. Allah is the Forgiving, the Merciful.** (57:28). Piety is our shield on the thorny path to Paradise and the first step to prosperity. And it is not difficult to climb it, it is necessary to sincerely want, make the first step and ask Allah for help. As the Almighty said, **If My servants ask you about Me, I am near and I answer the call of the one who prays when he calls to Me.** (2:186)",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F02-HowToBecomeRich.mp3?alt=media&token=b4a2e643-54ef-4671-976c-6d6223c5d301&_gl=1*18ew9p*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMjIxNDYuNTMuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Supplication (Dua)",
            "text": "Calling out to Allah with supplication is the next step on the road to acquiring the desired wealth. Dua is a request to Allah Almighty for help and protection. Du'a is an obligatory part of worship as Allah said in the Qur'an: **Your Lord said: Call upon Me and I will answer you. Verily, those who exalt them selves above worshiping Me will enter Gehenna humiliated.** (40:60).  Anyone who wishes to have his supplication answered must use the tools known from the Sunnah - these include - the time, condition and content of the supplication. What is the best time to make supplication? For example, during rain, in the third part of the night, between azan and iqamah, at a certain time on Friday, on the Night of Predestination, on the Day of Arafah. In the state of prayer, as reported by Abu Hureyrah: The Messenger of Allah (peace and blessings of Allah be upon him) said: **The closest a slave comes to his Lord is when he is making the earthly bow, so make supplications to Him more often in this state.**  (Muslim 482) It is also important to invoke Allah using His beautiful names. Allah said in the Qur'an: **Allah has the most beautiful names, so call upon Him by them.** (7:180). In the context of our article, let us elaborate on the three names of Allah - Al-Ghani (the Rich).Allah said in the Qur'an: **O people! You are in need of Allah, whereas Allah is the Rich, the Worthy.** (35:15). Allah's name Rich indicates that He alone owns all the riches of this world, and as the Sovereign, He alone has the power to bestow them on whom to bestow them and whom to deprive of them. Allah said in the Qur'an, **He relieves want (or bestows wealth) and bestows property (or satisfies).** (53:48). The second name to be used in your addresses is **Ar-Razzaq** and it means The Grantor of Inheritance and it is said in the Qur'an: **Verily, Allah is the Grantor of Inheritance, the Mighty, the Strong.**  **Allah grants inheritance without calculation to whomever He wills.** (2:212). The third name is **Al-Wahhab** which means **The Giver**, Allah said in the Qur'an: **Or do they have treasuries of mercy from your Lord, the Mighty, the Giver?** (38:9), **Our Lord! Do not turn our hearts aside after You have guided us to the straight path, and grant us mercy from Yourself, for You are the Giver!** (3:8).  Each of these names is interpreted in a wide range of meanings, and we have presented a direct translation with examples of the use of the names in the Qur'an.  Although it is possible to invoke Allah in your own words, we should not forget the Qur'anic supplications and the famous words that the Prophet (peace and blessings of Allah be upon him) used.  In many of them the Messenger of Allah (peace and blessings of Allah be upon him) asked for protection from poverty and hardship, from stinginess and sloth, from cowardice and weakness. He (peace and blessings of Allah be upon him) said, **O Allah! Verily I resort to Your protection from weakness, laziness, cowardice, senility and avarice, I resort to Your protection from the torment of the grave, and I resort to Your protection from the trials of life and death.** Is narrated  from Abdullah ibn Mas'ud (may Allah be pleased with him) that the Prophet (peace and blessings of Allah be upon him) repeated the following words of supplication many times: **O Allah, verily, I ask You for guidance, piety, abstinence and wealth**. Muslim (2721). Commenting on the hadith in which this supplication is given, Sheikh Abdur-Rahman ibn Nasir al-Saadi said: This supplication to Allah is among the most capacious and beneficial supplications. Whoever is granted the guidance and piety, the capacity for abstinence, and the wealth referred to in this hadith will find happiness in both worlds, attain all that he desires, and be saved from all that is frightening, and Allah knows best.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F03-HowToBecomeRich.mp3?alt=media&token=1d0f2ffd-ec61-4fe9-86eb-a9b9b39a9c80&_gl=1*1g702a0*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMjMwMjkuNTMuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "Repentance",
            "text": "Repentance. Important milestone on the path of a Muslim and another stepping stone to wealthf- repentance. But it should be remembered that in order to be accepted by Allah, it is important to fulfill the following conditions: firstly, one should stop committing sin out of fear of Allah, secondly, one should regret the sin committed, and thirdly, one should be determined never to return to that sin again for the sake of Allah. Allah Almighty said: **O believers! Turn to Allah in repentance all together, - perhaps you will succeed.** (24:31). Prophet Nuh (peace and blessings of Allah be upon him) addressing his people said: **I used to say: 'Ask your Lord for forgiveness, for He is the Forgiving. He will send you abundant rains from the sky, support you with property and children, grow gardens for you, and create rivers for you.Why do you not honor the greatness of Allah?** (71:10-13). Of course, the first of the beautiful fruits of repentance is Paradise, and the Qur'an has many messages about it, but we have cited Allah's words in the context of our article and omitted the messages about Paradise. And it should be remembered that Paradise is the only truly desired reward and great success for a righteous Muslim.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F04-HowToBecomeRich.mp3?alt=media&token=acda64e3-4070-4bb1-95cd-97906c32a14e&_gl=1*p0vgop*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTExNjE3OC44Mi4xLjE2OTkxMjM1MjAuNDguMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Put your trust in Allah",
            "text": "Put your trust in Allah. Another step and prerequisite on the road to wealth in both worlds is Trust. But what does it mean to trust? It is to rely completely on Allah for good and protection from evil and relief. Allah Almighty said: **And whoever trusts in Allah, for him He is sufficient!** (65:3). In his commentary on this ayat, Ibn Qasir cited a report from Imam Ahmad who reported that once Ibn Abbas was riding behind the Messenger of Allah (peace and blessings of Allah be upon him) and the Messenger of Allah (peace and blessings of Allah be upon him) said to him:  **O young man, I shall teach you some words [of advice]: Be mindful of Allah and Allah will protect you. Be mindful of Allah and you will find Him in front of you. If you ask, then ask Allah [alone]; and if you seek help, then seek help from Allah [alone]. And know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they were to gather together to harm you with anything, they would not harm you except with what Allah had already prescribed against you. The pens have been lifted and the pages have dried.** It was related by at-Tirmidhi, who said it was a good and sound hadeeth. Another narration, other than that of Tirmidhi, reads: **Be mindful of Allah, and you will find Him in front of you. Recognize and acknowledge Allah in times of ease and prosperity, and He will remember you in times of adversity. And know that what has passed you by [and you have failed to attain] was not going to befall you, and what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and hardship with ease.** (Ahmad 2669, at-Tirmizi 2516). However, one should beware of extremes in this matter of trust. One should not think that if everything is predetermined, then one should not do anything, because the Messenger of Allah (peace and blessings of Allah be upon him) answered the question, O Messenger of Allah! Shall I tie it and rely (upon Allah), or leave it loose and rely (upon Allah)? He said: **Tie it and rely (upon Allah)**. Ibn Abbas transmitted that Allah Almighty sent down the ayat: **Take supplies with you, but the best supply is piety** on account of the Yemenis who went on Hajj without taking provisions with them, saying: We are those who trust in Allah.  A Muslim's trust is confidence in Allah's mercy, provision and deliverance from trouble. The Messenger of Allah (peace and blessings of Allah be upon him) said: **If you really put your trust in Allah, He would provide for you as He provides for the birds. Do you not see that they go out with empty stomachs and come back with full stomachs?** (Musnad Ahmad 373)",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F05-HowToBecomeRich.mp3?alt=media&token=9cc9ce11-0b99-4f35-a890-1b7d87b24353&_gl=1*11sskjg*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTI1NzEwMS44NC4xLjE2OTkyNTgxNjcuNjAuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Gratitude",
            "text": "Gratitude. The fifth step is gratitude. Allah Said in the Qur'an, **But worship Allah alone and be among the grateful.** (39:66). A Muslim's gratitude to Allah is a life of worship and unceasing remembrance of Allah, recognizing the favors and benefits bestowed upon him. Anyone who desires wealth should remember Allah's words: **Behold your Lord has declared: 'If you are grateful, I will bestow upon you more. And if you are ungrateful, for the torment from Me is heavy** (14:7), **To him who desires reward in this world We will give it, and to him who desires reward in the Hereafter We will give it. We will reward the grateful.** (3:145), commenting on the words **We will reward the grateful** Ibn Qasir said:  that is, Allah will reward them out of His mercy in this world and in the Hereafter according to their gratitude and deeds. The Prophet (peace and blessings of Allah be upon him) said: **He who does not thank the people is not thankful to Allah.** (Tirmizi, 1954).",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F06-HowToBecomeRich.mp3?alt=media&token=afec326b-48d9-470a-8382-75b54bb8a791&_gl=1*ztl95n*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTI1NzEwMS44NC4xLjE2OTkyNTkyNTAuMTkuMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Almsgiving",
            "text": "Almsgiving. Obligatory almsgiving (zakat) and voluntary giving is the sixth step on the ladder to wealth. Many works are devoted to the dignity of almsgiving, we will touch only briefly on some ayats and hadiths. Allah Almighty said: **Verily, for the men and women who gave alms and lent Allah a fine loan, it will be increased. A bountiful reward is prepared for them.** (57:18) and said: **Say: 'Verily, my Lord increases or limits the inheritance of whichever of His slaves He wills. He will recompense whatever you spend. He is the Best of the givers of inheritance** (34:39). It is narrated from Abu Hurairah that the Prophet (peace and blessings of Allah be upon him) said: **The Beneficent and Most High Allah said: O son of Adam! Spend, and I will spend on you.** And He said: **The Hand of Allah, from which favors are abundantly poured out night and day, is full, and nothing disappears from it.** From the above, it is crystal clear that almsgiving is an obligatory attribute on the way to wealth and contentment of Allah. In conclusion, we should remember that a Muslim is not someone who sits idly by and waits for the manna of heaven, a Muslim is an active person who nurtures the fruits of his labors with faith in Allah, with His help and permission and remember that the Messenger of Allah (peace and blessings of Allah be upon him) said: **Richness does not lie in the abundance of (worldly) goods but richness is the richness of the soul (heart, self).** (al-Bukhari 6446, Muslim 1051). He seeks permissible methods to earn money and knows that he is only a traveler in this world who will leave this world with baggage filled with good deeds. Allah knows best!",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FHowToBecomeRichEn%2F07-HowToBecomeRich.mp3?alt=media&token=79397702-c8c2-440d-b643-d1f0ec4b0200&_gl=1*1ib5msp*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5OTI1NzEwMS44NC4xLjE2OTkyNjA2ODEuNDguMC4w",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                }
            ]
        }
    ]
}
