{
    "id": "11",
    "author": "Абдурраҳмон Ибни Носири Саъдӣ",
    "category": "Tafsir",
    "published": "2023",
    "lang": "Tj",
    "title": "Тафсири сураи Фотиҳа",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FtafseerSaadi.jpeg?alt=media&token=c7377214-8c4b-41c6-9f83-7abd7cf616e6&_gl=1*1x2li72*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5ODY4MjMyOS42NC4xLjE2OTg2ODQwODkuMTYuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Сураи Фотиха",
            "text": "Ба номи Аллоҳи бахшандаи мехрубон (1)\nСитоиш махсуси Аллоҳ аст, ки Парвардигори ҷаҳониён аст (2)\nБахшандаи Меҳрубон аст (3)\nМолики рӯзи ҷазо аст (4)\nТанҳо туро мепарастем ва танҳо аз ту ёрӣ меҷӯем (5)\nМоро ба роҳи рост ҳидоят намо (6)\nРоҳи касоне ки бар онҳо неъмат додаи на роҳи касоне ки бар онҳо хашм гирифтаи ва на роҳи гумроҳон (7)",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Ба номи Аллоҳи бахшандаю меҳрубон",
            "text": "**«بِسۡمِ ٱللَّهِ»**  Яъне оғоз мекунам бо истионат аз тамоми номҳои Аллоҳи мутаъол; зеро калимаи  **«اسم»** (Исм) муфрад ва музоф аст, бинобарин тамоми Асмои Ҳусноро дар бар мегирад.  **«ٱللَّهِ»** (Аллоҳ) ба маънои Худованд ва Маъбуд аст ва аз онҷо, ки Худованд ба сифоти Улуҳият ки сифоти камол аст мутасиф мебошад, сазовор аст ки танҳо у парастиш шавад. **«لرَّحۡمَٰنِ ٱلرَّحِيمِ»**   **«Ар-роҳманир-роҳим»**  ду исми аз исмҳои мубораки Аллоҳ аст ва баёнгари онанд, ки у таъоло *«яъне Аллоҳи мутаъол»*  дорои азамат ва раҳмати густурдае аст, ки ҳарчиз ва ҳар мавҷуди зиндаеро дар бар мегирад ва Аллоҳ бандагони парҳезгорашро, ки аз Паёмбаронаш пайравӣ мекунанд аз он бархурдор месозад.  Пас раҳмати бекарони Аллоҳ шомили ҳоли ин даста аз инсонҳо аст, ва дигарон фақат баҳрае аз он надоранд. Бидон ки яке аз қоидаи мавриди иттифоқи гузаштагон ва пешвоёни ин уммат, имон ба асмо ва сифоти Парвардигор ва аҳкоми марбут ба сифот аст; Ба таври мисол муътақид буданд, ки Аллоҳ **«رحمان»** **«Раҳмон»**  ва  **«رحیم»** **«Раҳим»**  **«Бахшанда ва меҳрубон»** аст ва дорои раҳмате аст, ки ба он тавсиф аст. Бинобар ин ҳамаи неъматҳои асарӣ ва осорӣ раҳмати у мебошанд. Онҳо дар робита ба дигар асмои Илоҳи низ чунин эътиқод доштанд; масалан муътақид буданд, ки **«العلیم»**  **«ал-ъалим»** яъне худованд доно ва дорои илм аст ва ҳама чизро медонад ва **«قدیر»** яъне худованд дорои тавонои аст ва бар ҳар чизи тавонои дорад.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Ситоиш махсуси Аллоҳ аст, ки Парвардигори ҷаҳониён аст",
            "text": "**«ٱلۡحَمۡدُ لِلَّهِ»**  **«Алҳамдулиллаҳи»** Ҳамд; яъне ситоиши худованд ба хотири сифоти камол ва афъоле ки аз сари фазл ва бузургворӣ ва ё адл ва додгари аз вай содир мешавад. Пас ситоиши комил барои ӯст.  **«رَبِّ ٱلۡعَٰلَمِينَ»** **«Раб»** яъне парвардигори тамоми ҷаҳониён; чаро ки Худованд ҷаҳони ҳасти ва тамоми мавҷудотро офарида ва неъматҳои фаровониро дар ихтиёри онон қарор додааст, ки агар аз ин неъматҳо ва абзорҳо бархурдор набуданд, имкони бақо ва давоми онҳо мумкин намешуд. Пас онон ҳар неъматеро ки доранд аз ҷониби Аллоҳи мутаъол аст. Аллоҳ ба ду сурат офаридаҳояшро парвариш медиҳад, яке ба сурати ом ва фарогир ва дигаре ба сурати хос ва вижа. Парвариши ом ин аст, ки офаридагонро офарида ва ба онҳо рӯзи дода ва онҳоро ба суи манофиашон бақо ва ҳаёташон дар дунё ба он бастаги дорад, ҳидоят ва роҳнамои кардааст. Парвариши хос низ иборат аз парвариши авлиё мебошад; Худованд бо имон ва яқине ки ба онон ато мекунад онҳоро парвариш дода ва ба онҳо тавфиқ медиҳад, ки имон биёваранд, ва имонро барои онҳо комил мегардонад ва мавониъеро ки миёни у ва онҳо ҳоил аст, дур мекунад. Ҳақиқати ин навъи тарбият иборат аст аз: муваффақ шуданба анҷом додани ҳар кори хайр ва неки ва парҳез намудан аз иртикоби ҳар зишти ва бадӣ. Ба ҳамин хотир бештари дуоҳои Паёмбарон бо калимаи  **«رب»** **«Раб»** шуруъ шудааст;  зеро ҳамаи хостаҳои онон дар чорчуби Рубубияти вижаи Худованд таҳаққуқ ёфта аст, пас фармудаи **«رَبِّ ٱلۡعَٰلَمِينَ»** баёнгари ягона будани Худованд дар офаридан ва тадбири умур, аътои неъматҳо, бениёзии у ва ниёзмандии тамоми ҷаҳониён ба у мебошад.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "Молики рӯзи ҷазо аст",
            "text": "**«مَٰلِكِ يَوۡمِ ٱلدِّينِ»**  **«Молики явмиддин»** Молик касе аст, ки ба сифати Малик ва Подшоҳӣ васф карда шавад, ба ҳамин хотир амр ва наҳй намуда ва подош ва сазо медиҳад ва бо зердастонаш ҳар тавре ки бихоҳад, рафтор мекунад. Дар ин оят **«ملک»**   **«Малик»**  ба **«یوم الدین»**  **«Явмиддин»** изофа шудааст ва **«یوم الدین»** **«Явмиддин»** ба маънии рӯзи қиёмат аст, рӯзе ки мардум подоши аъмоли хуб ва бади худро дарёфт мекунанд; зеро дар он рӯз ҳақиқати подшоҳӣ ва адл ва ҳикмати Худованди, ва пастии подшоҳии офаридагон барои мардум равшан мегардад, то ҷое ки дар он рӯз подшоҳон, мардуми одӣ, бардагон ва ҳама инсонҳо аз ҳуқуқи баробарӣ бархурдор мебошанд ва ҳама дар баробари азамат ва шукуҳи Илоҳӣ сари таслим фуруд оварда ва дар интизори муҷозоти у ба сар мебаранд; умеди подош аз ӯ доранд ва аз азоби ӯ дар ҳаросанд. Ба ҳамин хотир Аллоҳи мутаъол моликияти худ бар рӯзи ҷазоро ба таври хос дар инҷо зикр кардааст; вагарна Худованд молики рӯзи қиёмат ва дигар рӯзҳо аст.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Танҳо туро мепарастем ва танҳо аз ту ёрӣ меҷӯем",
            "text": "**«إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ»** **«Ийяка наъбуду ва ийяка настаъин»** Яъне танҳо туро мепарастем ва танҳо аз ту ёри меҷуем; Зеро (мутобиқи қоидаи наҳвӣ) тақдими маъмул, ҳаср ва исботи ҳукм барои мазкур ва нафиӣ он аз ғайр ифода мекунад.Пас яъне танҳо туро мепарастем ва аз ибодати ғайр аз ту руй мегардонем, ва аз ту ёрӣ талабида ва ғайр аз ту ёрӣ намеҷуем. ва муқаддам кардани **«Ибодат»** бар **«Истионат»** аз боби тақдими ом бар хос, ва ба хотири иҳтимом варзидан ба ҳаққи Худованди мутаол ва муқаддам доштани он бар ҳаққи банда мебошад.  **«Ибодат»** мафҳуми бисёр ҷомеъ ва фарогир дорад ва ҳамаи аъмол ва ақволи зоҳири ва ботиниро ки худованд онро дуст медорад ва меписандад дар бар мегирад. *«истионат»* низ ба маънии ёрӣ ҷустан аз Аллоҳи мутаол ва такя кардан бар ӯ ба манзури ҷалби манофеъ ва дафъи зиёнҳо аст, ва ин ки одами итминон дошта бошад ки бо такя бар Аллоҳ метавонад ба ин муҳим ноил ояд. Анҷом додани ибодат барои Худо ва ёрӣ ҷустан аз ӯ, василаи касби саъодати абадӣ ва наҷот аз ҳама бадиҳо аст. Пас танҳо роҳи наҷоти инсон ибодати Парвардигор ва ёрӣ ҷустан  аз ӯ аст. Ва ибодат замоне ибодати воқеи ҳисоб мешавад, ки бар гирифта аз суннат ва сираи Паёмбар (ﷺ)  буда ва ҳадаф аз анҷоми он ризои Аллоҳи мутаъол бошад. Пас ҳар амале ки дорои ин ду вижаги бошад - холисона барои ҷалби ризояти Аллоҳ анҷом шавад ва мутобиқи суннати Расули акрам (ﷺ) бошад – ибодат маҳсуб мешавад. Бо ин ки истионат бахше аз ибодат аст, истионатро пас аз ибодат зикр намуд, зеро банда барои анҷоми ибодат ниёзманди ёрии худованди мутаол аст; Зеро агар Аллоҳ ӯро ёри накунад, наметавонад авомир ро анҷом диҳад ва аз навоҳи парҳез кунад.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Моро ба роҳи рост ҳидоят намо",
            "text": "**«اهدنا الصراط المستقيم»**  Яъне моро роҳнамои ва ҳидоят фармо то роҳи ростро биёбам. Роҳи рост; роҳи равшани аст, ки инсонро ба худо ва биҳишт мерасонад, роҳи рост иборат аст аз шинохти ҳақ ва ба амал ба он. Пас моро ба роҳи рост роҳнамои кун ва дар паймудани ин роҳ ба мо тавфиқ ва иноят фармо. Пас ҳидоят ба сӯи роҳи рост; яъне тамассук ба дини ислом ва руй гардондан аз дигар динҳо. Ва ҳидоят дар роҳи рост; ба маънии раҳнамуд шудан ба ҳама тафосили илмӣ ва амалии дин аст. Пас ин дуо аз ҷомиътарин ва муфидтарин дуоҳо барои банда аст. Бинобар ин инсон бояд дар тамоми ракаатҳои намозҳои хеш, Худованд ро бо ин дуо бихонад. Зеро банда ба ин ниёз дорад.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "Роҳи касоне ки бар онҳо неъмат додаи на роҳи касоне ки бар онҳо хашм гирифтаи ва на роҳи гумроҳон",
            "text": "Ва ин роҳи рост иборат аст аз **«صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ»** роҳи касоне ки ба онҳо неъмат додаи, аз қабили Паёмбарон ва сиддиқон ва шуҳадо ва солеҳон. **«غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ»** на роҳи касоне ки бар онҳо хашм гирифтаи; онҳое ки ҳақро шинохтанд ва ба он амал накарданд монанди яҳудиён ва амсоли онҳо.  **«وَلَا ٱلضَّآلِّينَ»** ва на роҳи гумроҳон; ҳамонҳое ки ба сабаби нодонӣ ва гумроҳӣ аз ҳақ рӯйгардон шуданд монанди насоро ва амсоли онҳо. Ин сура бо ин ки бисёр мухтасар ва кӯтоҳ аст аммо дарбаргирандаи мафоҳими аст, ки ҳеҷ сурае аз сураҳо Қуръон онро дар бар надорад. Ин сура тавҳиди сегонаро дар бар гирифтааст; тавҳиди рубубият ки аз **«رَبِّ ٱلۡعَٰلَمِينَ»** гирифта мешавад, ва тавҳиди улуҳият ки ба маънии парастиши худованди якто аст аз калимаи **«ٱللَّهِ»** ва **«إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ»** истинбот мешавад; ва тавҳиди асмо ва сифот ки ба маънии бовар доштан ба сифоти камоли аст ки Аллоҳ барои худ собит намуда ва Паёмбар (ﷺ) бидуни таътил ва ташбиҳ ва тамсил, онҳоро барои Парвардигор собит кардааст, ва аз вижаи **«ٱلۡحَمۡدُ»** истинбот мешавад. Ва исботи нубувват аз **«ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ»** гирифта мешавад; зеро ҳидоят ёфтан ба роҳи рост ҷуз ба кумаки Расул (ﷺ) ва рисолат имкон надорад. Ва исботи рӯзи ҷазо ва иқоби ухравӣ аз **«مَٰلِكِ يَوۡمِ ٱلدِّينِ»** истинбот мегардад; зеро дин ба маънои подоши одилона аст, ва низ ин сура қазо ва қадари илоҳиро исбот мекунад, ва низ ин ки банда фоили ҳақиқи аст, ба хилофи пиндори қадария ва ҷабария ки чунин эътиқод надоранд. Ин сура ҳамчунин дар зимни радди назариёти аҳли бидъат ва гумроҳи аст ва ин матолиб аз **«ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ»** дарёфт мешавад; зеро роҳи рост ба маънии шинохти ҳақ ва амал кардан ба он аст, амре ки ҳар бидъатгузор ва гумроҳе бо он мухолиф аст. Ва низ **«إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ»** ба маънои он аст ки убудият ва бандагӣ бояд холисона барои Аллоҳ сурат бигирад ва бояд фақат аз боргоҳи Ӯ истиъонат ҷуст. Пас Сипос Худовандеро ки Парвардигори Ҷаҳониён аст.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FtafsirSaadiRu%2F06.mp3?alt=media&token=6db2657a-465c-42f3-9bb7-9963040c817e&_gl=1*1kmk7la*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5ODc3MjY3My43MS4xLjE2OTg3NzUxNDQuNjAuMC4w",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        }
    ]
}