{
    "id": "12",
    "author": "Darul-Asar",
    "category": "Sirah",
    "published": "2023",
    "lang": "En",
    "title": "Abdullah Ibn Abbas",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FtafseerSaadi.jpeg?alt=media&token=c7377214-8c4b-41c6-9f83-7abd7cf616e6&_gl=1*1x2li72*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5ODY4MjMyOS42NC4xLjE2OTg2ODQwODkuMTYuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Abdullah Ibn Abbas",
            "text": "Abu Al-Abbas Abdullah, Ibn Al-Abbas bin Abdul Muttalib Shaybah bin Hashim Al-Qurashi Al-Hashimi Al-Makki, Abbas was an uncle of the noble Prophet (ﷺ). He was born just three years before the Hijrah. When the Prophet died, Abdullah was thus only thirteen years old. When he was born, his mother took him to the blessed Prophet (ﷺ) who put some of his saliva on the babe's tongue even before he began to suckle. This was the beginning of the close and intimate tie between Abbas and the Prophet that was to be part of a life-long love and devotion. When Abdullah reached the age of discretion, he attached himself to the service of the Prophet. He would run to fetch water for him when he wanted to make wudu. During Salat, he would stand behind the Prophet (ﷺ) in prayer and when the Prophet (ﷺ) went on journeys or expeditions, he would follow next in line to him. Abdullah thus became like the shadow of the Prophet (ﷺ), constantly in his company. In all these situations he was attentive and alert to whatever the Prophet (ﷺ) did and said. His heart was enthusiastic and his young mind was pure and uncluttered, committing the Prophet's words to memory with the capacity and accuracy of a recording instrument. In this way and through his constant researches later, as we shall see, Abdullah became one of the most learned companions of the Prophet (ﷺ), preserving on behalf of later generations of Muslims, the priceless words of the Messenger of Allah. It is said that he committed to memory about one thousand, six hundred and sixty sayings of the Prophet (ﷺ) which are recorded and authenticated in the collections of al-Bukhari and Muslim. The Prophet (ﷺ) would often draw Abdullah as a child close to him, pat him on the shoulder and pray: **O Allah! Make him  acquire a deep understanding of the religion of Islam and instruct him in the meaning and interpretation of things.**¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹(Sahih al-Bukhari 143)"
                   
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "dua of the prophet (ﷺ) for Abdullah ibn Abbas",
            "text": "There were many occasions thereafter when the blessed Prophet (ﷺ) would repeat this dua or prayer for his cousin and before long Abdullah ibn Abbas realized that his life was to be devoted to the pursuit of learning and knowledge. The Prophet (ﷺ)  moreover prayed that he be granted not just knowledge and understanding but wisdom. Abdullah related the following incident about himself: Once the Prophet, peace be upon him, was on the point of performing wudu. I hurried to get water ready for him. He was pleased with what I was doing. As he was about to begin Salat, he indicated that I should stand at his side. However, I stood behind him. When the Salat was finished, he turned to me and said: **What prevented you from being at my side, O Abdullah?** You are too illustrious and too great in my eyes for me to stand side by side with you, I replied. Raising his hands to the heavens, the Prophet (ﷺ) then prayed: **O Lord, grant him wisdom.** The Prophet's prayer undoubtedly was granted for the young Abdullah was to prove time and again that he possessed a wisdom beyond his years. But it was a wisdom that came only with devotion and the dogged pursuit of knowledge both during the Prophet's lifetime and after his death.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Modesty of Abdullah Ibn Abbas",
            "text": "During the lifetime of the Prophet (ﷺ), Abdullah would not miss any of his assemblies and he would commit to memory whatever he said. After the Prophet (ﷺ) passed away, he would take care to go to as many companions as possible especially those who knew the Prophet  (ﷺ), longer and learn from them what the Prophet  (ﷺ), had taught them. Whenever he heard that someone knew a hadith of the Prophet which he did not know he would go quickly to him and record it. He would subject whatever he heard to close scrutiny and check it against other reports. He would go to as many as thirty companions to verify a single matter. 5 Abdullah described what he once did on hearing that a companion of the Prophet (ﷺ) knew a hadith unknown to him: I went to him during the time of the afternoon siesta and spread my cloak in front of his door. The wind blew dust on me (as I sat waiting for him). If I wished I could have sought his permission to enter and he would certainly have given me permission. But I preferred to wait on him so that he could be completely refreshed. Coming out of his house and seeing me in that condition he said: O cousin of the Prophet(ﷺ)! What's the matter with you? If you had sent for me I would have come to you. I am the one who should come to you, for knowledge is sought, it does not just come, I said. I asked him about the hadith and learnt from him. In this way, the dedicated Abdullah would ask, and ask, and go on asking. And he would sift and scrutinize the information he had collected with his keen and meticulous mind. It was not only in the collection of hadith that Abdullah specialized. He devoted himself to acquiring knowledge in a wide variety of fields. He had a special admiration for persons like Zayd ibn Thabit, the recorder of the revelation, the leading judge and jurist consult in Madinah, an expert in the laws of inheritance and in reading the Quran. When Zayd intended to go on a trip, the young Abdullah would stand humbly at his side and taking hold of the reins of his mount would adopt the attitude of a humble servant in the presence of his master. Zayd would say to him: Don't, O cousin of the Prophet(ﷺ). Thus we were commanded to treat the learned ones among us, Abdullah would say. And Zayd would say to him in turn: Let me see your hand. Abdullah would stretch out his hand. Zayd, taking it, would kiss it and say: Thus we were commanded to treat the ahl al-bayt members of the household of the Prophet.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "The learned man of this Ummah",
            "text": "As Abdullah's knowledge grew, he grew in stature. Masruq ibn al Ajda said of him: Whenever I saw Ibn Abbas, I would say: He is the most handsome of men. When he spoke, I would say: He is the most eloquent of men. And when he held a conversation, I would say: He is the most knowledgeable of men. The Khalifah Umar ibn al-Khattab often sought his advice on important matters of state and described him as **the young man of maturity**. Sa’d ibn abi Waqqas described him with these words: **I have never seen someone who was quicker in understanding, who had more knowledge and greater wisdom than Ibn Abbas.** I have seen Umar summon him to discuss difficult problems in the presence of veterans of Badr from among the Muhajirin and Ansar. Ibn Abbas would speak and Umar would not disregard what he had to say. **It is these qualities which resulted in Abdullah ibn Abbas being known as the learned man of this Ummah.**",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "The teacher",
            "text": "Abdullah ibn Abbas was not content to accumulate knowledge. He felt he had a duty to the ummah to educate those in search of knowledge and the general masses of the Muslim community. He turned to teaching and his house became a university - yes, a university in the full sense of the word, a university with specialized teaching but with the difference that there was only one teacher Abdullah ibn Abbas. There was an enthusiastic response to Abdullah's classes. One of his companions described a typical scene in front of his house: I saw people converging on the roads leading to his house until there was hardly any room in front of his house. I went in and told him about the crowds of people at his door and he said: Get me water for wudu. He performed wudu and, seating himself, said: Go out and say to them: Whoever wants to ask about the Quran and its letters (pronunciation) let him enter. This I did and people entered until the house was filled. Whatever he was asked, Abdullah was able to elucidate and even provide additional information to what was asked. Then (to his students) he said: Make way for your brothers. Then to me he said: Go out and say: Who wants to ask about the Quran and its interpretation, let him enter. Again the house was filled and Abdullah elucidated and provided more information than what was requested. And so it continued with groups of people coming in to discuss fiqh (jurisprudence), 6 halal and haram (the lawful and the prohibited in Islam), inheritance laws, Arabic language, poetry and etymology. To avoid congestion with many groups of people coming to discuss various subjects on a single day, Abdullah decided to devote one day exclusively for a particular discipline. On one day, only the exegesis of the Quran would be taught while on another day only fiqh (jurisprudence). The maghazi or campaigns of the Prophet (ﷺ), poetry, Arab history before Islam were each allocated a special day. Abdullah ibn Abbas brought to his teaching a powerful memory and a formidable intellect. His explanations were precise, clear and logical. His arguments were persuasive and supported by pertinent textual evidence and historical facts.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 1",
            "text": "Ibn ‘Abbās narrated: When the Haruriyyah (the Khawarij) rebelled, they isolated themselves in a place. There were 6000 of them and they were united in rebelling against  Ali. Continuously people would come to Ali and say, Oh Leader of the Believers, verily these people are rebelling against you.  He would reply, Leave them, verily I will not fight them until they fight me and that is what they will do. So when it came to that day, I came to ‘Ali before the noon prayer and I said to him, Oh Leader of the Believers, delay the prayer until it is cooler perhaps I will speak to these people. He said: Verily, I fear for you. I said, Never! I used to be known as a man of good manners, I never harmed anyone. He gave me permission to go. So, I put on a very nice garment, the best of what one could get from Yemen and I combed my hair. Then, I visited them at midday while they were eating. I had entered upon a people, the likes of whom I had never seen with regards to their exertion in worship. Their foreheads were wounded due to (constant) prostration (in prayer) and their hands had become rough like camels' feet, wearing recently washed, untidy shirts with very high raised clothing and with tired and worn out faces [due to not caring for themselves]. So, I greeted them and they said, “Welcome, oh son of Abbās! And what is this cloak you are wearing?” I asked, “What deficiency do you see from me? Indeed, I saw the messenger of Allah  (dressed in the best of what you can find in Yemeni clothing, then I recited this verse Say, **Who has forbidden the adornment of Allah which He has produced for His servants and the good things of provision?** [Surah al-A’raf 7:32] Then they asked,  What has brought you here? I told them, I have come to you from amongst the companions of the prophet (ﷺ) – ( the Muhajirun and the Ansar and from the son of the uncle of the prophet (ﷺ) (Alī), who is his son-in-law. And upon them descended the Quran; they are more knowledgeable about it than you and there is not one of them (the companions) amongst you. I have come to convey to you what they say, and to convey to them what you say.” A group amongst them said, “Do not debate with the Quraysh because verily Allah,  says: **Nay! But they are a quarrelsome people.** [Surah al-Zukhruf, 43:58]",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹Taken from al-Silsilah al-Sahihah (5/12-13) by al-Albani and Munazzarat a’immat al-Salaf, p.89-91."
                   
                }
                
            ]
        },
        {
            "id": 7,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 2",
            "text": "So I said, Come forward, what is the grudge you have against the companions of the Allah’s messenger and the son of his uncle (Ali)? They answered, Three points. I asked, “And what are they? They said, “One of the points is that he (‘Alī) had men judge in a matter of Allah while Allah says: **The judgment is for none but Allah.** [Sūrah al-Anā’m, 6:57 and Sūrah Yūsuf, 12:40, 67] What have men got to do with the judgment? I said, This is one point.  They said, As for the second point, then he fought and he did not take captives nor did he take the war booty. If they were disbelievers, then their captives are permissible for us and if they were believers then their captives are neither permissible to take nor was it allowed to fight them (in the first place).” I said, This is the second point, and what is the third point? Or he said something similar. They said, He should remove the title of  Leader of the Believers (Amīr al-Mu’minīn) and if he is not the ‘Leader of the Believers’ then he is the Leader of the Disbelievers’ (Amir al-Kafirin). I asked, Do you have any points other than these? They replied, “These are sufficient for us.” I said to them, “Do you understand that if I read to you from the book of Allah ( and from the Sunnah of His prophet (ﷺ) ( that which refutes what you say, will you then return (back)? They said, Yes. I said: As for your statement that  Ali had men judge in a matter that was for Allah; then I will read to you from the book of Allah, where Allah has delegated His judgment to men regarding the eighth of a quarter of a dirham. Allah (commanded the people to judge in this matter. Do you not understand the saying of Allah ta’ala: **Oh you who believe, do not kill the game while you are in a state of Iḥrām, and whosoever of you kills it intentionally, then the penalty is an offering equivalent to the one he killed, as judged by two just men among you.** [Surah al-Ma`idah, 5:95] And it is from the judgment of Allah that He delegated men to judge in this matter. If Allah willed, He could have judged in this matter but He allowed men to judge. I ask you by Allah, is it better that men judge in something regarding reconciliation in disputes and in preventing bloodshed or regarding the hunting of a rabbit?” They said, “Of course, this is better.” “And regarding a woman and her husband (Allah says): If you fear a breach between the husband and wife, appoint two arbitrators: one from his family and the other from hers. [Surah al-Nisa’, 4:35]",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 3",
            "text": "Is not men judging in reconciling disputes and in the prevention of bloodshed better than men judging regarding the private parts of a woman? Have we finished with this point?” They replied, “Yes.” I said, “As for your statement, ‘He fought but did not take captives and did not take war booty,’ then would you take your mother (in Islam), Ā’ishah, as a captive, making her permissible for yourselves for that which you make permissible from other than her while she is your mother? If you say, ‘We make permissible from her that which we make permissible from other than her,’ then you have committed disbelief. And if you say, “She is not our mother,” then you have also committed disbelief: **The prophet is closer to the believers than their own selves, and his wives are their mothers** [Sūrah al-Aḥzāb, 33:6] “And so you are between the two ill judgments. So, which of them do you want to take? Have we finished with this point?” They replied, “Yes. “As for ‘Alī removing the title of ‘Leader of Believers’, then I will give you something that will please you; verily, the prophet of Allah contracted an agreement with the Mushrikin (the disbelievers of Quraysh) on the Day of Hudaybiyyah, and the prophet (ﷺ)  said to ‘Ali:**Write, oh ‘Ali: This is what Muhammad, the messenger of Allah, agrees with.** They, the Mushrikīn, said, ‘If we knew you to be the messenger of Allah, we would not have fought you.’ So the messenger of Allah (ﷺ) said: **Oh Allah, indeed You know that I am Your messenger. Erase it, ‘Alī, and write: This is what Muhammad Ibn ‘Abd Allah agrees upon.** I swear by Allah that the messenger of Allah (ﷺ)  is better than Alī and even he erased his own name, and erasing his name does not erase his prophet-hood. Have we finished with this point?” They said, “Yes.” So 2,000 of them came back while the rest of them rebelled and fought, based upon their misguidance, and the Muhājirūn and Anṣār fought them.²",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "²(Recorded by ‘Abd al-Razzaq in his book: al-Mussannaf (18678), Ahmad (1/243), al-Hakim (2/150-152), Ibn Abd al-Barr in his Jam' Bayan ‘Ulum (2/962-964/ 1834) and others.)"
                   
                }
            ]
        }
    ]
}
