{
    "id": "12",
    "author": "Darul-Asar",
    "category": "Sirah",
    "published": "2023",
    "lang": "En",
    "title": "Abdullah Ibn Abbas",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FAbdullah%20ibn%20Abbas.png?alt=media&token=5c0934ef-0753-476b-9d3f-d1dfd3a00699&_gl=1*1rq9k15*_ga*MzA4Njc3ODEyLjE2OTgyOTc2OTA.*_ga_CW55HF8NVT*MTY5OTI4OTM0MC4xOC4xLjE2OTkyODk3NzUuMzEuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Abdullah Ibn Abbas",
            "text": "Abu Al-Abbas Abdullah, Ibn Al-Abbas bin Abdul Muttalib Shaybah bin Hashim Al-Qurashi Al-Hashimi Al-Makki, Abbas was an uncle of the noble Prophet (ﷺ). He was born just three years before the Hijrah, when the prophet passed away he was only 10 years old, but despite this, this did not prevent him from acquiring enormous knowledge and wisdom at such an early age. His mother was Lubabah bint al-Harith ibn Hazan ibn Bajiyyah ibn al-Hazam ibn Rubiyyah ibn ‘Abdillah ibn Hilal ibn ‘Amir ibn Sa‘sa‘ah al-Hilali.  He was called the scholar (al-habr) and the ocean (al-bahr), because of his abundant knowledge and his deep understanding of subtle issues. He was the scholar and faqih of the ummah, the spokesman of the tribe, a brilliant reflection of prophethood, the one for whom the Prophet (blessings and peace of Allah be upon him) prayed that he would have deep understanding of the faith and of the Quran, thus he was known as the interpreter of the Quran. He was born when Banu Hashim were in the gully, three years before the Hijrah; it was also said that it was five years before that, but the former view is more sound, and it is closer to what is narrated from him in as-Sahihayn: I was going about some errands, riding a female donkey – and at that time I had just reached the age of puberty – and the Messenger of Allah (blessings and peace of Allah be upon him) was praying in Mina, not facing towards any wall. I passed in front of part of the row, then I let the donkey loose so that it could graze, and I joined the row, and he did not object to me doing that. Narrated by al-Bukhari (76) and Muslim (504). In Sahih al-Bukhari (6299) it is narrated that Sa‘id ibn Jubayr said: Ibn ‘Abbas was asked: What age were you when the Prophet (blessings and peace of Allah be upon him) died? He said: At that time I was circumcised. He (the narrator) said: They used not to circumcise a boy until he reached puberty. In Musnad Ahmad (3125) it is narrated from Sa‘id ibn Jubayr, from Ibn ‘Abbas, that he said: I learned al-Muhkam [surahs in which nothing is abrogated] at the time of the Messenger of Allah (blessings and peace of Allah be upon him), and when the Prophet (blessings and peace of Allah be upon him) died, I was ten years old. He (the narrator) said: I said to him: What is al-Muhkam? He said: al-Mufassal [ the surahs from al-Hujurat to the end of the Quran]. Al-Arnaut said: Its isnad is sahih according to the conditions of al-Bukhari and Muslim. The Prophet (blessings and peace of Allah be upon him) prayed for him, asking Allah to grant him deep understanding of religion and to teach him the interpretation of the Quran (tafsir). He said: **O Allah, grant him deep understanding of the faith and teach him the interpretation of the Quran¹.** He also asked Allah to teach him wisdom. It was narrated from ‘Ikrimah that Ibn ‘Abbas said: The Prophet (blessings and peace of Allah be upon him) embraced me and said: **O Allah, teach him wisdom².**",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F01.mp3?alt=media&token=3906323e-932c-4898-9696-7c0d304d83b0",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹(Narrated by al-Bukhari (143), Muslim (2477), and Ahmad (2397)"
                   
                },
                {
                    "source": "²(Narrated by al-Bukhari 3756)"
                   
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "The impact of the Prophet’s supplication for ‘Abdullah ibn ‘Abbas",
            "text": "Undoubtedly the supplication of the Prophet (blessings and peace of Allah be upon him) for ‘Abdullah ibn ‘Abbas (may Allah be pleased with him), asking Allah to teach him wisdom, understanding of the faith and the interpretation of the Quran, had a great impact on Ibn ‘Abbas (may Allah be pleased with him) in forming his character, in terms of faith, knowledge and ethics, and his keenness to seek knowledge and develop good understanding of the knowledge he acquired. Ibn ‘Abbas (may Allah be pleased with him) did not rely only on the supplication of the Prophet (blessings and peace of Allah be upon him) for him; rather he strove hard to accumulate and attain knowledge and to understand the religion of Allah, may He be glorified and exalted, with all that he had of strength, energy, patience and resolve. He began by staying close to the Prophet (blessings and peace of Allah be upon him) from a very early age, until the Messenger of Allah (blessings and peace of Allah be upon him) died.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F02.mp3?alt=media&token=29440edf-5e6a-4ca6-a659-e539d4883283",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "His desire to acquire knowledge",
            "text": "It was narrated from ‘Abdullah ibn ‘Abbas (may Allah be pleased with him): When the Prophet (blessings and peace of Allah be upon him) died, I said to one of the Ansar: Let us go and ask the Companions of the Prophet (blessings and peace of Allah be upon him) about the sayings of the Messenger of Allah (blessings and peace of Allah be upon him), for they are many [and this is an opportunity to learn]. The man said: I am astonished at you, O Ibn ‘Abbas. Do you think that people will need you, when there are still on earth what you see of the Companions of the Messenger of Allah? So he did not like the idea, but I devoted myself to acquiring knowledge and seeking out the Companions of the Prophet (blessings and peace of Allah be upon him), one after another, in order to learn from them. Sometimes I would hear that a man had heard some saying from the Messenger of Allah, so I would go to his house to ask him, but he would be having a siesta. So I would turn my rida (upper garment) into a pillow and rest at his door, with the wind blowing in my face, until he came out. He would say: What brings you here, O cousin of the Messenger of Allah? I would say: I have heard that you narrate something from the Prophet (blessings and peace of Allah be upon him), and I wanted to hear it from you. He would say: Why did you not send for me so that I could come to you? And I would say: It is more appropriate for me to come to you. That [Ansari] man would pass by me later on, and would see the people asking me questions, and he would say: You were wiser than me.¹",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F03.mp3?alt=media&token=3e133ce0-b759-4dd1-9c6b-060434d342d0",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹(Narrated by Imam Ahmad in Fadail as-Sahabah (2/976) (1925); ad-Darimi (590); and by al-Hakim in al-Mustadrak (363) – he said: It is sahih according to the conditions of al-Bukhari, and this report is usually quoted in the context of seeking hadiths and showing respect to the muhaddith. And adh-Dhahabi agreed with him.)"
                   
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "Modesty of Abdullah Ibn Abbas",
            "text": "During the lifetime of the Prophet (ﷺ), Abdullah would not miss any of his assemblies and he would commit to memory whatever he said. After the Prophet (ﷺ) passed away, he would take care to go to as many companions as possible especially those who knew the Prophet (ﷺ), longer and learn from them what the Prophet (ﷺ), had taught them. Whenever he heard that someone knew a hadith of the Prophet which he did not know he would go quickly to him and record it. He would subject whatever he heard to close scrutiny and check it against other reports. He would go to as many as thirty companions to verify a single matter. Abdullah described what he once did on hearing that a companion of the Prophet (ﷺ) knew a hadith unknown to him: I went to him during the time of the afternoon siesta and spread my cloak in front of his door. The wind blew dust on me (as I sat waiting for him). If I wished I could have sought his permission to enter and he would certainly have given me permission. But I preferred to wait on him so that he could be completely refreshed. Coming out of his house and seeing me in that condition he said: O cousin of the Prophet(ﷺ)! What's the matter with you? If you had sent for me I would have come to you. I am the one who should come to you, for knowledge is sought, it does not just come, I said. I asked him about the hadith and learnt from him. In this way, the dedicated Abdullah would ask, and ask, and go on asking. And he would sift and scrutinize the information he had collected with his keen and meticulous mind. It was not only in the collection of hadith that Abdullah specialized. He devoted himself to acquiring knowledge in a wide variety of fields. He had a special admiration for persons like Zayd ibn Thabit, the recorder of the revelation, the leading judge and mufti in Madinah, an expert in the laws of inheritance and in reading the Quran. When Zayd intended to go on a trip, the young Abdullah would stand humbly at his side and taking hold of the reins of his mount would adopt the attitude of a humble servant in the presence of his master. Zayd would say to him: Don't, O cousin of the Prophet(ﷺ). Thus we were commanded to treat the learned ones among us, Abdullah would say. And Zayd would say to him in turn: Let me see your hand. Abdullah would stretch out his hand. Zayd, taking it, would kiss it and say: Thus we were commanded to treat the ahl al-bayt members of the household of the Prophet (ﷺ).",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F04.mp3?alt=media&token=739fa93a-3ef4-4163-81ec-57dea47e16d1",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "The learned man of this Ummah",
            "text": "As Abdullah's knowledge grew, he grew in stature. Masruq ibn al Ajda said of him: Whenever I saw Ibn Abbas, I would say: He is the most handsome of men. When he spoke, I would say: He is the most eloquent of men. And when he held a conversation, I would say: He is the most knowledgeable of men. The Khalifah Umar ibn al-Khattab often sought his advice on important matters of state and described him as **the young man of maturity**. Sa’d ibn abi Waqqas described him with these words: **I have never seen someone who was quicker in understanding, who had more knowledge and greater wisdom than Ibn Abbas.** I have seen Umar summon him to discuss difficult problems in the presence of participants of Badr from among the Muhajirin and Ansar. Ibn Abbas would speak and Umar would not disregard what he had to say. **It is these qualities which resulted in Abdullah ibn Abbas being known as the learned man of this Ummah.**",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F05.mp3?alt=media&token=ec021657-4cd0-4d71-88a9-723cb6749e61",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "The teacher",
            "text": "Abdullah ibn Abbas was not content to accumulate knowledge. He felt he had a duty to the ummah to educate those in search of knowledge and the general masses of the Muslim community. He turned to teaching and his house became a university - yes, a university in the full sense of the word, a university with specialized teaching but with the difference that there was only one teacher Abdullah ibn Abbas. There was an enthusiastic response to Abdullah's classes. One of his companions described a typical scene in front of his house: I saw people converging on the roads leading to his house until there was hardly any room in front of his house. I went in and told him about the crowds of people at his door and he said: Get me water for wudu. He performed wudu and, seating himself, said: Go out and say to them: Whoever wants to ask about the Quran and its letters (pronunciation) let him enter. This I did and people entered until the house was filled. Whatever he was asked, Abdullah was able to elucidate and even provide additional information to what was asked. Then (to his students) he said: Make way for your brothers. Then to me he said: Go out and say: Who wants to ask about the Quran and its interpretation, let him enter. Again the house was filled and Abdullah elucidated and provided more information than what was requested. And so it continued with groups of people coming in to discuss fiqh (jurisprudence), 6 halal and haram (the lawful and the prohibited in Islam), inheritance laws, Arabic language, poetry and etymology. To avoid congestion with many groups of people coming to discuss various subjects on a single day, Abdullah decided to devote one day exclusively for a particular discipline. On one day, only the exegesis of the Quran would be taught while on another day only fiqh (jurisprudence). The maghazi or campaigns of the Prophet (ﷺ), poetry, Arab history before Islam were each allocated a special day. Abdullah ibn Abbas brought to his teaching a powerful memory and a formidable intellect. His explanations were precise, clear and logical. His arguments were persuasive and supported by pertinent textual evidence and historical facts.",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F06.mp3?alt=media&token=5ca01117-c807-4368-8939-96c21a94f9a2",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 1",
            "text": "Ibn ‘Abbās narrated: When the Haruriyyah (the Khawarij) rebelled, they isolated themselves in a place. There were 6000 of them and they were united in rebelling against  Ali. Continuously people would come to Ali and say, Oh Leader of the Believers, verily these people are rebelling against you.  He would reply, Leave them, verily I will not fight them until they fight me and that is what they will do. So when it came to that day, I came to ‘Ali before the noon prayer and I said to him, Oh Leader of the Believers, delay the prayer until it is cooler perhaps I will speak to these people. He said: Verily, I fear for you. I said, Never! I used to be known as a man of good manners, I never harmed anyone. He gave me permission to go. So, I put on a very nice garment, the best of what one could get from Yemen and I combed my hair. Then, I visited them at midday while they were eating. I had entered upon a people, the likes of whom I had never seen with regards to their exertion in worship. Their foreheads were wounded due to (constant) prostration (in prayer) and their hands had become rough like camels' feet, wearing recently washed, untidy shirts with very high raised clothing and with tired and worn out faces [due to not caring for themselves]. So, I greeted them and they said, “Welcome, oh son of Abbās! And what is this cloak you are wearing?” I asked, “What deficiency do you see from me? Indeed, I saw the messenger of Allah  (dressed in the best of what you can find in Yemeni clothing, then I recited this verse Say, **Who has forbidden the adornment of Allah which He has produced for His servants and the good things of provision?** [Surah al-A’raf 7:32] Then they asked,  What has brought you here? I told them, I have come to you from amongst the companions of the prophet (ﷺ) – ( the Muhajirun and the Ansar and from the son of the uncle of the prophet (ﷺ) (Alī), who is his son-in-law. And upon them descended the Quran; they are more knowledgeable about it than you and there is not one of them (the companions) amongst you. I have come to convey to you what they say, and to convey to them what you say.” A group amongst them said, “Do not debate with the Quraysh because verily Allah,  says: **Nay! But they are a quarrelsome people.** [Surah al-Zukhruf, 43:58]",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F07.mp3?alt=media&token=288a1e38-d334-4f5e-a52e-1b70dab5ad01",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "¹Taken from al-Silsilah al-Sahihah (5/12-13) by al-Albani and Munazzarat a’immat al-Salaf, p.89-91."
                   
                }
                
            ]
        },
        {
            "id": 8,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 2",
            "text": "So I said, Come forward, what is the grudge you have against the companions of the Allah’s messenger and the son of his uncle (Ali)? They answered, Three points. I asked, “And what are they? They said, “One of the points is that he (‘Alī) had men judge in a matter of Allah while Allah says: **The judgment is for none but Allah.** [Sūrah al-Anā’m, 6:57 and Sūrah Yūsuf, 12:40, 67] What have men got to do with the judgment? I said, This is one point.  They said, As for the second point, then he fought and he did not take captives nor did he take the war booty. If they were disbelievers, then their captives are permissible for us and if they were believers then their captives are neither permissible to take nor was it allowed to fight them (in the first place).” I said, This is the second point, and what is the third point? Or he said something similar. They said, He should remove the title of  Leader of the Believers (Amīr al-Mu’minīn) and if he is not the ‘Leader of the Believers’ then he is the Leader of the Disbelievers’ (Amir al-Kafirin). I asked, Do you have any points other than these? They replied, “These are sufficient for us.” I said to them, “Do you understand that if I read to you from the book of Allah ( and from the Sunnah of His prophet (ﷺ) ( that which refutes what you say, will you then return (back)? They said, Yes. I said: As for your statement that  Ali had men judge in a matter that was for Allah; then I will read to you from the book of Allah, where Allah has delegated His judgment to men regarding the eighth of a quarter of a dirham. Allah (commanded the people to judge in this matter. Do you not understand the saying of Allah ta’ala: **Oh you who believe, do not kill the game while you are in a state of Iḥrām, and whosoever of you kills it intentionally, then the penalty is an offering equivalent to the one he killed, as judged by two just men among you.** [Surah al-Ma`idah, 5:95] And it is from the judgment of Allah that He delegated men to judge in this matter. If Allah willed, He could have judged in this matter but He allowed men to judge. I ask you by Allah, is it better that men judge in something regarding reconciliation in disputes and in preventing bloodshed or regarding the hunting of a rabbit?” They said, “Of course, this is better.” “And regarding a woman and her husband (Allah says): If you fear a breach between the husband and wife, appoint two arbitrators: one from his family and the other from hers. [Surah al-Nisa’, 4:35]",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F08.mp3?alt=media&token=b91a2ce4-85db-4e67-980a-532e2fd4e273",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": ""
                   
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "The Great Debate of Ibn Abbаs with the Khawаrij - 3",
            "text": "Is not men judging in reconciling disputes and in the prevention of bloodshed better than men judging regarding the private parts of a woman? Have we finished with this point?” They replied, “Yes.” I said, “As for your statement, ‘He fought but did not take captives and did not take war booty,’ then would you take your mother (in Islam), Ā’ishah, as a captive, making her permissible for yourselves for that which you make permissible from other than her while she is your mother? If you say, ‘We make permissible from her that which we make permissible from other than her,’ then you have committed disbelief. And if you say, “She is not our mother,” then you have also committed disbelief: **The prophet is closer to the believers than their own selves, and his wives are their mothers** [Sūrah al-Aḥzāb, 33:6] “And so you are between the two ill judgments. So, which of them do you want to take? Have we finished with this point?” They replied, “Yes. “As for ‘Alī removing the title of ‘Leader of Believers’, then I will give you something that will please you; verily, the prophet of Allah contracted an agreement with the Mushrikin (the disbelievers of Quraysh) on the Day of Hudaybiyyah, and the prophet (ﷺ)  said to ‘Ali:**Write, oh ‘Ali: This is what Muhammad, the messenger of Allah, agrees with.** They, the Mushrikīn, said, ‘If we knew you to be the messenger of Allah, we would not have fought you.’ So the messenger of Allah (ﷺ) said: **Oh Allah, indeed You know that I am Your messenger. Erase it, ‘Alī, and write: This is what Muhammad Ibn ‘Abd Allah agrees upon.** I swear by Allah that the messenger of Allah (ﷺ)  is better than Alī and even he erased his own name, and erasing his name does not erase his prophet-hood. Have we finished with this point?” They said, “Yes.” So 2,000 of them came back while the rest of them rebelled and fought, based upon their misguidance, and the Muhājirūn and Anṣār fought them.²",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F09.mp3?alt=media&token=e60ce2e5-afba-4499-b677-2d20f1d4ea59",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "²(Recorded by ‘Abd al-Razzaq in his book: al-Mussannaf (18678), Ahmad (1/243), al-Hakim (2/150-152), Ibn Abd al-Barr in his Jam' Bayan ‘Ulum (2/962-964/ 1834) and others.)"
                   
                }
            ]
        },
        {
            "id": 10,
            "subtitle": "Umar ibn al-Khattab would let him attend gatherings with the elders of the people of Badr",
            "text": "Umar ibn al-Khattab word bring him close to him and ask him questions, and he would let him attend gatherings with the elders of the people of Badr, to show them his knowledge and understanding. He would always have a ready answer and a radiant, handsome face. He had long hair dyed with henna; he was fair skinned and tall, with a yellowish complexion and a big build. His knowledge was abundant and many reports were narrated from him. An ignorant person would learn knowledge and wisdom from him, and a hungry person would have his fill of food and bread from him. He (may Allah be pleased with him) died in at-Taif in 68 AH. The scholars differed concerning his age; it was said that he was seventy-one years old, or seventy-two, or seventy-four. The first is the strongest view.²",
            "url": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/libaudios%2FAbdullah%20Ibn%20Abbas%2F10.mp3?alt=media&token=e65acac2-a7ec-416d-898b-a70b8eb57785",
            "isAudioUrl": true,
            "sources": [
                {
                    "source": "²please see: Fadail as-Sahabah by Imam Ahmad (2/949); Ma‘rifat as-Sahabah by Abu Nu‘aym (3/1699); and al-Isabah by Ibn Hajar (4/122)"
                   
                }
            ]
        }
    ]
}
