{
    "id": "13",
    "author": "Islam forum",
    "category": "Fiqh",
    "published": "2023",
    "lang": "En",
    "title": "About that dua after the obligatory prayers is legal and has great dignity",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2Fabout_dua.png?alt=media&token=0c6a0c27-b7ca-41a8-a78d-9c22304d1393",
    "chapters": [
        {
            "id": 1,
            "subtitle": "About supplication after obligatory prayers",
            "text": "Praise be to Allah, the Lord of the worlds, peace and blessings of Allah be upon our prophet Muhammad, members of his family and all his companions! And then: Truly, supplication (ad-du'a) occupies a great position in Islam, for it is a means of approaching Allah Almighty and the greatest form of worship of Him, which includes the manifestation of all types of monotheism! According to an-Nu'man ibn Bashir (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: **Verily, supplication is worship,** after which he read the following verse of the Quran: **And your Lord said: Invoke Me, I will respond to your (invocation). Verily! Those who scorn My worship they will surely enter Hell in humiliation!** (40:60). Abu Daud (1479), at-Tirmidhi (2969, 3372), Ibn Majah (3828). Imam at-Tirmidhi, Hafiz Ibn Hajar, Sheikh al-Albani confirmed the authenticity of the hadith. See “Fathul-Bari” (1/64), “Sahih at-Targib” (1627). And Ibn ‘Abbas (may Allah be pleased with him) said: “The best worship is prayer.” al-Hakim (1/491). Sheikh al-Albani called this message good. See “as-Silsila as-sahiha” (1579). And the Shariah of Allah Almighty has established various etiquettes for supplication, as well as times and situations during which supplication has the greatest chance of receiving an answer from the Almighty. With the permission of Allah Almighty, in this article I would like to consider two questions that many Muslims often ask. The first question: “Is it legal and desirable to turn to Allah with supplications after completing the obligatory prayer, or should we limit ourselves to supplications directly during the prayer itself?” Second question: “If it is legal and desirable to turn to Allah with prayers after the obligatory prayer, then is it permissible to raise your hands at the same time?” It should be noted that some scholars have considered that turning to Allah with a prayer is legalized before salam during tashahhud directly in the prayer itself, and not after it. Whereas after salam it is legal to remember Allah (dhikr). In this they relied on the words of Sheikh-ul-Islam Ibn Taymiyya. And whoever believed that supplication after obligatory prayers was not legalized naturally automatically believed that supplication after obligatory prayer with raising of hands was not legalized, even less so. With the permission of Allah Almighty, I would like to briefly highlight these issues in more detail, citing all the arguments and opinions of scientists on this matter.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
            {
            "source": ""
            }
            ]
            },
        {
            "id": 2,
            "subtitle": "The time after obligatory prayer is one of the good periods for prayer",
            "text": "Abu Umama (may Allah be pleased with him) said: “When the Messenger of Allah (peace and blessings of Allah be upon him) was asked: “Which supplication most deserves to be heard?”, he replied: **The one made in the last part of the night and after obligatory prayers**. at-Tirmidhi (3499), an-Nasai in “al-Kubra” (108), al-Bayhaqi in “ad-Da’awat” (2/238). The hadith is authentic¹. On the authenticity of the hadith from Abu Umama As for the claims to this hadith, those who want to weaken it rely on the words of Imam Ibn Ma’in, who said that the transmitter ‘Abdur-Rahman ibn Sabit, who transmitted this hadith from Abu Umama, did not hear from him. See “Tarikh Ibn Ma'in” (3/87). For this reason, this hadith was weakened by Hafiz Ibn al-Qattan, who said: “Know that the transmission of Ibn Thabit from Abu Umama is interrupted, for he did not hear from him.” See “Bayan al-wahm” (2/385). He was also weakened in one of his opinions by Hafiz Ibn Hajar, who objected to the assessment of Imam at-Tirmidhi, who called this hadith good, saying: “There is doubt in what he said, since this hadith has shortcomings: The first of them is an interrupted isnad. Al-‘Abbas ad-Duri reported the following from Yahya ibn Ma’in in his book “at-Tarikh”: “I did not hear ‘Abdur-Rahman ibn Thabit from Abu Umama hadith.” The second is that Ibn Jurayj (who was a Mudallis) did not convey this hadith in an affirmative form (‘an’ana). ”Third, this version of the hadith is rejected, because five students of Abu Umama conveyed the basis of this hadith with mention of only its first part (about the last part of the night).” See “Nataij al-afkar” (2/247). Sheikh Muqbil ibn Hadi said: “If you look at the isnad of this hadith, you will find that all its narrators are the narrators of al-Sahih. However, in the book “Tahzib at-tahzib” it is reported from the words of Yahya ibn Ma’in that ‘Abdur-Rahman ibn Thabit did not hear from Abu Umama.” See “Ahadith mu’alla” (180). By the way, it should be noted that Hafiz Ibn Hajar himself in his three other books leans towards the authenticity of this hadith, which, with the permission of Allah, will be mentioned in more detail.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Sahih at-Targib” (1648). Supporters of the incompetence of turning to Allah with prayers after obligatory prayers had two claims to this hadith: its authenticity and its understanding."
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "1-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Firstly, with regard to the tadlis of Ibn Juraij, this is not a drawback in this case, for in the version of this hadith cited by 'Abdur-Razzaq (3948), Ibn Juraj conveys it in the affirmative, saying: “Abdur-Razzak told me Rahman ibn Thabit, what Abu Umama said.” Therefore, the fear of tadlis in this case is absolutely excluded, since Ibn Jurayj in this version conveys it in a form indicating that he heard these words personally. Secondly, regarding the words that this version of the hadith is rejected (shazz) and contradicts other versions that were transmitted from Abu Umama by his disciples, to this objection Sheikh Salim al-Hilali said: “As for the words that that this hadith is rejected, then this has no relation to the hadith under discussion, since we are talking about two completely different hadiths.” See “Tahrij al-Adhkar” (1/177). Those. the fact that other narrators from Abu Umama transmitted similar hadiths, which mention the virtue of prayer in the deep or last part of the night, is not a reason to consider the hadith under discussion rejected, for these are completely different hadiths. Thirdly, as for the fact that ‘Abdur-Rahman ibn Thabit did not hear the hadith from Abu Umama, then in reality this is the only good reason out of the three mentioned. To begin with, it should be noted that ‘Abdur-Rahman ibn Thabit is a reliable and truthful transmitter according to the unanimous opinion of the imams of the science of hadith “al-jarh wa-t’adil”. See “Tahzib al-Kamal” (17/123), “Tahzib al-Tahzib” (2/509). But at the same time, he did transmit some hadiths in the form of “mursal” both directly from the Prophet (peace and blessings of Allah be upon him) and from various companions. Al-‘Abbas al-Duri said: “They asked Yahya (Ibn Ma’in): “Did ‘Abdur-Rahman ibn Thabit hear from Sa’d ibn Abi Waqqas?” He replied: “No.” He was asked: “Did he hear from Abu Umama?” He replied: “No.” He was asked: “Have you heard from Jabir?” He replied: “No, his transmission is mursal.” Yahya’s madhhab regarding ‘Abdur-Rahman ibn Thabit was such that he transmitted from these companions in the form of mursal, and did not hear from them.” See “Tarikh Ibn Ma'in” (3/87). Hafiz Ibn Hajar said: “It was said that it is not established that Ibn Thabit heard from any of the Companions.” Then he quoted the mentioned words from Ibn Ma’in, and added: “But Ibn Thabit found these two (Abu Umama and Jabir), and he also has a transmission from Ibn ‘Abbas and ‘Aisha (may Allah be pleased with them).” See al-Isaba (8/337). As for the narration of Ibn Hajar that Ibn Thabit did not hear from any of the companions, as well as the words of Ibn Ma'in that he did not hear from Jabir, these statements refute the words of Imam Ibn Abi Hatim, who said: “The narration of Ibn Thabit from 'Umara is mursal (interrupted), and his transmission from Jabir ibn 'Abdullah is continuous (authentic). See “al-Jarh wa-ta'dil” (5/240). And since Hafiz Ibn Hajar admits the fact that Ibn Thabit found both Jabir and Abu Umama, then it is not excluded that he could have heard hadiths from Abu Umama, given that Abu Umama died later than Jabir. Indeed, according to various sources, the date of death of Jabir is either 73 AH or 78 AH, while Abu Umama, according to one version, died in 81 AH, and according to another in 86 AH, and about the second date because of its prevalence among historians, Ibn al-Barqi even said: “And there is no disagreement about this¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See al-Isaba (3/340)."
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "2-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Fourthly, this hadith has various supporting evidence: For example, a hadith narrated from the words of al-‘Irbad ibn Sariya (may Allah be pleased with him) that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever performs the obligatory prayer deserves a prayer that does not remain unanswered; and he who has completed the recitation of the entire Quran has earned a prayer that does not go unanswered.” at-Tabarani in “al-Kabir” (18/259). This hadith indicates that the completion of prayer is one of the good periods for turning to Allah with prayers. Commenting on this hadith, Hafiz al-Munawi said: “We are talking about supplication after completing the prayer.” See “at-Taysir” (2/428). However, this hadith was called weak by Hafiz al-Haythami and Sheikh al-Albani. See “Majma'u-zawaid” (7/172), “al-Silsila ad-da'ifa” (3014). But despite the fact that this hadith itself is weak due to the narrator named 'Abdul-Hamid ibn Suleiman, who was considered weak by such imams as Ibn al-Madini, Ibn Ma'in, al-Fasawi, Abu Dawud, Abu Zur'a, an-Nasai and ad-Darakutni, however, it is suitable as a “shahid”, that is, in the form of a confirming and reinforcing message. Also in the isnad of this hadith there is a transmitter named al-Fadl ibn Harun - the sheikh of Imam at-Tabarani, from whom he transmitted many hadiths in his collections. There is no known discredit or recognition of reliability about this transmitter, but Imam at-Tabarani said about him that he was a student of Imam Abu Saur, and Hafiz al-Khatib al-Baghdadi called him a faqih. See “Mu'jam al-kabir” (11/395), “Tarihu Baghdad” (12/372). Imam al-Dhahabi said about al-Fadl ibn Harun: “Faqih, student of Abu Saur. He transmitted hadiths from Dawud ibn Rashid, Muhammad ibn Abi Ma'shar and others, and from him the hadiths were transmitted by Abu Nu'aym ibn 'Adi and at-Tabarani. See Tarikh al-Islam (22/145). But still, the main reason for the weakening of this hadith is the weakness of ‘Abdul-Hamid ibn Suleiman. However, it is important to note that his weakness was not due to his wickedness, lies, etc. On the contrary, he was basically a truthful transmitter, but he made mistakes due to the fact that he was blind. Therefore, when Imam Ahmad was asked: “How do you like the hadiths of ‘Abdul-Hamid?”, he replied: “I don’t know. But I didn’t see any problems with him.” See “Tariha Baghdad” (12/372). Imam al-Bukhari said about him: “As for ‘Abdul-Hamid ibn Suleiman, he is truthful, but perhaps he made mistakes in some transmissions.” See “al-‘Ilal al-kabir” (264). Imam Ibn ‘Adi also made the following conclusion about him: “He is one of those whose hadiths can be written down.” See “al-Kamil” (6/7). Those. his hadiths can be considered as strengthening evidence. In a word, this hadith is suitable to strengthen the discussed hadith from Abu Umama, for which reason the authors of the famous fiqh encyclopedia cited this hadith among the arguments of the majority of scholars who considered it desirable to turn to Allah with prayers after the obligatory prayer. See “al-Mawsu’a al-fiqhiyya” (39/228). And by the way, although Sheikh al-Albani previously considered the discussed hadith from Abu Umama weak, in the new edition of his research on the book “Kalim at-Tayyib” by Sheikh-ul-Islam Ibn Taymiyyah, in the preface he mentioned some hadiths that he considered reliable in the old edition , but subsequently revised and leaned towards their weakness, after which Sheikh al-Albani said: “In contrast to these (weak) hadiths, Allah has made it easier for me to strengthen other hadiths, which I previously considered weak due to shortcomings in their isnads, like a gap and so on. And this was the case until I discovered something that strengthens these hadiths from among the evidence and other things,” after which he mentioned among these hadiths the discussed hadith from Abu Umama. See “Tahrij Kalim at-Tayeb” (page 5). Then in the same book, in a footnote to the hadith of Abu Umama, having mentioned that Imam at-Tirmidhi considered this hadith good, Sheikh al-Albani said: “He mentioned that this hadith has two amplifying transmissions. And he also has a third transmission, which is cited by Ibn Qani’ in “al-Mu’jam” from the words of Ka’b ibn ‘Ujra (may Allah be pleased with him)¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Tahrij Kalim at-Tayb” (114)."
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "3-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Also, the hadith from Abu Umama strengthens the interpretation of the following Quranic verse by the salaf led by the companions: **So when you have finished  devote yourself for Allâh’s worship** (94: 7). In this verse, Allah Almighty ordered, having completed an action related to this world or the eternal world, to strive to worship Him. In the interpretation of this verse, Ibn ‘Abbas (may Allah be pleased with him) said: “When you have completed the obligatory prayer, then turn to Allah with a prayer.” at-Tabari in “at-Tafsir” (24/496), Ibn Abi Hatim in “at-Tafsir” (19397). The message is good (hasan). See “as-Sahih al-masbur” (4/647), “Tafsir al-mamun” (8/489). And exactly the same interpretation regarding this verse is also transmitted from Ibn Mas'ud, Mujahid, Qatada, ad-Dahhak and Muqatil. See “Tafsir ‘Abd ar-Razzaq” (3645), “Tafsir at-Tabari” (24/496), “Zadul-masir” (4/462). This verse alone and the mentioned interpretation of the salaf led by the companions is enough to consider supplication after completing the prayer as a good and desirable act, not to mention the prophetic hadiths of this chapter! For this reason, having mentioned the strengthening evidence of the first part of the hadith from Abu Umama that the best supplication is the supplication in the dead of night, Sheikh 'Abdul-Qadir al-Arnaut regarding the second part of the hadith that the best supplication is also the supplication after the obligatory prayers , said: “And the second part is strengthened by general provisions containing great merits. After all, he who remembers Allah (after prayer) will rise from his place forgiven. Until the next prayer, he will remain under the protection of Allah Almighty. Even sins equal in quantity to the foam of the sea will be forgiven him. All this and other virtues indicate the honor of this time and the acceptance of prayer at this time.” See “Tahrij Jami' al-usul” (4/124). Fifthly, based on everything stated above, it becomes clear to us why the discussed hadith from Abu Umama was recognized as reliable by many possessors of knowledge and specialists in the science of hadith. As already mentioned, Imam Abu ‘Isa at-Tirmidhi called this hadith good. See “Sunan at-Tirmidhi” (5/526). Also, the following hafiz and scholars agreed with at-Tirmidhi’s assessment of this hadith: ad-Diya al-Maqdisi, al-Munziri, ‘Alyauddin Mughultai, Ibn Kathir, Ibn Rajab, al-Qastalyani, Ibn al-Mulyakqin, al-Shaukani, al-Mubarakfuri. See “al-Sunan wal-ahkam” (2/140), “at-Targib wa-ttarhib” (2/321), “al-I’lyam” (5/404), “Irshad al-faqih” ( 1/137), “al-Mawahib” (3/265), “Neil al-autar” (2/358), “Tuhfatul-ahuazi” (2/172). By the way, it should be noted that Hafiz Ibn Hajar himself in his book “Fath al-Bari” (11/143) agreed with Imam at-Tirmidhi’s assessment that this hadith is good (hasan). And in his other book “ad-Diraya” (1/225), Ibn Hajar said that all the transmitters of this hadith are reliable, without mentioning anything about its shortcomings. Moreover, in his third book “Hidayatu-rrua” (928), Ibn Hajar himself assessed this hadith as “hasan” (good), since he did not say anything about its authenticity, whereas in the preface of this book he wrote: “If I kept silent regarding the degree of authenticity of a hadith, which means it is good (hassan).” See “Hidayatu-rrua” (1/58). This hadith was also considered reliable by Hafiz ‘Abdul-Haqq al-Ishbili. See “al-Ahkam al-usta” (1/416). Imam al-Baghawi called him good. See Masabih al-Sunnah (1/361). Hafiz al-Nawawi considered this hadith authentic. See “Riyadh al-salihin” (1500), “al-Khulyasa” (1/465). Mullah ‘Ali al-Qari called this hadith authentic due to the evidence that strengthens it. See “Mirkatul-mafatih” (2/768). Sheikh al-Albani called this hadith authentic due to the evidence that strengthens it. See “Sahih at-Targib” (1648). Also, the reliability of this hadith was strengthened by Sheikh ‘Abdul-Qadir al-Arnaut and Sheikh Salim al-Hilyali. See “Tahrij Jami’ al-usul” (4/142), “Tahrij al-Adhkar” (1/177). Sheikh Muhammad al-Ityubi called the isnad of this hadith authentic. See “al-Bahr al-muhith al-sajaj” (15/632). Sheikh Muhammad Subhi Hallak called this hadith authentic. See “Tahkyk at-Takhyir” (4/20). Also, Sheikh ‘Abdur-Razzaq al-Badr, in his book on the provisions of adhkars and du’a, which Sheikh Ibn Baz approved and praised, called the isnad of this hadith excellent¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Fiqh al-ad’iya wal-azkar” (1/335)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "1-On understanding the hadith from Abu Umama",
            "text": "Абу Умама (да будет доволен им Аллаха) сказал: «Когда Посланника Аллаха (мир ему и благословение Аллаха) спросил: «Какая молба наиболее удачно будет избранной?», он ответил: «Та, с которыми обращаются ни в какой части ночи и после обязательных». молитва»». ат-Тирмизи (3499), ан-Насаи в «Аль-Кубра» (108), аль-Байхакъи в «ад-Даауат» (2/238). Хадис достоверный. См. «Аль-Ахкам аль-Уста» (1/416), «Масабих ас-Сунна» (1/361), «Сахих ат-Таргъиб» (1648), «Аль-Бахр аль-Мухит ас-Саджадж» (15/ 632). Убедившись в том, что данный хадис является достоверным, а его смысл имеет основу, хотелось бы более подробно остановиться на том, о каком именно периоде в нем идет речь: о мольбе после салама, или же о мольбе до салама во время ташаххуда? В данном хадисе упоминается выражение: «бурдубур ас-саля», что может нести два значения: «сразу после молитвы» и «в конце молитвы». Шейхуль-Ислям Ибн Таймия сказал: «Что касается хадиса от Абу Умамы, то обязательно не уточнять этого молбой лишь после салама, напротив, необходимо отнести это к мольбам до салама. А если будет сказано, что этот хадис противоречит как то, что до салама, так и то, что после салама, то из этого не следует, что мольба имама и молившиеся идут за ним, совместно после салама является Сунной. Но если каждый из них будет обращаться с мольбоем после салама по отдельности, то это не будет противоречить Сунне». См. «Аль-Фатауа аль-Кубра» (2/210). Также имам Ибн Таймия сказал: «Общеизвестно, что мольба является дозволенной, как во время совершенства молитвы, так и вне молитвы. Но большинство мольб, начальствующих от Пророка (мир ему и благословение Аллаха), произнесли их в конце молитвы перед саламом. В хадисе сообщается: «Наилучшая мольба – это мольба в последнюю часть ночи и после обязательной молитвы». И становится ясно, что мольба в конце молитвы, особенно перед саламой, во время чего чаще всего вызывал Аллаху Пророка (мир ему и благословение Аллаха), ближе к принятию и получению ответа, чем в других молитвах-состояниях. Ведь это мольбой после того, как доведения поклонения дойдут до завершения». См. «Маджмууль-фатауа» (22/379). Также Ибн Таймия сказал: «Под мольбоем во время «дубур ас-саля» речь идет либо о последней части молитвы, что будет соответствовать прочим хадисам, либо речь идет о завершении молитвы после ташахахуда, либо речь идет в общем виде. В любом случае невозможно уточнить это именно мольбами после саламы, так как все профессиональные пророчные мольбы произносились до саламы. И нельзя узаконивать Сунну на основании обобщённого текста, который противоречит членам Комиссии Сунне и блестящим формулировкам». См. «Маджмууль-фатауа» (22/499). Также Ибн Таймия сказал: «Группа чисел, состоящих из аш-Шафи'и и других, считала желательным обращение с мольбами после обязательных пятикратных молитв. Но все они единодушны в том, что оставшийся эту мольбу не исключают порицания. И тот, кто делает это порицание, ошибается по единогласному мнению учёных. Ведь в данном положении это не является ни обязательным, ни желательным деянием. Тот, кто порицает оставившего мольбу после молитвы, сам по себе порицания. Более того, совершающий постоянно мольбу тоже достоин порицания, потому что, в конечном счете, постоянное совершение того, что не совершал постоянно Пророк (мир ему и благословение Аллаха) во время этой пятикратной молитвы, не является узаконенным, напротив, это порицаемо. Но если имамы и молившиеся сзади иногда обращаются к Аллаху с молитвами мольбами после молитвы по причине чего-то произошедшего, то это не будет противоречием Сунне в отличие от того, кто делает это постоянно». См. «Маджмууль-фатауа» (22/513-514). Также Ибн Таймия сказал: «Что касается совместного обращения с мольбами имамом и теми, кто молился за ним, то нет никаких сомнений в том, что Пророк (мир ему и благословение Аллаха) не совершал подобного после обязательных молитв. И если бы он так поступил, то его сподвижники передали бы это¹».",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. «Маджмууль-фатауа» (22/517)."
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "2-On understanding the hadith from Abu Umama",
            "text": "Ibn Taymiyyah also said: “As for the joint prayers of the imam and the worshipers following him after the obligatory prayer, this is an innovation that did not exist during the time of the Prophet (peace and blessings of Allah be upon him). Truly, his prayer was during the prayer itself, because the one who prays is the one who turns to his next step, and if he turns to Him at that moment with a prayer, then this is an appropriate look. As for the supplication after the prayer is said, then the supplication is no longer appropriate, just as it is appropriate after the prayer to resume the adhkars that are criminal from the Prophet (peace and blessings of Allah be upon him), such as the words “la ilaha ill-Allah”, “alhamdu li-llah” ,Allahu Akbar. See Majmuul-Fataawa (22/519). From the quoted words of Imam Ibn Taymiyyah, we can conclude that his madhhab, according to recommendations, is compiled in the following order: - Congregational prayer after the obligatory prayers by the imam and those praying behind him is an innovation, except occasionally and on a specific occasion. - The appropriate and desirable time for prayer is the period of the prayer itself, especially its end before salam. - After completing the prayer, the name of Allah (dhikr) is legitimized, not the supplication. - Making a prayer after saying a prayer is not prohibited, but this is not established by the Solar. - It is impossible to clarify what is a Solar appeal to Allah with prayers after obligatory prayers, based on a popular saying like “dubur as-sala”, despite the fact that this expression is included in you, including in the period after the completion of the prayer. Imam Ibn al-Qayyim said: “As for the prayer (of the imam) after salam, continuing to sit towards the Kaaba or praying from behind, this was not fundamentally the way of the Prophet (peace and blessings of Allaah be upon him). And nothing is transmitted from him about this, neither with a reliable isnad, nor with a good one. As for the specification of morning prayer and afternoon prayer with supplications after their completion, this did not happen to either the Prophet (peace and blessings of Allah be upon him) or his caliphs, and he did not observe this community of his. Indeed, this is what was considered good ideas by some who came to contradict the Sunnah after him. And Allah knows this best. Most of the supplications associated with prayer, the Prophet (peace and blessings of Allah be upon him) said himself directly during the prayer itself and commanded to do so. And this is what corresponds to the position of the one praying, because he turned to his head, calling on Him, performing prayer. And when he completes the prayer and pronounces the words of salam, then this turning to the head and being in front of Him is interrupted. So how can you make an appeal to Allah with requests at the moment of approaching and turning to Him, and then ask Him after doing this?! There is no opinion that the opposite is correct for the person praying. However, there is a subtle point here, which consists in the fact that if the person praying completed the prayer, remembered Allah after it, glorified and exalted Him with legalized adhkars after the prayer, then it is desirable for him after this to pray for the Prophet (peace and blessings of Allah be upon him), and then I make any plea. Thus, his supplication will be after this second worship (remembering Allah and supplication for the Prophet), and not because he made a supplication precisely after completing the prayer. After all, everyone who remembers Allah and praises Him, and then turns to prayer for the Messenger of Allah (peace and blessings of Allah be upon him), then it is desirable for him, after that he turns to prayer for himself. And this is stated in the hadith from Fadali ibn Ubaydah that the Prophet (peace and blessings of Allaah be upon him) said: “When one of you prays, let him begin by praising his Great and Almighty head and glorifying Him, then let him invoke a blessing on the Prophet, and then call with any supplication that he wishes.” And at-Tirmidhi said: “This hadith is authentic.” See “Zadul-maad” (1/249). In this case, the madhhab of Imam Ibn al-Qayim for resolving the issue is identical to the madhhab of his sheikh, Ibn Taymiyyah. Then, further in the section on prophetic supplications, which are mentioned in the hadiths, that he said them at the end of the dubur as-sala prayer, mentioning one of the versions, Ibn al-Qayyim says: “Muslim gives two versions, in one of which It is said that the Prophet (peace and blessings of Allaah be upon him) said this prayer between tashahhud and salam, and this is the correct opinion, and in another version it is said that he said this prayer after salam. He probably said this prayer both times. And Allah knows this best¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Zadul-maad” (1/343)."
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "3-On understanding the hadith from Abu Umama",
            "text": "Then further, he cited the following hadith: From the words of Mu'az (may Allah be pleased with him) it is reported that one day the Messenger of Allah (peace and blessings of Allah be upon him) took his hand and said: “O Mu'az, I swear by Allah, verily, I love you, and I punish You, O Mu'az, should never forget to say after each prayer: “O Allah, help me to remember You, thank You and worship You properly!” Ahmad (6/244), Abu Dawood (1522), an-Nasai (1303). Hafiz an-Nawawi, Imam Ibn al-Qayim, Hafiz Ibn Kathir, Sheikh al-Albani confirmed the authenticity of the hadith. See “al-Khulyasa” (1/468), “‘Uddatu-sabirin” (1/224), “al-Bidaya wa-nnichaya” (7/108), “Sahih al-Jami’” (7969).\n اللَّهُمَّ ‌أَعِنِّي ‌عَلَى ‌ذِكْرِكَ، ‌وَشُكْرِكَ، ‌وَحُسْنِ ‌عِبَادَتِكَ \n /Allahumma, a’inni ‘ala zikrika, wa shukrika, wa husni ‘ibadatika/. After which Ibn al-Qayim says about this hadith: “The words “dubur as-sala” can refer to what is said both before salam and after salam. But our sheikh (Ibn Taymiyyah) considered it correct that we are talking about the period before salam. I contacted him again about this issue and he said: “When you say “dubur” about something, it refers to the thing itself, like the words “dubur al-hayuan”, which means “the tail of an animal.” See “Zadul-ma’ad” (1/353). By the way, the fact that Ibn al-Qayyim turned to Ibn Taymiyyah several times to clarify this issue indicates that he had doubts, because the opinion of his sheikh that all prophetic prayers are pronounced before salam did not align with direct and explicit hadiths, which mentioned that the Prophet (peace and blessings of Allah be upon him) said various prayers after salam. Therefore, in his other works, Imam Ibn al-Qayim spoke less categorically on this matter. For example, in his book on the provisions of prayer, he said: “Dubur al-sala is the last part of the prayer, like the back of an animal or the outermost part of a wall. But it can also mean the completion of the prayer due to evidence indicating this, such as the hadith: “Say “Subhan-Allah”, “alhamdu li-Llah”, “Allahu akbar” thirty-three times at the end of the prayer (dubur as-sala). And in this context, the word “dubur” refers to the complete completion of the prayer.” See “as-Sala” (1/378). As for some people who understood the words of Imam Ibn al-Qayim in such a way that he unequivocally forbade and condemned the utterance of prayers after obligatory prayers, then Hafiz Ibn Hajar said about this: “Many Hanbalites whom we met understood the meaning of Ibn’s words. al-Qayyim so that he completely denied the prayer after completing the prayer. But the situation is different. The essence of his words is that he denied the prayer (by the imam) after prayer, continuing to sit towards the Kaaba. But if he turned to those praying behind him, pronounced the legal adhkars, and then made a prayer, then in this case the prayer is not condemned by him.” See “Fathul-Bari” (11/134). By the way, it should be noted that Hafiz Ibn Hajar argued for the fallacy of some of the mentioned words of Imam Ibn al-Qayim on this issue in his book “Fathul-Bari” (11/134-135). And this remark of Ibn Hajar regarding the words of Ibn al-Qayim was considered excellent by Hafiz al-Qastalyani, who quoted the words of both, after which he agreed with Ibn Hajar. See al-Mawahib (3/264). So did Sheikh al-Mubarakfuri, who quoted the words of Ibn al-Qayyim and the remark of Ibn Hajar, after which he concluded: “There is no doubt that saying a prayer after completing the obligatory prayer is established by the Messenger of Allah (peace and blessings of Allah be upon him), both in words and deeds!” See “Tuhfatul-Ahuazi” (2/169). Similar to what Ibn Taymiyyah and Ibn al-Qayim expressed was said by Sheikh Ibn 'Usaymin, who, having mentioned the hadith of Abu Umama and his explanation that we are talking about a prayer after completing the prayer, said: “This understanding of this hadith is inaccurate, on the contrary, it is obligatory is to attribute its meaning to the fact that under the words “dubur as-sala” we are talking about the end of the prayer (before salam), and the argument for this is the hadith from Ibn Mas'ud, in which the Prophet (peace and blessings of Allah be upon him) commanded him after tashahhuda to turn to Allah with prayers. The Sunnah interprets itself. As for completing the prayer, Allah Almighty indicated to His servants that they should remember Him, saying: “When you complete the prayer, then remember Allah standing, sitting or lying on your sides!” (4: 103). And in this verse there is no command to make a prayer¹. So, the essence of the mentioned opinion is that all the hadiths that mention the supplication at the end of the dubur as-sala prayer, they are talking about supplication (ad-du'a) precisely during tashahhud before salam. And if we are talking about remembering Allah (az-dhikr), then we are talking about saying this after salam. And the following arguments were used as specific arguments: Allah Almighty said: “When you finish your prayer, remember Allah standing, sitting or lying on your sides!” (4: 103). This verse deals specifically with dhikr. According to Ibn Mas'ud (may Allah be pleased with him), it is reported that when the Messenger of Allah (peace and blessings of Allah be upon him) taught him the words “at-tahiyat,” he said: “After that, he can choose any prayer that he likes.” and turn to Allah. al-Bukhari (835), Muslim (402). They considered this hadith to specify the discussed hadith from Abu Umama and general hadiths that talk about prophetic prayers after prayers, that we are talking specifically about the prayer at the end of the prayer before salam, and not after salam.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See Sharh al-mumti' (3/203)."
                }
            ]
        }
    ]
}