{
    "id": "13",
    "author": "Islam forum",
    "category": "Fiqh",
    "published": "2023",
    "lang": "En",
    "title": "About that dua after the obligatory prayers is legal and has great dignity",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2Fabout_dua.png?alt=media&token=0c6a0c27-b7ca-41a8-a78d-9c22304d1393",
    "chapters": [
        {
            "id": 1,
            "subtitle": "About dua after obligatory prayers",
            "text": "Praise be to Allah, the Lord of the worlds, peace and blessings of Allah be upon our prophet Muhammad, members of his family and all his companions! And then: Truly, dua (ad-du'a) occupies a great position in Islam, for it is a means of approaching Allah Almighty and the greatest form of worship of Him, which includes the manifestation of all types of monotheism! According to an-Nu'man ibn Bashir (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: **Verily, dua is worship,** after which he read the following verse of the Quran: **And your Lord said: Invoke Me, I will respond to your (invocation). Verily! Those who scorn My worship they will surely enter Hell in humiliation!** (40:60). Abu Daud (1479), at-Tirmidhi (2969, 3372), Ibn Majah (3828). Imam at-Tirmidhi, Hafiz Ibn Hajar, Sheikh al-Albani confirmed the authenticity of the hadith. See “Fathul-Bari” (1/64), “Sahih at-Targib” (1627). And Ibn ‘Abbas (may Allah be pleased with him) said: “The best worship is prayer.” al-Hakim (1/491). Sheikh al-Albani called this message good. See “as-Silsila as-sahiha” (1579). And the Shariah of Allah Almighty has established various etiquettes for dua, as well as times and situations during which dua has the greatest chance of receiving an answer from the Almighty. With the permission of Allah Almighty, in this article I would like to consider two questions that many Muslims often ask. The first question: “Is it legal and desirable to turn to Allah with duas after completing the obligatory prayer, or should we limit ourselves to duas directly during the prayer itself?” Second question: “If it is legal and desirable to turn to Allah with prayers after the obligatory prayer, then is it permissible to raise your hands at the same time?” It should be noted that some scholars have considered that turning to Allah with a prayer is legalized before salam during tashahhud directly in the prayer itself, and not after it. Whereas after salam it is legal to remember Allah (dhikr). In this they relied on the words of Sheikh-ul-Islam Ibn Taymiyya. And whoever believed that dua after obligatory prayers was not legalized naturally automatically believed that dua after obligatory prayer with raising of hands was not legalized, even less so. With the permission of Allah Almighty, I would like to briefly highlight these issues in more detail, citing all the arguments and opinions of scientists on this matter.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
            {
            "source": ""
            }
            ]
            },
        {
            "id": 2,
            "subtitle": "The time after obligatory prayer is one of the good periods for prayer",
            "text": "Abu Umama (may Allah be pleased with him) said: “When the Messenger of Allah (peace and blessings of Allah be upon him) was asked: “Which dua most deserves to be heard?”, he replied: **The one made in the last part of the night and after obligatory prayers**. at-Tirmidhi (3499), an-Nasai in “al-Kubra” (108), al-Bayhaqi in “ad-Da’awat” (2/238). The hadith is authentic¹. On the authenticity of the hadith from Abu Umama As for the claims to this hadith, those who want to weaken it rely on the words of Imam Ibn Ma’in, who said that the transmitter ‘Abdur-Rahman ibn Sabit, who transmitted this hadith from Abu Umama, did not hear from him. See “Tarikh Ibn Ma'in” (3/87). For this reason, this hadith was weakened by Hafiz Ibn al-Qattan, who said: “Know that the transmission of Ibn Thabit from Abu Umama is interrupted, for he did not hear from him.” See “Bayan al-wahm” (2/385). He was also weakened in one of his opinions by Hafiz Ibn Hajar, who objected to the assessment of Imam at-Tirmidhi, who called this hadith good, saying: “There is doubt in what he said, since this hadith has shortcomings: The first of them is an interrupted isnad. Al-‘Abbas ad-Duri reported the following from Yahya ibn Ma’in in his book “at-Tarikh”: “I did not hear ‘Abdur-Rahman ibn Thabit from Abu Umama hadith.” The second is that Ibn Jurayj (who was a Mudallis) did not convey this hadith in an affirmative form (‘an’ana). ”Third, this version of the hadith is rejected, because five students of Abu Umama conveyed the basis of this hadith with mention of only its first part (about the last part of the night).” See “Nataij al-afkar” (2/247). Sheikh Muqbil ibn Hadi said: “If you look at the isnad of this hadith, you will find that all its narrators are the narrators of al-Sahih. However, in the book “Tahzib at-tahzib” it is reported from the words of Yahya ibn Ma’in that ‘Abdur-Rahman ibn Thabit did not hear from Abu Umama.” See “Ahadith mu’alla” (180). By the way, it should be noted that Hafiz Ibn Hajar himself in his three other books leans towards the authenticity of this hadith, which, with the permission of Allah, will be mentioned in more detail.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Sahih at-Targib” (1648). Supporters of the incompetence of turning to Allah with prayers after obligatory prayers had two claims to this hadith: its authenticity and its understanding."
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "1-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Firstly, with regard to the tadlis of Ibn Juraij, this is not a drawback in this case, for in the version of this hadith cited by 'Abdur-Razzaq (3948), Ibn Juraj conveys it in the affirmative, saying: “Abdur-Razzak told me Rahman ibn Thabit, what Abu Umama said.” Therefore, the fear of tadlis in this case is absolutely excluded, since Ibn Jurayj in this version conveys it in a form indicating that he heard these words personally. Secondly, regarding the words that this version of the hadith is rejected (shazz) and contradicts other versions that were transmitted from Abu Umama by his disciples, to this objection Sheikh Salim al-Hilali said: “As for the words that that this hadith is rejected, then this has no relation to the hadith under discussion, since we are talking about two completely different hadiths.” See “Tahrij al-Adhkar” (1/177). Those. the fact that other narrators from Abu Umama transmitted similar hadiths, which mention the virtue of prayer in the deep or last part of the night, is not a reason to consider the hadith under discussion rejected, for these are completely different hadiths. Thirdly, as for the fact that ‘Abdur-Rahman ibn Thabit did not hear the hadith from Abu Umama, then in reality this is the only good reason out of the three mentioned. To begin with, it should be noted that ‘Abdur-Rahman ibn Thabit is a reliable and truthful transmitter according to the unanimous opinion of the imams of the science of hadith “al-jarh wa-t’adil”. See “Tahzib al-Kamal” (17/123), “Tahzib al-Tahzib” (2/509). But at the same time, he did transmit some hadiths in the form of “mursal” both directly from the Prophet (peace and blessings of Allah be upon him) and from various companions. Al-‘Abbas al-Duri said: “They asked Yahya (Ibn Ma’in): “Did ‘Abdur-Rahman ibn Thabit hear from Sa’d ibn Abi Waqqas?” He replied: “No.” He was asked: “Did he hear from Abu Umama?” He replied: “No.” He was asked: “Have you heard from Jabir?” He replied: “No, his transmission is mursal.” Yahya’s madhhab regarding ‘Abdur-Rahman ibn Thabit was such that he transmitted from these companions in the form of mursal, and did not hear from them.” See “Tarikh Ibn Ma'in” (3/87). Hafiz Ibn Hajar said: “It was said that it is not established that Ibn Thabit heard from any of the Companions.” Then he quoted the mentioned words from Ibn Ma’in, and added: “But Ibn Thabit found these two (Abu Umama and Jabir), and he also has a transmission from Ibn ‘Abbas and ‘Aisha (may Allah be pleased with them).” See al-Isaba (8/337). As for the narration of Ibn Hajar that Ibn Thabit did not hear from any of the companions, as well as the words of Ibn Ma'in that he did not hear from Jabir, these statements refute the words of Imam Ibn Abi Hatim, who said: “The narration of Ibn Thabit from 'Umara is mursal (interrupted), and his transmission from Jabir ibn 'Abdullah is continuous (authentic). See “al-Jarh wa-ta'dil” (5/240). And since Hafiz Ibn Hajar admits the fact that Ibn Thabit found both Jabir and Abu Umama, then it is not excluded that he could have heard hadiths from Abu Umama, given that Abu Umama died later than Jabir. Indeed, according to various sources, the date of death of Jabir is either 73 AH or 78 AH, while Abu Umama, according to one version, died in 81 AH, and according to another in 86 AH, and about the second date because of its prevalence among historians, Ibn al-Barqi even said: “And there is no disagreement about this¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See al-Isaba (3/340)."
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "2-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Fourthly, this hadith has various supporting evidence: For example, a hadith narrated from the words of al-‘Irbad ibn Sariya (may Allah be pleased with him) that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever performs the obligatory prayer deserves a prayer that does not remain unanswered; and he who has completed the recitation of the entire Quran has earned a prayer that does not go unanswered.” at-Tabarani in “al-Kabir” (18/259). This hadith indicates that the completion of prayer is one of the good periods for turning to Allah with prayers. Commenting on this hadith, Hafiz al-Munawi said: “We are talking about dua after completing the prayer.” See “at-Taysir” (2/428). However, this hadith was called weak by Hafiz al-Haythami and Sheikh al-Albani. See “Majma'u-zawaid” (7/172), “al-Silsila ad-da'ifa” (3014). But despite the fact that this hadith itself is weak due to the narrator named 'Abdul-Hamid ibn Suleiman, who was considered weak by such imams as Ibn al-Madini, Ibn Ma'in, al-Fasawi, Abu Dawud, Abu Zur'a, an-Nasai and ad-Darakutni, however, it is suitable as a “shahid”, that is, in the form of a confirming and reinforcing message. Also in the isnad of this hadith there is a transmitter named al-Fadl ibn Harun - the sheikh of Imam at-Tabarani, from whom he transmitted many hadiths in his collections. There is no known discredit or recognition of reliability about this transmitter, but Imam at-Tabarani said about him that he was a student of Imam Abu Saur, and Hafiz al-Khatib al-Baghdadi called him a faqih. See “Mu'jam al-kabir” (11/395), “Tarihu Baghdad” (12/372). Imam al-Dhahabi said about al-Fadl ibn Harun: “Faqih, student of Abu Saur. He transmitted hadiths from Dawud ibn Rashid, Muhammad ibn Abi Ma'shar and others, and from him the hadiths were transmitted by Abu Nu'aym ibn 'Adi and at-Tabarani. See Tarikh al-Islam (22/145). But still, the main reason for the weakening of this hadith is the weakness of ‘Abdul-Hamid ibn Suleiman. However, it is important to note that his weakness was not due to his wickedness, lies, etc. On the contrary, he was basically a truthful transmitter, but he made mistakes due to the fact that he was blind. Therefore, when Imam Ahmad was asked: “How do you like the hadiths of ‘Abdul-Hamid?”, he replied: “I don’t know. But I didn’t see any problems with him.” See “Tariha Baghdad” (12/372). Imam al-Bukhari said about him: “As for ‘Abdul-Hamid ibn Suleiman, he is truthful, but perhaps he made mistakes in some transmissions.” See “al-‘Ilal al-kabir” (264). Imam Ibn ‘Adi also made the following conclusion about him: “He is one of those whose hadiths can be written down.” See “al-Kamil” (6/7). Those. his hadiths can be considered as strengthening evidence. In a word, this hadith is suitable to strengthen the discussed hadith from Abu Umama, for which reason the authors of the famous fiqh encyclopedia cited this hadith among the arguments of the majority of scholars who considered it desirable to turn to Allah with prayers after the obligatory prayer. See “al-Mawsu’a al-fiqhiyya” (39/228). And by the way, although Sheikh al-Albani previously considered the discussed hadith from Abu Umama weak, in the new edition of his research on the book “Kalim at-Tayyib” by Sheikh-ul-Islam Ibn Taymiyyah, in the preface he mentioned some hadiths that he considered reliable in the old edition , but subsequently revised and leaned towards their weakness, after which Sheikh al-Albani said: “In contrast to these (weak) hadiths, Allah has made it easier for me to strengthen other hadiths, which I previously considered weak due to shortcomings in their isnads, like a gap and so on. And this was the case until I discovered something that strengthens these hadiths from among the evidence and other things,” after which he mentioned among these hadiths the discussed hadith from Abu Umama. See “Tahrij Kalim at-Tayeb” (page 5). Then in the same book, in a footnote to the hadith of Abu Umama, having mentioned that Imam at-Tirmidhi considered this hadith good, Sheikh al-Albani said: “He mentioned that this hadith has two amplifying transmissions. And he also has a third transmission, which is cited by Ibn Qani’ in “al-Mu’jam” from the words of Ka’b ibn ‘Ujra (may Allah be pleased with him)¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Tahrij Kalim at-Tayb” (114)."
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "3-Response to claims regarding the authenticity of the hadith from Abu Umama",
            "text": "Also, the hadith from Abu Umama strengthens the interpretation of the following Quranic verse by the salaf led by the companions: **So when you have finished  devote yourself for Allâh’s worship** (94: 7). In this verse, Allah Almighty ordered, having completed an action related to this world or the eternal world, to strive to worship Him. In the interpretation of this verse, Ibn ‘Abbas (may Allah be pleased with him) said: “When you have completed the obligatory prayer, then turn to Allah with a prayer.” at-Tabari in “at-Tafsir” (24/496), Ibn Abi Hatim in “at-Tafsir” (19397). The message is good (hasan). See “as-Sahih al-masbur” (4/647), “Tafsir al-mamun” (8/489). And exactly the same interpretation regarding this verse is also transmitted from Ibn Mas'ud, Mujahid, Qatada, ad-Dahhak and Muqatil. See “Tafsir ‘Abd ar-Razzaq” (3645), “Tafsir at-Tabari” (24/496), “Zadul-masir” (4/462). This verse alone and the mentioned interpretation of the salaf led by the companions is enough to consider dua after completing the prayer as a good and desirable act, not to mention the prophetic hadiths of this chapter! For this reason, having mentioned the strengthening evidence of the first part of the hadith from Abu Umama that the best dua is the dua in the dead of night, Sheikh 'Abdul-Qadir al-Arnaut regarding the second part of the hadith that the best dua is also the dua after the obligatory prayers , said: “And the second part is strengthened by general provisions containing great merits. After all, he who remembers Allah (after prayer) will rise from his place forgiven. Until the next prayer, he will remain under the protection of Allah Almighty. Even sins equal in quantity to the foam of the sea will be forgiven him. All this and other virtues indicate the honor of this time and the acceptance of prayer at this time.” See “Tahrij Jami' al-usul” (4/124). Fifthly, based on everything stated above, it becomes clear to us why the discussed hadith from Abu Umama was recognized as reliable by many possessors of knowledge and specialists in the science of hadith. As already mentioned, Imam Abu ‘Isa at-Tirmidhi called this hadith good. See “Sunan at-Tirmidhi” (5/526). Also, the following hafiz and scholars agreed with at-Tirmidhi’s assessment of this hadith: ad-Diya al-Maqdisi, al-Munziri, ‘Alyauddin Mughultai, Ibn Kathir, Ibn Rajab, al-Qastalyani, Ibn al-Mulyakqin, al-Shaukani, al-Mubarakfuri. See “al-Sunan wal-ahkam” (2/140), “at-Targib wa-ttarhib” (2/321), “al-I’lyam” (5/404), “Irshad al-faqih” ( 1/137), “al-Mawahib” (3/265), “Neil al-autar” (2/358), “Tuhfatul-ahuazi” (2/172). By the way, it should be noted that Hafiz Ibn Hajar himself in his book “Fath al-Bari” (11/143) agreed with Imam at-Tirmidhi’s assessment that this hadith is good (hasan). And in his other book “ad-Diraya” (1/225), Ibn Hajar said that all the transmitters of this hadith are reliable, without mentioning anything about its shortcomings. Moreover, in his third book “Hidayatu-rrua” (928), Ibn Hajar himself assessed this hadith as “hasan” (good), since he did not say anything about its authenticity, whereas in the preface of this book he wrote: “If I kept silent regarding the degree of authenticity of a hadith, which means it is good (hassan).” See “Hidayatu-rrua” (1/58). This hadith was also considered reliable by Hafiz ‘Abdul-Haqq al-Ishbili. See “al-Ahkam al-usta” (1/416). Imam al-Baghawi called him good. See Masabih al-Sunnah (1/361). Hafiz al-Nawawi considered this hadith authentic. See “Riyadh al-salihin” (1500), “al-Khulyasa” (1/465). Mullah ‘Ali al-Qari called this hadith authentic due to the evidence that strengthens it. See “Mirkatul-mafatih” (2/768). Sheikh al-Albani called this hadith authentic due to the evidence that strengthens it. See “Sahih at-Targib” (1648). Also, the reliability of this hadith was strengthened by Sheikh ‘Abdul-Qadir al-Arnaut and Sheikh Salim al-Hilyali. See “Tahrij Jami’ al-usul” (4/142), “Tahrij al-Adhkar” (1/177). Sheikh Muhammad al-Ityubi called the isnad of this hadith authentic. See “al-Bahr al-muhith al-sajaj” (15/632). Sheikh Muhammad Subhi Hallak called this hadith authentic. See “Tahkyk at-Takhyir” (4/20). Also, Sheikh ‘Abdur-Razzaq al-Badr, in his book on the provisions of adhkars and du’a, which Sheikh Ibn Baz approved and praised, called the isnad of this hadith excellent¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Fiqh al-ad’iya wal-azkar” (1/335)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "1-On understanding the hadith from Abu Umama",
            "text": "Абу Умама (да будет доволен им Аллаха) сказал: «Когда Посланника Аллаха (мир ему и благословение Аллаха) спросил: «Какая молба наиболее удачно будет избранной?», он ответил: «Та, с которыми обращаются ни в какой части ночи и после обязательных». молитва»». ат-Тирмизи (3499), ан-Насаи в «Аль-Кубра» (108), аль-Байхакъи в «ад-Даауат» (2/238). Хадис достоверный. См. «Аль-Ахкам аль-Уста» (1/416), «Масабих ас-Сунна» (1/361), «Сахих ат-Таргъиб» (1648), «Аль-Бахр аль-Мухит ас-Саджадж» (15/ 632). Убедившись в том, что данный хадис является достоверным, а его смысл имеет основу, хотелось бы более подробно остановиться на том, о каком именно периоде в нем идет речь: о мольбе после салама, или же о мольбе до салама во время ташаххуда? В данном хадисе упоминается выражение: «бурдубур ас-саля», что может нести два значения: «сразу после молитвы» и «в конце молитвы». Шейхуль-Ислям Ибн Таймия сказал: «Что касается хадиса от Абу Умамы, то обязательно не уточнять этого молбой лишь после салама, напротив, необходимо отнести это к мольбам до салама. А если будет сказано, что этот хадис противоречит как то, что до салама, так и то, что после салама, то из этого не следует, что мольба имама и молившиеся идут за ним, совместно после салама является Сунной. Но если каждый из них будет обращаться с мольбоем после салама по отдельности, то это не будет противоречить Сунне». См. «Аль-Фатауа аль-Кубра» (2/210). Также имам Ибн Таймия сказал: «Общеизвестно, что мольба является дозволенной, как во время совершенства молитвы, так и вне молитвы. Но большинство мольб, начальствующих от Пророка (мир ему и благословение Аллаха), произнесли их в конце молитвы перед саламом. В хадисе сообщается: «Наилучшая мольба – это мольба в последнюю часть ночи и после обязательной молитвы». И становится ясно, что мольба в конце молитвы, особенно перед саламой, во время чего чаще всего вызывал Аллаху Пророка (мир ему и благословение Аллаха), ближе к принятию и получению ответа, чем в других молитвах-состояниях. Ведь это мольбой после того, как доведения поклонения дойдут до завершения». См. «Маджмууль-фатауа» (22/379). Также Ибн Таймия сказал: «Под мольбоем во время «дубур ас-саля» речь идет либо о последней части молитвы, что будет соответствовать прочим хадисам, либо речь идет о завершении молитвы после ташахахуда, либо речь идет в общем виде. В любом случае невозможно уточнить это именно мольбами после саламы, так как все профессиональные пророчные мольбы произносились до саламы. И нельзя узаконивать Сунну на основании обобщённого текста, который противоречит членам Комиссии Сунне и блестящим формулировкам». См. «Маджмууль-фатауа» (22/499). Также Ибн Таймия сказал: «Группа чисел, состоящих из аш-Шафи'и и других, считала желательным обращение с мольбами после обязательных пятикратных молитв. Но все они единодушны в том, что оставшийся эту мольбу не исключают порицания. И тот, кто делает это порицание, ошибается по единогласному мнению учёных. Ведь в данном положении это не является ни обязательным, ни желательным деянием. Тот, кто порицает оставившего мольбу после молитвы, сам по себе порицания. Более того, совершающий постоянно мольбу тоже достоин порицания, потому что, в конечном счете, постоянное совершение того, что не совершал постоянно Пророк (мир ему и благословение Аллаха) во время этой пятикратной молитвы, не является узаконенным, напротив, это порицаемо. Но если имамы и молившиеся сзади иногда обращаются к Аллаху с молитвами мольбами после молитвы по причине чего-то произошедшего, то это не будет противоречием Сунне в отличие от того, кто делает это постоянно». См. «Маджмууль-фатауа» (22/513-514). Также Ибн Таймия сказал: «Что касается совместного обращения с мольбами имамом и теми, кто молился за ним, то нет никаких сомнений в том, что Пророк (мир ему и благословение Аллаха) не совершал подобного после обязательных молитв. И если бы он так поступил, то его сподвижники передали бы это¹».",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹См. «Маджмууль-фатауа» (22/517)."
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "2-On understanding the hadith from Abu Umama",
            "text": "Ibn Taymiyyah also said: “As for the joint prayers of the imam and the worshipers following him after the obligatory prayer, this is an innovation that did not exist during the time of the Prophet (peace and blessings of Allah be upon him). Truly, his prayer was during the prayer itself, because the one who prays is the one who turns to his next step, and if he turns to Him at that moment with a prayer, then this is an appropriate look. As for the dua after the prayer is said, then the dua is no longer appropriate, just as it is appropriate after the prayer to resume the adhkars that are criminal from the Prophet (peace and blessings of Allah be upon him), such as the words “la ilaha ill-Allah”, “alhamdu li-llah” ,Allahu Akbar. See Majmuul-Fataawa (22/519). From the quoted words of Imam Ibn Taymiyyah, we can conclude that his madhhab, according to recommendations, is compiled in the following order: - Congregational prayer after the obligatory prayers by the imam and those praying behind him is an innovation, except occasionally and on a specific occasion. - The appropriate and desirable time for prayer is the period of the prayer itself, especially its end before salam. - After completing the prayer, the name of Allah (dhikr) is legitimized, not the dua. - Making a prayer after saying a prayer is not prohibited, but this is not established by the Solar. - It is impossible to clarify what is a Solar appeal to Allah with prayers after obligatory prayers, based on a popular saying like “dubur as-sala”, despite the fact that this expression is included in you, including in the period after the completion of the prayer. Imam Ibn al-Qayyim said: “As for the prayer (of the imam) after salam, continuing to sit towards the Kaaba or praying from behind, this was not fundamentally the way of the Prophet (peace and blessings of Allaah be upon him). And nothing is transmitted from him about this, neither with a reliable isnad, nor with a good one. As for the specification of morning prayer and afternoon prayer with duas after their completion, this did not happen to either the Prophet (peace and blessings of Allah be upon him) or his caliphs, and he did not observe this community of his. Indeed, this is what was considered good ideas by some who came to contradict the Sunnah after him. And Allah knows this best. Most of the duas associated with prayer, the Prophet (peace and blessings of Allah be upon him) said himself directly during the prayer itself and commanded to do so. And this is what corresponds to the position of the one praying, because he turned to his head, calling on Him, performing prayer. And when he completes the prayer and pronounces the words of salam, then this turning to the head and being in front of Him is interrupted. So how can you make an appeal to Allah with requests at the moment of approaching and turning to Him, and then ask Him after doing this?! There is no opinion that the opposite is correct for the person praying. However, there is a subtle point here, which consists in the fact that if the person praying completed the prayer, remembered Allah after it, glorified and exalted Him with legalized adhkars after the prayer, then it is desirable for him after this to pray for the Prophet (peace and blessings of Allah be upon him), and then I make any plea. Thus, his dua will be after this second worship (remembering Allah and dua for the Prophet), and not because he made a dua precisely after completing the prayer. After all, everyone who remembers Allah and praises Him, and then turns to prayer for the Messenger of Allah (peace and blessings of Allah be upon him), then it is desirable for him, after that he turns to prayer for himself. And this is stated in the hadith from Fadali ibn Ubaydah that the Prophet (peace and blessings of Allaah be upon him) said: “When one of you prays, let him begin by praising his Great and Almighty head and glorifying Him, then let him invoke a blessing on the Prophet, and then call with any dua that he wishes.” And at-Tirmidhi said: “This hadith is authentic.” See “Zadul-maad” (1/249). In this case, the madhhab of Imam Ibn al-Qayim for resolving the issue is identical to the madhhab of his sheikh, Ibn Taymiyyah. Then, further in the section on prophetic duas, which are mentioned in the hadiths, that he said them at the end of the dubur as-sala prayer, mentioning one of the versions, Ibn al-Qayyim says: “Muslim gives two versions, in one of which It is said that the Prophet (peace and blessings of Allaah be upon him) said this prayer between tashahhud and salam, and this is the correct opinion, and in another version it is said that he said this prayer after salam. He probably said this prayer both times. And Allah knows this best¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Zadul-maad” (1/343)."
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "3-On understanding the hadith from Abu Umama",
            "text": "Then further, he cited the following hadith: From the words of Mu'az (may Allah be pleased with him) it is reported that one day the Messenger of Allah (peace and blessings of Allah be upon him) took his hand and said: “O Mu'az, I swear by Allah, verily, I love you, and I punish You, O Mu'az, should never forget to say after each prayer: “O Allah, help me to remember You, thank You and worship You properly!” Ahmad (6/244), Abu Dawood (1522), an-Nasai (1303). Hafiz an-Nawawi, Imam Ibn al-Qayim, Hafiz Ibn Kathir, Sheikh al-Albani confirmed the authenticity of the hadith. See “al-Khulyasa” (1/468), “‘Uddatu-sabirin” (1/224), “al-Bidaya wa-nnichaya” (7/108), “Sahih al-Jami’” (7969).\n اللَّهُمَّ ‌أَعِنِّي ‌عَلَى ‌ذِكْرِكَ، ‌وَشُكْرِكَ، ‌وَحُسْنِ ‌عِبَادَتِكَ \n /Allahumma, a’inni ‘ala zikrika, wa shukrika, wa husni ‘ibadatika/. After which Ibn al-Qayim says about this hadith: “The words “dubur as-sala” can refer to what is said both before salam and after salam. But our sheikh (Ibn Taymiyyah) considered it correct that we are talking about the period before salam. I contacted him again about this issue and he said: “When you say “dubur” about something, it refers to the thing itself, like the words “dubur al-hayuan”, which means “the tail of an animal.” See “Zadul-ma’ad” (1/353). By the way, the fact that Ibn al-Qayyim turned to Ibn Taymiyyah several times to clarify this issue indicates that he had doubts, because the opinion of his sheikh that all prophetic prayers are pronounced before salam did not align with direct and explicit hadiths, which mentioned that the Prophet (peace and blessings of Allah be upon him) said various prayers after salam. Therefore, in his other works, Imam Ibn al-Qayim spoke less categorically on this matter. For example, in his book on the provisions of prayer, he said: “Dubur al-sala is the last part of the prayer, like the back of an animal or the outermost part of a wall. But it can also mean the completion of the prayer due to evidence indicating this, such as the hadith: “Say “Subhan-Allah”, “alhamdu li-Llah”, “Allahu akbar” thirty-three times at the end of the prayer (dubur as-sala). And in this context, the word “dubur” refers to the complete completion of the prayer.” See “as-Sala” (1/378). As for some people who understood the words of Imam Ibn al-Qayim in such a way that he unequivocally forbade and condemned the utterance of prayers after obligatory prayers, then Hafiz Ibn Hajar said about this: “Many Hanbalites whom we met understood the meaning of Ibn’s words. al-Qayyim so that he completely denied the prayer after completing the prayer. But the situation is different. The essence of his words is that he denied the prayer (by the imam) after prayer, continuing to sit towards the Kaaba. But if he turned to those praying behind him, pronounced the legal adhkars, and then made a prayer, then in this case the prayer is not condemned by him.” See “Fathul-Bari” (11/134). By the way, it should be noted that Hafiz Ibn Hajar argued for the fallacy of some of the mentioned words of Imam Ibn al-Qayim on this issue in his book “Fathul-Bari” (11/134-135). And this remark of Ibn Hajar regarding the words of Ibn al-Qayim was considered excellent by Hafiz al-Qastalyani, who quoted the words of both, after which he agreed with Ibn Hajar. See al-Mawahib (3/264). So did Sheikh al-Mubarakfuri, who quoted the words of Ibn al-Qayyim and the remark of Ibn Hajar, after which he concluded: “There is no doubt that saying a prayer after completing the obligatory prayer is established by the Messenger of Allah (peace and blessings of Allah be upon him), both in words and deeds!” See “Tuhfatul-Ahuazi” (2/169). Similar to what Ibn Taymiyyah and Ibn al-Qayim expressed was said by Sheikh Ibn 'Usaymin, who, having mentioned the hadith of Abu Umama and his explanation that we are talking about a prayer after completing the prayer, said: “This understanding of this hadith is inaccurate, on the contrary, it is obligatory is to attribute its meaning to the fact that under the words “dubur as-sala” we are talking about the end of the prayer (before salam), and the argument for this is the hadith from Ibn Mas'ud, in which the Prophet (peace and blessings of Allah be upon him) commanded him after tashahhuda to turn to Allah with prayers. The Sunnah interprets itself. As for completing the prayer, Allah Almighty indicated to His servants that they should remember Him, saying: “When you complete the prayer, then remember Allah standing, sitting or lying on your sides!” (4: 103). And in this verse there is no command to make a prayer¹. So, the essence of the mentioned opinion is that all the hadiths that mention the dua at the end of the dubur as-sala prayer, they are talking about dua (ad-du'a) precisely during tashahhud before salam. And if we are talking about remembering Allah (az-dhikr), then we are talking about saying this after salam. And the following arguments were used as specific arguments: Allah Almighty said: “When you finish your prayer, remember Allah standing, sitting or lying on your sides!” (4: 103). This verse deals specifically with dhikr. According to Ibn Mas'ud (may Allah be pleased with him), it is reported that when the Messenger of Allah (peace and blessings of Allah be upon him) taught him the words “at-tahiyat,” he said: “After that, he can choose any prayer that he likes.” and turn to Allah. al-Bukhari (835), Muslim (402). They considered this hadith to specify the discussed hadith from Abu Umama and general hadiths that talk about prophetic prayers after prayers, that we are talking specifically about the prayer at the end of the prayer before salam, and not after salam.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See Sharh al-mumti' (3/203)."
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "Response to the arguments of those who believed that the hadith of Abu Umama refers to supplication before making salam",
            "text": "Firstly, the word “dubur” in the words of linguists and imams contains both meanings, and depending on the context, it can be applied both to “that which is part of something, but located at the end,” and to that “what may immediately follow something.” See “Mu'jam al-maqais” (2/324), “Jami' al-usul” (4/124), “Taj al-‘arus” (11/254). Allah Almighty said: And during a part of the night (also), glorify His praises and (so likewise) after after prostrations (sujud). (50:40). This verse mentions the word “adbar”, the plural of “dubur”, and in this case we are talking about glorifying Allah after prostrations, i.e. after completion of prayers, and not at the end of prostrations.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 10,
            "subtitle": "Secondly",
            "text": "Secondly, if we turn to the words of the salaf and imams before Ibn Taymiyyah and Ibn al-Qayyim, we can find that they used the expression “dubur al-sala” only to mean “after prayer” and not “at the end of prayer before salam” For example, Imam Malik said: “Whoever forgot to say takbirs on the days of at-Tashriqa after prayer (dubur as-sala), then if he is nearby, let him return and say them, and if he has already left and a lot of time has passed, then nothing will happen to him.” should be done. See “al-Mudawana” (1/248). No one will say that holiday takbirs are pronounced at the end of the prayer before salam! Imam ‘Abdur-Razzak mentioned the hadiths about the remembrance of Allah and prayers, which say that they are pronounced during “Dubur al-Sala”, and called the chapter as follows: “The chapter on the glorification of Allah and the words said after the completion of the prayer.” See al-Musannaf (2/513). Imam al-Bukhari named the chapter in his collection as follows: “The chapter about the one who did not perform voluntary prayers on the road after the obligatory prayer (dubur al-sala) and before it.” See Sahih al-Bukhari (1/372). No one will say that it is possible to perform voluntary prayer before completing the obligatory prayer! Imam ad-Darimi named the chapter in his collection as follows: “Chapter on tasbih after prayers (dubur as-sala).” See “Musnad al-Darimi” (2/853). No one will say that tasbih is performed before salam prayer! Imam at-Tirmidhi said: “The possessors of knowledge considered it desirable for a person to enter ihram after prayer (dubur as-sala).” See “Sunan at-Tirmidhi” (2/172). Also, Imam Ibn al-Mundhir said: “It is preferable for me to enter ihram after prayer, but if a person entered ihram and did not perform prayer first, then that is enough.” See al-Ishraf (3/186). Can anyone imagine that it is possible to enter ihram before salam without completing the prayer? Imam Ibn Khuzaima named the chapter in his collection as follows: “The chapter on the order to read suras “al-Falyak” and “an-Nas” after prayer (dubur as-sala).” See “Sahih Ibn Khuzayma” (1/372). All these great imams mentioned the expression “dubur al-sala” and meant the completion of the prayer, and not tashahhud before salam! For this reason, Hafiz Ibn Hajar said: “If someone says: “By the words “dubur as-sala” we are talking about the end of the prayer, namely the tashahhud,” then we will say: “The orders are transmitted to pronounce dhikrs during “dubur” as-sala, while we are talking about completing the prayer after salam according to unanimous opinion. And the same applies to this case, until there is an argument to the contrary. See “Fathul-Bari” (11/134). In a word, we are talking about the fact that if the hadiths talk about saying something during “dubur al-sala”, then we are talking about completing the prayer after salam, and not before salam, except if there is a specific argument indicating the fact that we are talking about saying this before salam. As an example, we can mention the famous prayer for protection from four things. According to Abu Hurayrah (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: “When one of you sits on the tashahhud, let him turn to Allah for protection from four things, saying: “ O Allah, verily, I resort to You for protection from the torment of Hell; from the torment of the grave; from the temptation of life and death; and from the temptation of the Dajjal. Muslim (588). This hadith clearly states that this prayer is pronounced at Tashahhud before salam. Sheikh Muhammad al-Ityubi said: “As for the interpretation of the words of the Prophet (peace and blessings of Allaah be upon him) “Dubur as-sala”, that we are talking about what is before salam, since the end of the animal is part of it, this is not convincing . After all, the Prophet (peace and blessings of Allah be upon him) taught adhkars and supplications, which he ordered to be performed during “Dubur al-Sala” after prayer. And it is not correct to attribute part of these words of remembrance of Allah to what concerns tashahhud before salam, as supplication, and part to what concerns the completion of prayer after salam, as tasbih and reading the verse of al-Kursi. After all, there is no argument for such a division. Not to mention that some of these hadiths clearly state that they are talking about saying this after completing the prayer¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See Sharh Sunan an-Nasai (15/385)."
                }
            ]
        },
        {
            "id": 11,
            "subtitle": "Thirdly",
            "text": "With regard to the discussed hadith from Abu Umama, all the imams who lived before Ibn Taymiyyah and Ibn al-Qayim understood this hadith in such a way that we are talking about completing the prayer after salam, and not before salam. Qadi al-Halimi (338-403 AH) said, listing the periods of time desirable for prayer: “After completing the obligatory prayers. It is reported that when the Prophet (peace and blessings of Allaah be upon him) was asked: “Which prayer most deserves to be heard?”, he replied: “That which is made in the last part of the night and after the obligatory prayers.” And this also relates to the Words of Allah Almighty: “And when you are free, be active” (94: 7). The meaning of allocating a period of “completion of obligatory prayers” for prayer can be attributed to the fact that when people have fulfilled what was prescribed for them, by doing which they wish to achieve the pleasure of Allah, there is great hope that in this situation they will be given an answer. After all, a prayer in a position in which Allah is pleased with a person is more likely to receive an answer than in other situations.” See al-Minhaj (1/539). Also, such imams as al-Baghawi, ad-Diya al-Maqdisi, Majduddin Ibn Taymiyya, an-Nawawi, called the chapters in which this hadith was mentioned as follows: “On prayer and remembrance of Allah after prayer.” See “Masabih al-Sunnah” (1/359), “al-Sunan wal-ahkam” (2/133), “al-Muntaqa” (p. 212), “al-Adhkar” (p. 70). Hafiz Ibn al-Athir, commenting on this hadith regarding the words “dubur as-salawat” said: “The dubur of every thing is what is behind or after. And in this case we are talking about completing the prayer.” See “Jami' al-usul” (4/124). Ibn ad-Dayba' al-Shaybani and Ibn al-Malik said the same thing in their commentary to this hadith: “We are talking about the period after the completion of prayers.” See “Taysir al-usul” (2/57), “Sharh al-Masabih” (2/169). Hafiz Ibn Rajab said: “Based on the hadith from Abu Umama, our supporters (Hanbalis) and supporters of al-Shafi'i considered it desirable to turn to Allah with a prayer after prayers. And some Shafiites conveyed a unanimous opinion on this matter.” See “Fathul-Bari” (7/417). Kamaluddin ad-Damiri and al-San'ani said: “This hadith is evidence of the desirability of turning to Allah with prayers after the obligatory prayers.” See “an-Najm al-wahhaj” (2/187), “Subulu-Ssalam” (2/708). Al-Shaukani said: “This hadith contains a direct indication that deep night and the end of obligatory prayers are among the periods of time when a prayer is answered¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Neil al-autar” (2/358)."
                }
            ]
        },
        {
            "id": 12,
            "subtitle": "Fourthly",
            "text": "The meaning of the hadith from Abu Umama is also strengthened by the mentioned weak hadith, transmitted from the words of al-Irbad ibn Sariya (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said: “Whoever performed the obligatory prayer deserves a prayer that does not go unanswered. at-Tabarani in “al-Kabir” (18/259). This hadith indicates that the completion of prayer is one of the good periods for turning to Allah with prayers. Commenting on this hadith, Hafiz al-Munawi said: “We are talking about supplication after completing the prayer.” See “at-Taysir” (2/428). Here I would like to draw attention to one important thing, which, most likely, few Russian-speaking Muslims, including some seekers of knowledge, know about. Very often, imams resorted to weak hadiths, the weakness of which was not serious, to explain the meaning of some reliable hadith, regarding the understanding of which there could be disagreement. For example, a generalized hadith is transmitted about the virtue of reading the verse of al-Kursi or the last three surahs of the Koran after prayers, and scholars disagree whether this applies to any prayer or specifically to the obligatory ones? And if in some weak version of the hadiths of this chapter it is the obligatory prayer that is mentioned, then the scholars relied on this specification, despite the weakness of this version. For example, Imam Ibn al-Qayim strengthened the opinion that he chose based on a weak hadith, saying: “Despite this (the weakness of the hadith), it is suitable for strengthening this opinion.” See “Tuhfatul-maudud” (p. 17). Also, Hafiz an-Nawawi, conveying the opinions of early Shafi'is about the meaning of the words of Imam al-Shafi'i, who considered the mursali of Sa'id ibn al-Musayib as an argument, cited three opinions, the correct one of which al-Khatib considered the second, which reads: “Truly , al-Shafi'i did not consider Sa'id's mursali to be arguments in themselves, however, he gave preference to one of the opinions, relying on his mursali, for it is permissible to prefer one of the opinions, relying on the hadith-musral. See al-Majmu' (1/99). Also, Sheikh 'Abdul-Karim al-Khudayr, in his famous book on the provisions of weak hadiths, mentioned the disagreement of scholars regarding the permissibility of relying on weak hadiths in the section of merits, then, leaning towards the opinion of the imams who prohibited this, he concluded: “But what has been said does not mean that a weak hadith is completely rejected. On the contrary, one can rely on it not in the argumentation section, but, for example, give preference, relying on it, to one meaning over another, if the meaning of the text of an authentic hadith may imply two meanings. When it is not possible to determine one of the two meanings, and a weak hadith indicates one of the two meanings, then in this case we take the meaning to which this hadith indicates, even if it is weak.” See “al-Hadith ad-da'if wa hukm al-ikhtijad bihi” (p. 300). And this relates to what was narrated from many salafs, that they preferred weak hadiths over the opinions of people. Imam Ibn Mandah said regarding Imam Abu Dawud: “He used a hadith with a weak isnad if he did not find anything else on the topic, because for him this was stronger than just the opinions of people¹. As already mentioned, we are talking about such a weak hadith, the weakness of which is not serious; which by its meaning does not derive a new Sharia law; does not contradict a reliable hadith, but only specifies and explains one of the intended meanings.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See al-Nukat (1/435)"
                }
            ]
        },
        {
            "id": 13,
            "subtitle": "Fifthly",
            "text": "Regarding the verse used by Imam Ibn Taymiyyah: “When you finish your prayer, remember Allah standing, sitting or lying on your sides!” (4: 103). It is important to note that the word “az-dhikr”, although it means “remembrance of Allah,” does not exclude the meaning of “supplication” (ad-du’a). And if we turn to the interpreters of the Koran who lived before Ibn Taymiyyah, Ibn al-Qayim and Ibn 'Usaymin, we will see that in explaining this verse they did not limit the concept of “az-dhikr” only to the remembrance of Allah, but they also mentioned prayer (ad- du'a)! Thus, the imam of the interpreters of the Koran, Ibn Jarir at-Tabari, said about this verse: “Remember Allah in any position, standing, sitting, lying on your sides, exalting Him and turning to yourself with prayers so that He will grant you victory over your enemies.” See “Tafsir at-Tabari” (9/164). Also, Najmuddin an-Nasafi, explaining the meaning of the words: “then remember Allah,” said: “We are talking about remembering Allah with the tongue and praying for victory.” See “at-Taysir fi-tafsir” (5/179). Also, al-Qurtubi, explaining the meaning of the words: “then remember Allah,” said: “Continue to remember Allah through takbir, with the words “la ilaha illa Allah,” and turn to Him with a prayer for victory, especially during battle.” See “Tafsir al-Qurtubi” (5/373). Someone may ask: “Why do these interpreters limit prayer to the request for victory over enemies?” The reason for this is that these verses talk about prayer out of fear (salaatul-khauf). After all, before this verse, Allah Almighty said: “When you are among them and leading them in prayer, then let one group of them stand with you, and let them take their weapons. When they prostrate, let them be behind you. Let another group then come who have not yet prayed, let them pray with you, be careful and take their weapons. The infidels would like you to be careless with your weapons and your belongings, so that they can attack you only once. There is no sin on you if you lay down your weapon when you are uncomfortable with the rain or are sick, but be careful. Indeed, Allah has prepared a humiliating torment for the disbelievers” (4:102). Also, Ibn al-Jawzi, explaining the meaning of the words: “then remember Allah,” said: “The majority (of the interpreters of the Quran) said that we are talking about tasbih (glorifying Allah), takbir (exalting Allah), du'a (supplication) and shukre (gratitude).” See “Zadul-masir” (1/463). As we see, all these interpreters of the Koran did not limit the concept of “remembrance of Allah” only to adhkars, but included prayer in this. By the way, what was mentioned can be compared with the verses and hadiths, which also command to remember Allah on three days of at-Tashriqa: Allah Almighty said: “Remember Allah in a few days” (2: 203). Ibn ‘Abbas (may Allah be pleased with him) said: “Counted days” are three days of at-Tashriqa.” See Sahih al-Bukhari (1/321). According to Ka'b ibn Malik (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: “The days of at-Tashriqa are the days of eating, drinking and remembering Allah.” Muslim (1141). Commenting on these and other messages about the remembrance of Allah on the three days of at-Tashriqa, Hafiz Ibn Rajab said: “As for prayer, this is the best type of remembrance of Allah Almighty. According to Abu Kinan al-Qurashi, it is reported that he heard Abu Musa al-Ash'ari (may Allah be pleased with him) during his sermon on the day of the Sacrifice say: “After the day of the Sacrifice there are three days, which Allah named in the Quran “a few days” during which the prayer is not rejected. So turn your desires to Allah Almighty!¹. Please note that the mentioned verse and hadith contain a command to remember Allah (dhikr) on the days of at-Tashriqa, but nevertheless, Hafiz Ibn Rajab did not limit this only to dhikr, but, on the contrary, said that prayer is the best form dhikr! This is also confirmed by the action of Imam al-Bukhari, who cited in his collection “al-Sahih” two hadiths that talk about remembering Allah after prayer and praising Him, but, nevertheless, called this chapter as follows: “The chapter on prayer after prayer.” See Sahih al-Bukhari (8/198). Hafiz Zakariya al-Ansari said: “With this chapter he indicated the validity of supplication after completing the prayer.” See “Tuhfatul-Bari” (9/370). Hafiz Ibn Hajar, in his commentary on this chapter, said: “We are talking about supplication after the obligatory prayer. This table of contents contains a refutation to those who stated that supplication after completing the prayer is not legal.” See “Fathul-Bari” (11/133). Those. Despite the fact that the hadiths of this chapter did not contain words of supplication, Imam al-Bukhari made it clear with these words that supplication after completing the prayer is legitimate and even desirable. And this also confirms the fact that the Salaf included prayers in the concept of “dhikr”. Therefore, the recognized imam of linguists with the Salafi faith - Abu-l-'Abbas Ahmad ibn Yahya al-Shaybani, known as Sa'lab (200-291 AH), in defining the concept of al-Zikr from the linguistic side, said: “Dhikr is prayer (sala); dhikr is the reading of the Koran; Zikr is the glorification of Allah (tasbih); dhikr is a prayer (du'a); zikr is gratitude (shukr); Zikr is obedience to Allah².",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Lataif al-ma'arif” (p. 506)"
                },
                {
                    "source": "²See “Tahzib al-Luga” (10/94), “Lisan al-‘Arab” (4/310)."
                }
            ]
        },
        {
            "id": 14,
            "subtitle": "Sixthly",
            "text": "The same applies to the hadith of Ibn Mas'ud (may Allah be pleased with him), in which the Messenger of Allah (peace and blessings of Allah be upon him), having taught him the words at-Tahiyat, said: After this he can choose any prayer that he likes and turn to Allah.” al-Bukhari (835), Muslim (402). This hadith cannot in any way be understood as a specification of the hadith of Abu Umama, since it only indicates that Muslims should turn to Allah with prayers during tashahhud before salam, pronouncing at-Tahiyat and as-Salawat, known as the “supplication al-Ibrahimiya” . The fact that this hadith indicates the desirability of turning to Allah before salam does not exclude the fact that it is also desirable to turn to Allah during prostrations. After all, the Prophet (peace and blessings of Allah be upon him) emphasized prostrations during prayer in the same way and even more strongly: According to Ibn ‘Abbas (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: “I was forbidden to read the Koran during bows and prostrations! As for bowing from the waist, exalt the Almighty Lord in it, as for bowing to the ground, turn to Allah with prayers in this state more often.” Muslim (479). According to Abu Hurayrah (may Allah be pleased with him), it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: “A slave is closest to his Lord during prostration, so turn to Him with prayers more often in this state¹. In a word, all these periods: bowing to the ground during prayer, tashahhud before salam, after completing the prayer, are good and desirable for prayer. finally, the discussed opinion is clearly and unequivocally refuted by the fact that from the Messenger of Allah (peace and blessings of Allah be upon him) and his companions, many hadiths and asars are reliably transmitted that they did not just remember Allah after salam, but rather turned to Him with prayers ! And this will be discussed in more detail - with Allah's permission - in the next chapter.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹Muslim (482)"
                }
            ]
        },
        {
            "id": 15,
            "subtitle": "Hadiths and asars about supplications to Allah after completing the prayer",
            "text": "Ash-Shatibi said: “What is established from the Prophet (peace and blessings of Allaah be upon him) from his actions after prayer is either the remembrance of Allah (dhikr), in which there is no prayer (du'a), as his words: “O Allah, no one will hinder what You have given...” and similar words. Or this is a prayer that he made for himself, like his words: “O Allah, forgive me for what I did before and what I have not yet done...”, and similar prayers.” See “Fataua al-Imam al-Shatibi” (p. 128). As-San'ani said: “The hadiths transmitted about supplications after prayer are famous.” See “Subulu-Ssalyam” (8/308). It should be noted that in the prophetic Sunnah there are many authentic hadiths that clearly and clearly indicate that the Messenger of Allah (peace and blessings of Allah be upon him) said certain prayers after completing the prayer after salam. And the number of such hadiths with prayers after salam is so large that they are not inferior to the number of hadiths about certain types of remembering Allah and reading some surahs or verses after prayer! And in this chapter, with the permission of Allah, I would like to quote some of these hadiths so that the reader understands that the time after the completion of obligatory prayers is legal and desirable for prayers, which is confirmed by both the words of the Prophet (peace and blessings of Allah be upon him) and his actions.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 16,
            "subtitle": "Hadith of Saubana (may Allah be pleased with him)",
            "text": " • Sauban (may Allah be pleased with him) said: “Having finished praying, the Messenger of Allah (peace and blessings of Allah be upon him) always asked Allah for forgiveness three times, and then said: “O Allah, You are Peace and from You comes peace, blessed are You , O Possessor of greatness and generosity!” The transmitter of this hadith, al-Walid, asked al-Awza'i: “How exactly should one ask for forgiveness?” To which al-Auza’i said: “Say: “Astaghfiru-Allah, Astagfiru-Allah. \n\n استَغفرَ الله، استَغفرَ الله، استَغفرَ الله، اللَّهُمَّ أنتَ السَ ّلامُ ومنكَ السَّلامُ، تَباركتَ يَا ذَا الْجَلَالِ وَالْإكرَامِ \n\n",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹Muslim (591)"
                }
            ]
        },
        {
            "id": 17,
            "subtitle": "Hadith of Al-Bara ibn ‘Azib (may Allah be pleased with him)",
            "text": "• Al-Bara ibn ‘Azib (may Allah be pleased with him) said: “When we prayed behind the Messenger of Allah (peace and blessings of Allah be upon him), we preferred to be to his right, so that after the prayer he would turn first to us. And I heard him say: “My Lord, save me from Your punishment on the Day when You resurrect Your servants!” Muslim (709). \n\n  رَبِّ ‌قِنِي ‌عَذَابَكَ ‌يَوْمَ ‌تَبْعَثُ ‌عِبَادَكَ \n\n **Rabbi, qini ‘azabak yauma tab’asu ‘ibadak** \n Hafiz Ibn Rajab said: “This hadith mentions supplication after completing the prayer.” See “Fathul-Bari” (7/417). It should be noted that the Prophet (peace and blessings of Allah be upon him) after prayer turned to those praying behind him not only through the right side, but also through the left, as reliable hadiths convey about this. However, most often he turned precisely through the right side, as Ibn Mas'ud and Anas (may Allah be pleased with them) reported¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Zadul-ma’ad” (1/295), “Fathul-Bari” (2/334), “Mir’atul-mafatih” (3/303)."
                }
            ]
        },
        {
            "id": 18,
            "subtitle": "Hadith of 'Ali ibn Abi Talib (may Allah be pleased with him)",
            "text": "• 'Ali ibn Abi Talib (may Allah be pleased with him) said: “When the Messenger of Allah (peace and blessings of Allah be upon him) said salam after prayer, he said: “O Allah, forgive me what I have done before and what I have not yet done.” I did what I did secretly and openly, something in which I transgressed the boundaries, and something about which You know better than me! You are the One who pushes forward and You are the One who pushes back! There is no deity worthy of worship except You!” Muslim (771 /1-2/). \n\n ​اللهُمَّ ‌اغْفِرْ ‌لِي ‌مَا ‌قَدَّمْتُ ‌وَمَا ‌أَخَّرْتُ، ‌وَمَا ‌أَسْرَرْتُ ‌وَمَا ‌أَعْلَنْتُ، ‌وَمَا ‌أَسْرَفْتُ، ‌وَمَا ‌أَنْتَ ‌أَعْلَمُ ‌بِهِ ‌مِنِّي، ‌أَنْتَ ‌الْمُقَدِّمُ ‌وَأَنْتَ ‌الْمُؤَخِّرُ، ‌لَا ‌إِلَهَ ‌إِلا ‌أَنْتَ \n\n **Allahumma-gfirli ma qaddamtu, ua ma akhhartu, ua ma asrartu, ua ma a’lyantu, ua ma asraftu wa ma Anta a’lamu bihi minni. Antal-Mu'addim wa Antal-Mu'akhkhir, la ilaha illya Ant**\n The fact that Muslim cites two versions of this hadith, one of which says that these words were said before salam, and the other said after salam, does not deny that these words can be pronounced in both cases, for both versions of the hadith are authentic, as Hafiz al-Nawawi said. See al-Majmu' (3/465). But Sheikh al-Albani believed that in one of the two versions the transmitter made a mistake in conveying the hadith according to its meaning, and the Sheikh was inclined to believe that this prayer should be said precisely after the completion of the prayer, strengthening Muslim’s version of this with versions from Ahmad and Ibn Hibban . See “Asl syfa as-sala” (3/1021-1022). And this opinion is also strengthened by the fact that Imam Ibn Khuzayma cited in his collection exactly the version that says that this prayer is said after salam and called this chapter as follows: “A collection of prayers said after prayer and salam¹.",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Sahih Ibn Khuzaymah” (1/366)."
                }
            ]
        },
        {
            "id": 19,
            "subtitle": "Hadith of Abu Ayyub al-Ansari (may Allah be pleased with him)",
            "text": "• Abu Ayyub al-Ansari (may Allah be pleased with him) said: “Whenever I performed prayer behind your Prophet (peace and blessings of Allah be upon him), I heard him say after completing it: “O Allah! Forgive me all my sins and transgressions! O Allah, support me, help me and guide me to good deeds and morality, for, truly, no one will show me the way to them and will not turn away bad deeds and immorality from me, except You! -Ausat” (4442) and “as-Saghir” (610). Hafiz al-Haythami and al-Salihi called the isnad of the hadith excellent, and Sheikh al-Albani called this hadith good. See Majma'u-zawaid (10/111), Subul al-huda (8/170), Sahih al-Jami' (1266). اللَّهُمَّ ‌اغْفِرْ ‌لِي ‌خَطَايَايَ ‌وَذُنُوبِي ‌كُلَّهَا، ‌اللَّهُمَّ ‌وَانْعَشْنِي ‌وَاجْبُرْنِي ‌وَاهْدِنِي ‌لِصَالِحِ ‌الْأَعْمَالِ ‌وَالْأَخْلَاقِ، ‌إِنَّهُ ‌لَا ‌يَهْدِي ‌لِصَالِحِهَا ‌وَلَا ‌يَصْرِفُ ‌عَنِّي ‌سَيِّئَهَا ‌إِلَّا ‌أَنْتَ  / Allahumma-gfir li hatayaya wa zunubi kullaha! Allahumma, wa-n’ishni, wa-jburni, wa-khdini li-salihi-l-a’mali wal-ahlyak, innahu la yakhdi li-salihiha wa la yasrifu ‘anni sayi-aha illya Anta/. By the way, it should be noted that the hadith with exactly the same meaning is conveyed from the words of Abu Umama (may Allah be pleased with him), and it says that the Prophet (peace and blessings of Allah be upon him) said this prayer at the end of the prayer “dubur as- sala, both obligatory prayer and voluntary. at-Tabarani in “al-Kabir” (7982) by Ibn al-Sunni “Amalu al-yaumi wa-lleila” (117). Firstly, this version of Abu Umama's hadith is weaker than Abu Ayyub's hadith, since in his isnad there is a rejected narrator named 'Ali ibn Yazid al-Alkhani¹. Secondly, even if this hadith were reliable, it would indicate that the Prophet (peace and blessings of Allah be upon him) could pronounce this prayer both before and after salam, and this is if we agree that the words “dubur as-sala” means: the end of the prayer before salam. Thirdly, the version of Abu Umama, which says in general “dubur as-sala”, is concretized by the hadith of Abu Ayyub, which clearly states that the Prophet (peace and blessings of Allah be upon him) constantly said this prayer after completing the prayer. And this confirms what was said earlier, that basically the expression “dubur as-sala” refers to what is said after the prayer, as Hafiz Ibn Hajar spoke about it, and what is indicated by the words of the salaf, which were already quoted earlier .",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Tahrij Kitab Ibn al-Sunni” (1/168)."
                }
            ]
        },
        {
            "id": 20,
            "subtitle": "Hadith of Aisha (may Allah be pleased with her)",
            "text": "'Aisha (may Allah be pleased with her) said: “There was no such thing that the Messenger of Allah (peace and blessings of Allah be upon him), while in a meeting, reading the Quran or performing a prayer, did not say after this word: “Holy are You, O Allah and Praise be to You. There is no deity worthy of worship except You. I ask You for forgiveness and offer You my repentance. Ahmad (6/77), an-Nasai in “as-Sunan al-kubra” (9/123). Hafiz Ibn Hajar, Sheikh al-Albani and Sheikh Muqbil ibn Hadi confirmed the authenticity of the hadith. See “al-Nukat ‘ala Ibn al-Salah” (2/733), “al-Silsilya as-sahih” (3164), “al-Jami’ al-sahih” (995). سُبْحَانَكَ ‌اللهُمَّ ‌وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ ‌وَأَتُوبُ إِلَيْكَ  /Subhanaka-Llahumma wa bihamdika. La ilaha illa Anta. Astagfiruka ua atubu ileik/. These words of remembrance of Allah are legal to be said after prayer, and they also contain a plea for forgiveness. Sheikh Muqbil ibn Hadi cited this hadith in the chapter on the remembrance of Allah, said after prayer. See “al-Jami’ as-sahih” (2/141). By the way, this hadith also contains evidence that saying these words after reading the Quran is a legalized Sunnah. Imam an-Nasai named the chapter in which he cited this hadith as follows: “How should the reading of the Koran be completed?” However, in our time, this Sunnah has been replaced by an innovation, saying after reading the Koran: “Sadaqa-Llahul-‘Azym,” (The Great Allah has spoken the truth). Yes, Allah speaks only the truth, but saying this expression every time after reading the Quran is not legal and has no basis in Islam, as a result of which many scholars called it an innovation of the 20th century. The Salaf spoke the truth: If people introduce innovations into their religion, they will lose the Sunnah, in accordance with this innovation!¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “al-Bida’” (90), “Sharh usul al-i’tiqad” (1/104)."
                }
            ]
        },
        {
            "id": 21,
            "subtitle": "Hadith of Abu Marwan al-Aslami (may Allah be pleased with him)",
            "text": "• Abu Marwan al-Aslami said that Ka'b al-Akhbar swore to him by Allah, Who parted the sea for Musa (peace be upon him), saying: “We read in the Torah that the prophet Dawud (peace be upon him), when he completed his prayer, addressed Allah with the following prayer: “O Allah, put in order for me my religion, which You have made my protection, and put in order my worldly life in which I live! O Allah, verily, I resort to Your pleasure from Your anger, to Your forgiveness from Your punishment, and I resort to You from You! Nothing will be an obstacle to what You have given, and no one will give what You have deprived, and the wealth of those who have wealth will be useless before You!” Then Ka'b told me that the companion Suhayb ar-Rumi (may Allah be pleased with him) told him that Muhammad (peace and blessings of Allah be upon him) said the same words when he completed his prayer. an-Nasai (1346), al-Bazzar (2092), Ibn Khuzaima (745). The authenticity of this hadith was confirmed by Ibn Khuzaima, ad-Diya al-Maqdisi, Ibn Hajar, ‘Abdul-Qadir al-Arnaut. See “Sahih Ibn Khuzayma” (1/366), “al-Mukhtara” (8/66), “Nataij al-Afkar” (2/318), “Tahrij Jami’ al-usul” (4/229).  اللَّهُمَّ ‌أَصْلِحْ ‌لِي ‌دِينِي ‌الَّذِي ‌جَعَلْتَهُ ‌لِي ‌عِصْمَةً، ‌وَأَصْلِحْ ‌لِي ‌دُنْيَايَ ‌الَّتِي ‌جَعَلْتَ ‌فِيهَا ‌مَعَاشِي، ‌اللَّهُمَّ ‌إِنِّي ‌أَعُوذُ ‌بِرِضَاكَ ‌مِنْ ‌سَخَطِكَ، ‌وَأَعُوذُ ‌بِعَفْوِكَ ‌مِنْ ‌نِقْمَتِكَ، ‌وَأَعُوذُ ‌بِكَ ‌مِنْكَ، ‌لَا ‌مَانِعَ ‌لِمَا ‌أَعْطَيْتَ، ‌وَلَا ‌مُعْطِيَ ‌لِمَا ‌مَنَعْتَ، ‌وَلَا ‌يَنْفَعُ ‌ذَا ‌الْجَدِّ ‌مِنْكَ ‌الْجَدُّ  / Allahumma, aslih li dini-llazi ja’altahu li ‘ismatan, wa aslih li dunya-ya-llati ja’alta fiha ma’ashi. Allahumma, inni a'uzu-bi-ridaka min sakhatik, wa a'uzu-bi-'afuika min nikmatik, wa a'uzubika Mink. La mani'a lima a'tait, wa la mu'tyya lima mana't, wa la yanfa'u zul-jaddi minkal-jadd/. Sheikh Muhammad al-Ityoubi said: “The hadith from Suhayb, may Allah be pleased with him, is good (hasan). And if you say: “This hadith was called weak by Sheikh al-Albani because of the narrator Abu Marwan al-Aslami, about whom an-Nasai said: “He is not famous,” so how can this hadith be good?” then I will answer: Abu Marwan was considered reliable by al-Ijli and Ibn Hibban, and Hafiz al-Dhahabi in al-Kashif (3/376) said about him: “A resident of Medina, reliable.” And the hadith of a person of this level does not fall below good. In addition, this hadith was considered authentic by Ibn Khuzaima and Ibn Hibban, and Hafiz Ibn Hajar in Nataij al-Afkar said: “This hadith is good.” See Sharh Sunan an-Nasai (15/377). Imam an-Nasai named the chapter in which he cited this hadith as follows: “Another type of prayer that should be said after completing the prayer.” See Sunan an-Nasai (3/73). Also, Imam Ibn Hibban named the chapter in which he cited this hadith as follows: “A mention of what is desirable for a person to ask Allah Almighty for the benefits of his religion and worldly life after completing the prayer.” See “Sunan Ibn Majah” (5/373). Sheikh Muhammad al-Ityubi said, listing the benefits derived from this hadith: “The validity of turning to Allah with a prayer after completing the prayer through the mentioned prayer.” See Sharh Sunan an-Nasai (15/379). Moreover, this hadith indicates that making a supplication to Allah after prayer is the way of the messengers, and that the Prophet Daoud and the Prophet Muhammad (peace and blessings of Allah be upon them both) did this!¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “ad-Du'a ba'da al-maktuba” (p. 65)."
                }
            ]
        },
        {
            "id": 22,
            "subtitle": "Hadith of Ibn ‘Abbas (may Allah be pleased with him)",
            "text": "Ibn ‘Abbas (may Allah be pleased with him) said: “The Prophet (peace and blessings of Allah be upon him) addressed Allah with the following prayer: “My Lord, help me and do not help against me. Make me a winner and don't make me a loser. Make me cunning and do not grant cunning against me. Lead me to the straight path and make it easier for me to follow them, and help me against those who were at enmity with me. My Lord, make me very grateful to You, much remembrance of You, fearful of You, submissive to You, ashamed of You, weeping and repentant. My Lord, accept my repentance, cleanse me from my sins, answer my prayer and strengthen my arguments, make my heart straight and my tongue correct, and cleanse my heart from malice.” al-Bukhari in “al-Adab al-mufrad” (665), Abu Daud (1510), at-Tirmidhi (3551), Ibn Majah (3830). The authenticity of the hadith was confirmed by at-Tirmizi, al-Baghawi, ‘Abdul-Haqq al-Ishbili, Ibn Hajar, al-Albani. See “Sharh al-Sunnah” (5/176), “al-Ahkam al-usta” (4/328), “al-Amali al-mutlaqa” (p. 206), “Sahih Sunan Abi Dawood” (1353 ). Abu-l-Hasan at-Tanafisi asked Uaki'a, who was the transmitter of this hadith: “Is it possible to pronounce this prayer in Qunut?”, to which Uaki’a replied: “Yes.” See Sunan Ibn Majah (3030).  رَبِّ ‌أَعِنِّي ‌وَلا ‌تُعِنْ ‌عَلَيَّ، ‌وَانْصُرْنِي ‌وَلا ‌تَنْصُرْ ‌عَلَيَّ، ‌وَامْكُرْ ‌لِي ‌وَلا ‌تَمْكُرْ ‌عَلَيَّ، ‌وَاهْدِنِي ‌وَيَسِّرِ ‌الْهُدَى ‌إِلَيَّ، ‌وَانْصُرْنِي ‌عَلَى ‌مَنْ ‌بَغَى ‌عَلَيَّ، ‌رَبِّ ‌اجْعَلْنِي ‌لَكَ ‌شَكَّارًا، ‌لَكَ ‌ذَكَّارًا، ‌لَكَ ‌رَهَّابًا، ‌لَكَ ‌مِطْوَاعًا، ‌إِلَيْكَ ‌مُخْبِتًا، ‌لَكَ ‌أَوَّاهًا ‌مُنِيبًا، ‌رَبِّ ‌تَقَبَّلْ ‌تَوْبَتِي، ‌وَاغْسِلْ ‌حَوْبَتِي، ‌وَأَجِبْ ‌دَعْوَتِي، ‌وَثَبِّتْ ‌حُجَّتِي، ‌وَاهْدِ ‌قَلْبِي ‌وَسَدِّدْ ‌لِسَانِي، ‌وَاسْلُلْ ‌سَخِيمَةَ ‌قَلْبِي  /Rabbi a'inni wa la tu'in 'alaya, uansourni wa la tansur 'alaya, uamkurli wa la tamkur 'alaya, uakhdini wa yassiril-huda ilyaya, uansourni 'ala man bag'a 'alaya. Rabbi-j'alni laka shakkaran, laka zakkaran, laka rahhaban, laka mitua'an, laka mukhbitan, ileika auuahan muniban. Rabbi tak'abbal-taubati, wa'agsil-haubati, wa adjib da'uati, wasabit hujati, wa saddid lisani, wa'ahdi k'albi, waslul-sakhimata sadri/. Imam Abu Dawood cited this hadith in a chapter, which he called as follows: “The chapter on what a person should say after salam.” See “Sunan Abi Dawud” (1/558). Commenting on this chapter of Abu Dawud, Badruddin al-‘Aini said: “This chapter explains what the worshiper should say after completing the prayer.” See Sharh Sunan Abi Daud (5/416). Someone may object and say that this hadith itself does not say that this prayer is said precisely after the prayer! Yes, that’s how it is, this prayer is general, not specific by place or time, and any Muslim has the right to pronounce it whenever and wherever he wants. However, the act of Imam Abu Dawud indicates that the end of prayers is a suitable and desirable time for prayers, for this reason he wished to mention this prayer in this chapter, since there is no prayer better than a prophetic prayer!",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 23,
            "subtitle": "Hadith of Umm Salama (may Allah be pleased with her)",
            "text": "Umm Salama (may Allah be pleased with her) said: “Indeed, when the Messenger of Allah (peace and blessings of Allah be upon him) completed the morning prayer, he said after salam: “O Allah, verily, I ask You for useful knowledge, good fortune and deeds.” which will be accepted!” Ahmad (6/305), Ibn Majah (925). Hafiz Ibn Hajar called this hadith good, and Sheikh al-Albani called it authentic. See “Nataij al-afkar” (2/316), “Sahih Sunan Ibn Majah” (762). اللَّهُمَّ ‌إِنِّي ‌أَسْأَلُكَ ‌عِلْمًا ‌نَافِعًا، ‌وَرِزْقًا ‌طَيِّبًا، ‌وَعَمَلًا ‌مُتَقَبَّلًا  Imam Ibn Majah named the chapter in which he cited this hadith as follows: “What should be said after salam.” See “Sunan Ibn Majah” (1/289). Also, Hafiz ad-Diya al-Maqdisi cited this hadith in the chapter, which he called as follows: “On the remembrance of Allah after salam.” See “as-Sunan wal-ahkam” (2/139).  • ‘Aisha (may Allah be pleased with her) said: “Having performed the prayer of the Spirit, the Messenger of Allah (peace and blessings of Allah be upon him) said: “O Allah, forgive me and accept my repentance, verily You are the Forgiving, the Merciful!”  And he said these words a hundred times¹.  اللَّهُمَّ اغفِرْ لي وتُبْ عليَّ إنَّكَ أنتَ التوَّابُ الرحيمُ  **Allahumma-gfirli wa tub ‘aleya, innaka anta-tauuabu-rrahim**",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹al-Bukhari in “al-Adab al-mufrad” (619), an-Nasai in “al-Sunan al-Kubra” (6/39). Sheikh al-Albani called the isnad authentic. See Sahih al-Adab al-mufrad (482)."
                }
            ]
        },
       
        {
            "id": 24,
            "subtitle": "Hadith of Mu'az ibn Jabal and Ibn 'Abbas (may Allah be pleased with them)",
            "text": "From the words of Mu'az ibn Jabal and Ibn 'Abbas (may Allah be pleased with them) it is reported that the Messenger of Allah (peace and blessings of Allah be upon him) said: **My Lord, Blessed and Exalted in the best, appeared to me this night (in a dream). image and said: O Muhammad! Do you know what the high society (angels) argue about? I answered: No. Then He placed His hand between my shoulder blades that I felt a coldness on my chest, after which I knew everything that was happening in the heavens and on earth, and then He asked again: O Muhammad! Do you know what people argue about in high society?” I answered: Yes, about atonements (sins) and degrees! Atonement (for sins) is staying in the mosque after praying, walking to group prayers, and thoroughly performing ablution, despite the reluctance to do so (due to the cold). The Lord said: You are right, O Muhammad! The one who does this will live happily and die happily, and his sins will be like the day his mother gave birth! I said: As for the degrees, these are saying good words, spreading salam, feeding food and performing night prayers when all people are sleeping.” After this, He said:  O Muhammad, when you pray, say: “O Allah, verily, I ask You to perform good deeds, forsake sinful things and love the poor, and that You forgive me and have mercy and accept my repentance! And if You want to test Your servants, then take my soul to You without subjecting me to temptation!** ”Ahmad (1/368), at-Tirmidhi (3233). The authenticity of this hadith was confirmed by imams Ahmad, at-Tirmizi, Abul-Faraj as-Saqafi, as well as sheikhs Ahmad Shakir and al-Albani. See “al-Kamil” (8/61), “al-Fawaid” (146), “Tahrij al-Musnad” (3484), “Sahih at-Targhib” (408). All rights reserved.  اللَّهمَّ إنِّي أسألُكَ الطَّيِّباتِ، وتَركَ المُنكَراتِ، وحُبَّ المَساكينِ، وأنْ تَتُوبَ علَيَّ، وإذا أرَدْتَ فِتْنَةً في النَّاسِ فَتَوَفَّني غَيرَ مَفْتُونٍ  **Allahumma inni as'alyuka-tayibat, wa tarkal-munkirat, wa hubbal-masakin, wa an tatuba 'aleya, wa isa aradta fitnatan fi-nnas, fatauaffani gayra maftun** ¹",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹Hafiz ‘Abdul-Ghani al-Maqdisi cited this hadith under the chapter, which he called: “The chapter on the prayer pronounced after prayers.” See “Targhib ad-du'a” (p. 145). Sheikh ‘Ubaydullah al-Mubarakfuri said: “The words: “when you complete the prayer” mean: when you complete the prayer completely.” See “Mir’atul-mafatih” (2/439)."
                }
            ]
        },
        {
            "id": 25,
            "subtitle": "Hadith of Abu Musa al-Ash'ari (may Allah be pleased with him)",
            "text": "• Abu Musa al-Ash'ari (may Allah be pleased with him) said: “One day I came to the Prophet (peace and blessings of Allah be upon him) with water for ablution and after he performed ablution and prayer, he said: “Oh Allah! Forgive me my sins, make my abode spacious, and bless me in my inheritance! ”Ibn Abi Shayba (31363), Ahmad (4/399). Another version of this hadith mentions the addition that Abu Musa asked: “O Messenger of Allah, what is this prayer that you made?” To which the Prophet (peace and blessings of Allah be upon him) replied: “Did this prayer leave any benefit?” at-Tabarani in “ad-Du’a” (656), ‘Abdul-G’ani al-Maqdisi in “Targ’ib ad-Du’a” (79).  اللَّهُمَّ ‌اغْفِرْ ‌لِي ‌ذَنْبِي، ‌وَوَسِّعْ ‌لِي ‌فِي ‌دَارِي، ‌وَبَارِكْ ‌لِي ‌فِي ‌رِزْقِي  **Allahumma-gfir-li zanbi, ua wassi’-li fi dari, ua barik-li fi rizqi** The isnad of this hadith was called authentic by such hafiz and imams as an-Nawawi, Ibn al-Qayim and Ibn al-Mulyakkin, and Sheikh ‘Abdul-Qadir al-Arnaut called this hadith good. See “al-Adhkar” (p. 29), “Zadul-ma'ad” (2/354), “al-Badr al-munir” (2/279), “Tahrij Jami' al-usul” (5213 ). However, Hafiz Ibn Hajar said: “As for the assessment of the Sheikh (al-Nawawi) about the reliability of the isnad, there is doubt about this. After all, the transmitter Abu Midjlaz did not find Samura ibn Jundub and ‘Imran ibn Husayn, as ‘Ali ibn al-Madini said, and they died after Abu Musa. Therefore, there is doubt that Abu Midjlaz heard this hadith from Abu Musa.” See “Nataij al-afkar” (1/263). For this reason, Sheikh al-Albani considered this hadith weak. See “Gayatul-maram” (p. 94). Sheikh al-Albani considered this prayer to be reliable in its entirety, based on all versions, but without reference to either ablution or prayer. See Sahih al-Jami' (1265), Da'if Sunan at-Tirmidhi (82). But some imams believed that Abu Midjlaz not only found Samura, but also heard from him. Thus, Hafiz al-Dhahabi said in his biography: “He heard from Jundub ibn ‘Abdullah, Mu’awiyah, Ibn ‘Abbas, Samura ibn Jundub and Anas ibn Malik. And he transmitted in the form of mursal from ‘Umar, Huzaifa and the old companions.” See Tarikh al-Islam (3/196). And by the way, Sheikh al-Albani himself called the hadith that was transmitted by the same Abu Midjlaz from Abu Musa regarding the Uitr prayer in the path that an-Nasai gives (1728) reliable. See “Sahih Sunan an-Nasai” (1631), “Asl Syfa as-sala” (2/544). It should be noted that some imams in this hadith say that the Prophet (peace and blessings of Allah be upon him) said this prayer not after prayer, but after ablution. an-Nasai in “al-Sunan al-kubra” (9828), Abu Ya’la (7273), Ibn al-Sunni in “‘Amalu-l-yaumi wa-lleila” (28). Therefore, Imams an-Nasai and Ibn al-Sunni named the chapter in which they mentioned this hadith as follows: “What should be said after ablution.” Also, some scholars believed that this prayer is said both after ablution and after prayer. Thus, Imam al-Shaukani said about this prayer: “It is one of the words of remembrance of Allah associated with prayer and ablution, based on all versions.” See “Tuhfatu-zzakirin” (p. 186). However, Hafiz Ibn Hajar said: “We transmitted the addition “after ablution and prayer” from the collection “al-Kabir” of at-Tabarani through Musaddad, 'Arim and Muqaddam, and they all transmitted from Mu'tamir, which says: “performed ablution, and then a prayer and then he said...” This refutes the table of contents that Ibn al-Sunni made: “What should be said after ablution,” since these versions clearly state that these words were said after prayer.” See “Nataij al-afkar” (1/263). And Imam at-Tabarani cited this hadith in the section he called: “A collection of words spoken after prayers.” See ad-Du'a (2/1094). And strengthens the authenticity of the hadith under discussion and specifies the fact that this prayer is pronounced precisely after the prayers, a reliable asar from Abu Musa himself, who subsequently completed the prayer, uttered a similar prayer: • The sons of Abu Musa al-Ash'ari - Abu Burda and Abu Bakr said: “When Abu Musa (may Allah be pleased with him) finished his prayer, he said: “O Allah! Forgive me my sins, make my affairs easier for me, and bless me in my destiny! ”Ibn Abi Shaybah (3050, 31218). Sheikh al-Albani called the isnad of this asar reliable, and Sheikh Sa'd al-Shasri called the asar itself good¹.  اللَّهُمَّ ‌اغْفِرْ ‌لِي ‌ذَنْبِي، ‌وَيَسِّرْ ‌لِي ‌أَمْرِي، ‌وَبَارِكْ ‌لِي ‌فِي ‌رِزْقِي  **Allahumma-gfir-li zanbi, wa yassir-li amri, wa barik-li fi rizqi** The sons of Abu Musa al-Ash'ari, Abu Burda and Abu Bakr, said: “When Abu Musa (may Allah be pleased with him) finished his prayer, he said: “O Allah! Forgive me my sins, make my affairs easier for me, and bless me in my destiny! ”Ibn Abi Shaybah (3050, 31218). Sheikh al-Albani called the isnad of this asar reliable, and Sheikh Sa'd al-Shasri called the asar itself good. See “Tamamul-minna” (p. 96), “Tahrij al-Musannaf” (3/151, 16/141).  اللَّهُمَّ ‌اغْفِرْ ‌لِي ‌ذَنْبِي، ‌وَيَسِّرْ ‌لِي ‌أَمْرِي، ‌وَبَارِكْ ‌لِي ‌فِي ‌رِزْقِي  **Allahumma-gfir-li zanbi, wa yassir-li amri, wa barik-li fi rizqi**",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": "¹See “Tamamul-minna” (p. 96), “Tahrij al-Musannaf” (3/151, 16/141)."
                }
            ]
        },
        {
            "id": 26,
            "subtitle": "About the dispatch attributed to Sheikh al-Albani regarding the prayer after ablution",
            "text": "By the way, it should be noted that a false newsletter is being distributed on the Internet, which states that Sheikh al-Albani allegedly called the mentioned hadith from Abu Musa reliable in the version that this prayer is pronounced precisely after ablution, and then said: “We lost barakat in our homes due to the fact that we do not follow the Sunnah of our Prophet (peace and blessings of Allah be upon him) regarding this prayer said after ablution.” In fact, these words are falsely attributed to Sheikh al-Albani, and do not have any source on the works or records of the Sheikh. He didn't say those words! Moreover, they contradict what he himself wrote about in his writings and said in his notes. For example, in one of the recordings of the Sheikh, during a dialogue about the hadith under discussion, he said: “This hadith has two versions, one says that this prayer is said after ablution, and the other says that it is said after the prayer. And the version is that it is pronounced after prayer more strongly than after ablution. However, both versions are aborted.” Sl. “al-Mutafariqat” (No. 15).",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 27,
            "subtitle": "Hadith of Umar (may Allah be pleased with him)",
            "text": "Ar-Rabbi' ibn 'Umayla said: “When 'Umar (may Allah be pleased with him) completed his prayer, he would say: “O Allah, I ask You for forgiveness for my sins, and I ask You for direct guidance in my affairs, and I repent to You, so accept my repentance. O Allah, You are my Lord, so direct my desire towards You; place my wealth in my soul, bless me with what You have endowed, and accept from me, for verily You are my Lord!” Ibn Abi Shaybah (31234). The isnad of this asar is good. See “Inas al-bahasa” (p. 25).   اللَّهُمَّ أستغفرك لذنبي ‌وأستهديك ‌لمراشد ‌أَمْرِي وَأَتُوب إِلَيْك فتب عَليّ إِنَّك أَنْت رَبِّي، اللَّهُمَّ فَاجْعَلْ رغبتي إِلَيْك وَاجعَل غناي فِي صَدْرِي وَبَارك لي فِيمَا رزقتني وَتقبل مني إِنَّك أَنْت رَبِّي   However, Sheikh Sa'd al-Shasri considered this isnad interrupted, saying: “ar-Rabi” did not hear from “Umar.” See Tahrij al-Musannaf (16/148). But Imam al-Bukhari said that ar-Rabi’ ibn ‘Umaila heard from Ibn Mas’ud, and also found the turmoil of the apostates during the time of Khalid ibn al-Walid. See “at-Tarikh al-kabir” (3/270). Ar-Rabi' ibn 'Umaila is reliable according to unanimous opinion, and even his son - Ruqayn ibn ar-Rabi' found some companions. And if ar-Rabi’ experienced the turmoil of apostasy during the time of Khalid ibn Walid, who died in 21 AH. two years before the death of 'Umar, it is likely that he could have heard from 'Umar. And Allah knows best.  • Also, ‘Asim ibn Damra reported that Caliph ‘Ali ibn Abi Talib (may Allah be pleased with him) addressed Allah after prayer with a long supplication. Ibn Abi Shaybah (31220). Asar is good. See Tahrij al-Musannaf (16/141).  • Ibn ‘Abbas (may Allah be pleased with him) in the interpretation of the Words of Allah: “And when you are free, be active” (94: 7), said: “When you have completed the obligatory prayer, then turn to Allah with a prayer.” at-Tabari in “at-Tafsir” (24/496), Ibn Abi Hatim in “at-Tafsir” (19397). The message is good (hasan). See “as-Sahih al-masbur” (4/647), “Tafsir al-mamun” (8/489).  The mentioned hadiths and asars clearly indicate that turning to Allah after prayer is a legitimate, established and even desirable act! And it should be noted that in this chapter only those hadiths and asars were mentioned that clearly stated that these prayers were pronounced precisely after the completion of the prayer after salam. After all, if all the hadiths were mentioned as an argument, which say that this or that prayer was mentioned by the Prophet (peace and blessings of Allah be upon him) or his companions during “dubur as-sala”, which in the terminology of the early imams means “after prayer” ”, then it could take dozens of pages. In a word, the mentioned fifteen hadiths and asars of this chapter refute the erroneous statements of those who categorically declare that neither the Prophet (peace and blessings of Allaah be upon him) nor His companions ever called upon Allah with supplications after completing the prayer!",
            "url": "",
            "isAudioUrl": false,
            "sources": [
                {
                    "source": ""
                }
            ]
        }
    ]
}