{
  "id": "14",
  "author": "Islam forum",
  "category": "Fiqh",
  "published": "2015",
  "lang": "En",
  "title": "Ramadan a comprehensive guide",
  "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FRamadan.jpeg?alt=media&token=1252f912-363c-4dd7-b114-94f02402e1b8",

  "chapters": [
    {
      "id": 1,
      "subtitle": "On the merits of the month of Ramadan and fasting in it",
      "text": "It is reported from Abu Hurairah that the Messenger of Allah ﷺ said: “When Ramadan comes, the gates of Paradise are opened, the gates of Hell are closed, and the devils are chained¹.”\nHafiz Ibn Rajab cited this hadith and said: “The Messenger of Allah ﷺ rejoiced his companions with the onset of Ramadan. Scholars said: “This hadith is the basis for the permissibility of people congratulating each other on the onset of the month of Ramadan.” See al-Lataif 279.\nIt is also reported from Abu Huraira that the Messenger of Allah ﷺ said: “When the first night of the month of Ramadan comes, the shaytans of the Maarid from among the jinn are put in chains; and all the gates of Hell are closed without exception; and all the gates of Paradise are opened without exception, and then the herald will call: “O one who strives for good, begin (to do good)! O he who strives for evil, stop!\" And Allah has people in this month who will be freed from punishment in Hell, and this liberation will occur every night of Ramadan.\" at-Tirmidhi 682, Ibn Majah 1642, al-Hakim 1/421. The authenticity of the hadith was confirmed by Sheikh al-Albani.\nMaarids are shaitans from among the jinn who have superpowers.\nThis hadith indicates that not all the devils are chained in Ramadan, but only the ma'arid from among them, as Imam Ibn Khuzaima pointed out in his “Sahih” 3/188.\nIt is reported from Ibn 'Abbas that the Messenger of Allah ﷺ said: “Umrah performed in Ramadan is equivalent to Hajj.” al-Bukhari 1863, Muslim 1256.\nThe hadith says that the reward for Umrah performed in Ramadan is equivalent to Hajj, but this does not mean that Umrah in Ramadan can replace performing a full Hajj². From Abu Sa'id al-Khudri it is reported that the Messenger of Allah ﷺ said: “Verily, Allah Almighty has people whom He frees from Fire every day and night of Ramadan. And truly, every Muslim both on the night and on the day of Ramadan receives the answer to your prayer! al-Bazzar. The hadith is authentic. See Sahih at-targib 1002. The Messenger of Allah ﷺ also said: “Whoever fasts during Ramadan with faith and hope for Allah’s reward will have his previous sins forgiven.” al-Bukhari 38, Muslim 760. The Messenger of Allah ﷺ also said: “Performing the five obligatory prayers, participating in each subsequent Friday prayer after the previous one, and fasting from Ramadan to Ramadan, atone for the sins committed between them, unless there were serious sins among them.” Muslim 233. Major sins are forgiven only with sincere repentance. From Abu Hurayrah (may Allah be pleased with him) it is reported that the Messenger of Allah said: “Every good deed of the son of Adam will be multiplied, and the smallest reward for a good deed will be tenfold, but it can increase up to seven hundredfold. Allah Almighty says: “With the exception of fasting, for truly, fasting is done for My sake, and I will repay for it, for a person refuses the satisfaction of his desires and his food for My sake! Two joys await the fasting person: one when he breaks his fast, and the other when he meets his Lord. And truly “The smell from the mouth of a fasting person is more pleasant to Allah than the scent of musk!” Muslim 1151. Allah Almighty has singled out fasting from all the good deeds for the reason that, unlike prayer, alms, hajj and jihad, fasting has the least presence of show. See Fathul-Bari 4/107. Hafiz Ibn 'Abdul-Barr said: The words of the Almighty are enough: 'Fasting is for me' to indicate the dignity of fasting and its advantages over other worships! See Majalisa Shahri Ramadan 15. It is reported from the words of Sahl that the Messenger of Allah ﷺ said: “Indeed, there is a gate in Paradise called “ar-Rayyan” through which those who fast will enter on the Day of Resurrection, and no one will enter through this gate except them. It will be said: “ Where are those who observed the fast? - and they will come forward, and no one else will pass through this gate except them. When they enter, this gate will be closed, and no one else will enter through it. al-Bukhari 1896, Muslim 1152. The Messenger of Allah ﷺ said: “Fasting is a shield with which the servant of Allah is protected from Fire.” at-Tabarani in Kabir. Hadith is good. See Sahih al-Jami 3867. The Messenger of Allah ﷺ also said: “Whoever dies while fasting will enter Paradise.” al-Bazzar. Sheikh al-Albani confirmed the authenticity of the hadith. See Sahih al-Jami 6224. The Messenger of Allah ﷺ also said: “Fasting and the Quran intercede for the servant of Allah on the Day of Judgment. Fasting says: “My Lord! I deprived him of food and drink in the bright part, so let me intercede for him! And the Quran says: My Lord! I deprived him of sleep at night, so let me intercede for him! - and their intercession is satisfied³.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Al-Bukhari 1899, Muslim 1079)"
        },
        {
          "source": "²(See Sharh Sahih al-Bukhari 4/438 by Imam Ibn Battal, and Sharh Sahih Muslim 9/285 by Imam al-Nawawi)"
        },
        {
          "source": "³(Ahmad 2/174. The authenticity of the hadith was confirmed by Imam al-Hakim, Hafiz al-Munziri, Sheikh Ahmad Shakir and al-Albani. See Sahih at-targib 973)"
        }
      ]
    },
    {
      "id": 2,
      "subtitle": "The spiritual side of fasting and the behavior of the fasting person",
      "text": "Allah Almighty commanded the community of Muhammad ﷺ to fast, saying: **O you who believe! Observing As-Saum (the fasting) is prescribed for you as it was prescribed for those before you, that you may become Al-Muttaqûn (the pious).** (Al-Baqarah 2: 183). When Almighty and All-Wise Allah commands or prescribes any law to His slaves, he usually only mentions the command without explaining its wisdom, because the general wisdom of Allah is that, by assigning a duty to His slaves, He tests them and identifies those who will obey Him and those who will not obey Him. However, in this verse, Allah mentions something not often found in the noble Quran, which is that He explains the reason for the command to fast by saying: “maybe you will become God-fearing.” What is “fear of God” (at-taqwa)? Talk ibn Habib said: “When troubles (fitnah) arise, they extinguish them with the help of piety.” He was asked: “What is fear of God?” He replied: “God-fearing is submission to Allah, based on the light coming from Allah, in the hope of reward from Allah. God-fearing is abandoning disobedience to Allah, based on the light from Allah, and out of fear of Allah’s punishment.” Ibn al-Mubarak 1343, Ibn Abi Shaiba 30356. Sa'id ibn Jubair said: “Truly, fear of Allah is what comes between you and sins, this is true fear. Remembrance of Allah (dhikr) is obedience to Allah, and he who obeys Allah remembers Allah. As for the one who does not obey Allah, he is not a remembrance of Allah, even if he often glorifies Him and reads the Quran a lot!¹ Our Prophet ﷺ explained the divine wisdom in the injunction of fasting, saying: **If one does not eschew lies and false conduct, Allah has no need that he should abstain from his food and his drink.** )Al-Bukhari 1903(. Imam Abu Bakr ibn al-'Arabi said: “Whoever does what is said in this hadith will not be rewarded for his fast!” See Fathul-Bari 4/117. From this hadith it follows that if a fasting person does not stop committing sins, lying and swearing, then Allah does not pay attention to the person’s refusal to eat, drink and intimacy with his wife. As for the needs of Allah in the literal sense of the word, Allah is Rich and lacks absolutely nothing. See Ithaful-Kiram 187. The wisdom in the command to fast is not only that believers distance themselves from pleasant, permitted and good things, although this is obligatory for a fasting person, but this is not the only required thing that is included in fasting. Allah Almighty concludes His command to fast with the statement: “perhaps you will become God-fearing.” This means that the wisdom of the injunction of fasting is that a Muslim should increase his worship of Allah Almighty during fasting, become more submissive than he was before and leave everything that is bad. A person who fasts and does not give up everything bad during the month of Ramadan is like someone who builds a palace by destroying a city. The Messenger of Allah ﷺ said: There are people who fast and get nothing from their fast except hunger, and there are those who pray and get nothing from their prayer but a sleepless night. )Ibn Majah 1690. The authenticity of the hadith was confirmed by Sheikh al-Albani(. This means that Allah did not mean by imposing the obligation of fasting, which consists of abstaining for a certain time, known to everyone, that people should only abstain from food and drink and marital intimacy. They must also abstain from what Allah, the Almighty and the Glorious, has forbidden from sins and acts of disobedience to Him, and among this is lying in words and deeds. Thus, it becomes clear to us that fasting is not only abstinence from food and drink, but also the renunciation of such forbidden things as: backbiting, gossip, perjury, lying and other forbidden things that are known to everyone. From Abu Hurayrah it is reported that the Messenger of Allah ﷺ said: “Fasting is not just abstaining from food and drink. Truly, fasting is abstaining from idle talk and foul language!” Ibn Khuzayma, Ibn Hibban, al-Hakim. The hadith is authentic. See Sahih at-targhib 1082. Every Muslim must know that acts that break the fast are not only physical actions, known to everyone, such as eating, drinking and intercourse. Fasting is not just about abstaining from it. Therefore, some of the scholars divide things that break fasting into two categories. Many preachers who admonish people during Ramadan, when talking about things that break the fast, only mention legal norms such as eating, drinking and sexual intercourse. But they should also focus on the second category of things that break the fast. As for the one who limits his fast only to abstinence from food, drink and sexual intercourse, continuing to persist in the bad behavior that was characteristic of him before Ramadan, then this is not a fast that is required in accordance with the wise sense of the law of this noble month, on which our Almighty Lord indicates in His saying, “perhaps ye may become God-fearing.” Therefore, we advise and remind our Muslim brothers to remember another category of things, intangibles, that devalue fasting, and this is something that preachers and people who seek to guide people to the right path rarely talk about. Not to mention ordinary people who don’t even know about this category of things that break the fast. Every Muslim should remember the numerous instructions of the Prophet ﷺ regarding the troubles of the tongue, and it is better to remain silent than to utter something that is harmful or has no benefit or necessity, especially in this great month. From the words of Mu'adh ibn Jabal it is reported that the Messenger of Allah ﷺ said: “Truly, you will not cease to be in prosperity while you remain silent. If you begin to speak, it will be for you or against you.” at-Tabarni in al-Kabir 2/73. The hadith is authentic. The one who fasts in this glorious month should be more diligent in worship and obedience to Allah; bear the insults caused by people, do not quarrel and do not raise your voice. If a fasting person is scolded, he should show maximum restraint and say: “I am fasting,” as stated in the hadith: “Let none of you use foul language or raise his voice on the day of fasting, and if anyone scolds him or starts quarrel with him, let him say: “Truly, I am fasting.” al-Bukhari 1904, Muslim 1151. You should also try to distance yourself from sins, including lowering your gaze, despite what is forbidden. The Messenger of Allah ﷺ said: “The eyes of three will not see the Fire on the Day of Judgment: the eyes that cried out of fear of Allah; the eyes of the one who was a guard in the path of Allah, and the eyes that were downcast at the sight of what is forbidden by Allah.” Ibn 'Asakir in at-Tarikh 1/297. Hadith is good. See al-Silsila al-Sahiha 2673. From Ibn Mas'ud it is reported that the Messenger of Allah ﷺ said: “Truly, fasting is amanah (given for safekeeping), so let each of you protect what has been entrusted to him!” al-Kharait in Makarimul-ahlyak. Hafiz al-Iraqi called the isnad of the hadith good².",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Abu Nu'aym in al-Hiliyya 4/276)."
        },
        {
          "source": "²(See Tahrij al-Ihya 1/354)."
        }
      ]
    },
    {
      "id": 3,
      "subtitle": "Fasting Values | Ibn al-Qayyim",
      "text": "I order you to fast. A fasting person is like a person in a crowd. With him is a package containing a musk; its spreading smell pleases both himself and others. The smell of a fasting person is better before the Almighty than the smell of this musk. The Prophet ﷺ compared a fasting person to a person in his pocket, who has a bundle of fragrant, invisible to the eye of a stranger, musk. In the same way, the one who holds the fast, no one sees or feels this matter. A true faster is one who controls his organs from committing sin, his tongue from lying, obscenity and nonsense, his stomach from eating and drinking, his genitals from copulation. He does not say or do anything to spoil the fast Only righteous words and actions emanate from him, which are likened to the pleasant smell of the bearer of a bundled musk. He who communicates with a fasting person receives benefit; he is protected from idle talk, lies, debauchery and injustice. This is fasting in the full sense of the word, and not simply abstaining from food and drink An authentic hadith says: “If (during fasting) a person does not stop lying and acting on lies, then Allah does not need him to give up food and drink.” (Ahmad 2/452, 505, Bukhari 2/99, 100 and 10/394), another hadith says that “it is quite possible that his share of fasting will be only hunger and thirst.” (Ahmad 2/373. The Sheikh of Albania cited it in his collection of authentic hadiths under number 3484) That is, fasting for the organs of the body means abstaining from committing sin, and for the stomach - from drinking and eating. Eating and drinking interrupt and break the fast, and sins committed reduce the reward for it and destroy its fruits, nullifying this matter There is disagreement among scholars about the smell of the breath of a fasting person, whether this refers to this world below or the future The respected Sheikh Abu Muhammad Izid-Din ibn Abdes-Salam was inclined to believe that this concerns only this world, and he wrote his research on this. Sheikh Abu Amr believed that this applies to both worlds and wrote a book to refute the first opinion. Abu Amr relied on the evidence of Abu Hatim ibn Hibban, in the “Collection of authentic hadiths”, of which there is a chapter: “Explanation of the fact that the smell from the mouth of a fasting person is dearer to Allah than the smell of misk.” It contains a hadith from Amash from Abu Salih from Abu Hurayrah that the Prophet, peace be upon him, said: “All the deeds of the son of Adam (are done for) him, except fasting. Verily, he is for My sake, and I will reward him for him. The smell from the mouth of a fasting person will be sweeter to Allah than the smell of musk. The next chapter is called: “Explanation of the fact that the smell from the mouth of a person fasting on the Day of Judgment is more pleasing to Allah than the smell of misk.” It contains a hadith from Jurayj from Ata from Abu Salih az-Zayat what he heard as the Prophet, peace be upon him: “The Great and Mighty Allah said: “All the deeds of the son of Adam (are done for) him. Except for fasting, for fasting is for Me, and I reward it. And the bad smell from the mouth of a person fasting on the Day of Judgment is more pleasant to Allah than the aroma of musk. And the fasting person experiences joy twice: when breaking the fast and when meeting his Lord. (Bukhari 10/310, Muslim 1151) After this, in the chapter: “Explaining that the smell from the mouth of a fasting person in this world is sometimes better than the aroma of musk” and cited the hadith of Shugba from Suleiman from Zakuan from Abu Huraira that the Prophet ﷺ said: “Every (good) deed of the son of Adam will be multiplied, (and the smallest reward) for a good deed will be tenfold, (but can increase) up to seven hundredfold. Allah Almighty said: “With the exception of fasting, for, verily, fasting (is done) for My sake, and I will reward for it, (since a person ) refuses food and drink for My sake and I will reward him! Two joys await the fasting person: one when he breaks his fast, and the other when he meets his Lord, and, verily, the smell from the mouth of a fasting person is dearer to Allah than the fragrance of musk!¹. Sheikh Abu Muhammad argues for his opinion with a hadith in which the pleasantness of the breath of a fasting person is mentioned in the context of the Day of Judgment. It remains for me to add that there is one more proof of the correctness of his words in the hadith cited in both reliable collections: “I swear by Him in Whose Hand my soul is, anyone who receives a wound in the path of Allah will certainly appear on the Day of Resurrection with his bleeding wound, which will the color of blood, and the aroma (of it) will be the aroma of musk. (Bukhari 6/15, Muslim 1876). Ibn Abbas said: “A good deed gives radiance to the face (of a person), gives light to the heart, strength to the body, increases food and inspires love in creation. A bad deed darkens the face, darkens the heart, gives weakness to the body, reduces food and causes hatred creations (in relation to man). Uthman ibn Affan said: “Whatever a person does, Allah gives him the appropriate attire. If the deed is good, it is good, if not, then it is bad.” It is a well-known fact, for discerning people and for simple ones, that a pleasant, tart aroma emanates from pious, God-fearing people. The fragrance of the spirit permeates their body and clothing. For sinful people it’s the other way around. A spiritually sick person, that is, a person whose heart is polluted, will not notice either this or that. Illness will prevent you from doing this. These words are an extremely clear statement of the problem. Allah Almighty is more knowledgeable about the correctness of this².",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Muslim 1151)"
        },
        {
          "source": "²(See Ibn al-Qayyim Al-Wabil al-Sayyib p. 34-36)"
        }
      ]
    },
    {
      "id": 4,
      "subtitle": "Do good deeds and bad deeds increase during the month of Ramadan?",
      "text": "Yes, good and bad deeds are multiplied due to the dignity of the time or place of their commission. But between the multiplication of good deeds and the multiplication of bad deeds, there are the following differences: - good deeds increase both in quantity (for one good deed performed, Allah grants ten or more such good deeds) and in the degree of reward. - when we talk about the multiplication of bad deeds, we mean an increase in the severity of the sin, and that the punishment for such a sin will be more severe, and as for their number, each bad deed is recorded as one and is not multiplied. In Matalib uli al-Nuha 2/385 it is said: “Good and bad deeds are multiplied in places of special merit, such as Mecca, Medina, Jerusalem and mosques. They are also multiplied due to the virtue of time like Friday, the forbidden months and Ramadan. As for the increase in good deeds, there is no disagreement about this, but regarding the increase in bad deeds, scholars disagreed, and some, following the opinion of Ibn 'Abbas and Ibn Mas'ud (may Allah be pleased with them), said that evil deeds also increase But some researchers objected to them by saying: “They (Ibn 'Abbas and Ibn Mas'ud) meant an increase in the severity of sin and the severity of the punishment for it, and not an increase in the number of bad deeds. Sheikh Ibn Baz (may Allah have mercy on him) was asked the question: “Does a Muslim achieve forgiveness of both small and major sins through fasting? And do sins multiply in Ramadan? Answer: “For a Muslim in Ramadan, as well as at any other time, it is legal to fight with his soul, which always commands evil. Fight with it until it becomes a peaceful soul, commanding good and striving for every good thing. A person must fight with the enemy of Allah - Iblis, in order to protect himself from his evil and temptation. A Muslim in this mortal world is constantly in a great struggle with his soul, his passions and the shaitan. Therefore, a person must repent more before the Almighty, and all the time turn to Him with prayers for forgiveness .But times differ in their merits. Thus, the month of Ramadan, the best month of the year. It is the month of forgiveness, mercy and liberation of slaves from Fire. If the place and time are respectable, then the good deeds done in them are multiplied, and the sin for bad deeds becomes even more serious. And since Ramadan has high dignity and position, the sin of a bad act committed in Ramadan is more serious than committing the same act at another time, just as the reward for doing deeds pleasing to Allah in Ramadan exceeds the reward for doing these the same thing at another time. Therefore, a Muslim should take advantage of this blessed month and do as many deeds as possible that are pleasing to Allah and abandon evil deeds, perhaps the Almighty and Great Allah will show him mercy and accept his deeds, and help him to maintain integrity 1. But as already said, every bad deed is always recorded as one, and it does not increase in number, neither in Ramadan nor at any other time. As for a good deed, for every one good deed - ten similar to it and more, as Almighty and Great Allah said about this (meaning translation): “Whoever comes with a good deed, for him - ten similar to it, and whoever comes evil will only be repaid to those like him, and they will not be treated unjustly.” (6:160). And there are many verses on this topic. The same is true for a place that has special dignity as two noble and protected territories (Mecca and Medina). A good deed performed in these territories increases both in quantity and in the degree of reward. The evil deeds committed in them do not increase in number, but the severity of their sin and punishment increase, as was previously noted. And truly, Allah alone provides assistance¹. Shaykh Ibn 'Uthaymeen (may Allah have mercy on him) said: “A good and bad deed is multiplied due to the dignity of the time and place of its commission. A good deed is multiplied both in quantity and in the degree of reward, and a bad deed is multiplied only in the severity of the sin and in the severity of the punishment for him, and does not increase in number. After all, Allah Almighty said in Surah al-An'am, revealed in Mecca (meaning translation): **Whoever brings a good deed shall have ten times the like thereof to his credit, and whoever brings an evil deed shall have only the recompense of the like thereof, and they will not be wronged.** (6:160). He also said (meaning translation):  **and whoever inclines to evil actions therein or to do wrong him We will give them a taste of painful suffering.** (22:25). Allah did not say: we will multiply their deeds, but said:  **We will give them a taste of painful suffering.** Therefore, the multiplication of a bad deed in Mecca or Medina will only be in the severity of sin. That is, the punishment will be more painful and painful , in accordance with the words of the Almighty (meaning translation): “Those who are inclined in it (the Sacred Mosque) to injustice, **We will give them a taste of painful suffering.** (22:25)²",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Majmu' Fataua wa Makalat Mutanauui'a 15/446. This refers to the unwavering fulfillment of all the commands of Allah and the renunciation of everything prohibited by Him)"
        },
        {
          "source": "²(See ash-Sharh al-Mumti 7/262)"
        }
      ]
    },
    {
      "id": 5,
      "subtitle": "Congratulations on the beginning of the month of Ramadan",
      "text": "Question: “Then, when Ramadan comes, we often hear people wishing each other barakah on the occasion of its arrival, saying: “mabrouk 'alaika shahru ramadan” (May you have a lot of barakah this month). Is there any reason for this? basis in Sharia? Answer: “There is no problem in congratulating the arrival of Ramadan, since the Prophet ﷺ pleased his companions with the arrival of Ramadan and encouraged them to try to do as many good deeds as possible. As the Almighty said: “Say: This is the mercy and mercy of Allah.” Let them rejoice in this, for it is better than what they accumulate (Surah Yunus, 58) Congratulations associated with the arrival of this month and joy in honor of it indicate a desire for good. And our salafs rejoiced each other with the arrival of this month, following the Prophet ﷺ in this. As it came in the long hadith of Salman, in which the Prophet ﷺ said: “Oh, people, a blessed month has come to you.” Salih al-Fawzan, Fatwa No. 1744, “Congratulations on the advent of the month of Ramadan” in addition to the answer of Sheikh Fauzan, the hadith from Abu Hurayrah that the Messenger of Allah ﷺ said: “Ramadan, the blessed month, has come to you! Allah Almighty and Great has made fasting in this month! In it, the gates of heaven are opened and the gates of Hell are closed, and the devils are chained in chains! And Allah has one night in this month, which is better than a thousand months. And whoever is deprived of the benefit of this night is deprived! an-Nasai 2106. The hadith is authentic. See at-Ta'lik al-gharib 2/69 Hafiz Ibn Rajab, citing this hadith, said: “The Messenger of Allah pleased his companions with the onset of Ramadan. And some scholars said: “This hadith is the basis for the permissibility of people congratulating each other on the onset of the month of Ramadan.” See Lataiful-ma'arif 156. Sheikh Ibn Baz, al-Shanqiti and others said the same thing Question: “Is it possible to say “Ramadan Kareem? Answer of Sheikh Ibn Uthaymeen, may Allah Almighty have mercy on him: “The position of the words “Ramadan Kareem” is that it is wrong. And there should only be the words “Ramadan Mubarak” and the like, because Ramadan is not the one that bestows so that Be generous. Only Allah Almighty is the One who establishes benefit in him and grants it throughout the month.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": ""
        },
        {
          "source": ""
        }
      ]
    },
    {
      "id": 6,
      "subtitle": "Conditions without which the fasting cannot be valid",
      "text": "**Confession of Islam** Confession of Islam is the most important condition that underlies the acceptance of all actions. Allah Almighty said:  **And whosoever disbelieves in Faith then fruitless is his work; and in the Hereafter he will be among the losers.** (al-Maida 5:5). The Great and Almighty Allah also said: **And indeed it has been revealed to you (O Muhammad), as it was to those (Allâh’s Messengers) before you: If you join others in worship with Allâh, (then) surely (all) your deeds will be in vain, and you will certainly be among the losers.** (az-Zumar 39: 65).\n**Abstinence** from everything that violates fasting in the form of food intake, liquids, intercourse, is a condition of fasting. See Tuhfatul-fuqaha 1/537.\n**Time** it means fasting from dawn to sunset. Allah Almighty said: **...and eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night)** (al-Baqarah 2: 187).\n**Intention** Narrated by 'Umar ibn al-Khattab (may Allah be pleased with him) that the Messenger of Allah ﷺ said: **(The value of) an action depends on the intention behind it. A man will be rewarded only for what he intended.** al-Bukhari 1, Muslim 1907. This great hadith indicates that any act that is not performed for the sake of Allah is not valid, and that the one who does the act not sincerely will not gain anything good either in this world or in the next. Imam Ibn al-Mundhir said: The words of the Prophet ﷺ: Verily, deeds are judged only by intentions” indicate all types of deeds, and there is no exception to this for any deed, be it obligatory or voluntary. See al-Awsat 1/371.\n**Having the ability to fast** it means having the health to observe fasting, as well as cleansing from menstruation and postpartum bleeding. See “Hashiya ad-Dusuki” 1/509.\n",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": ""
        },
        {
          "source": ""
        }
      ]
    },
    {
      "id": 7,
      "subtitle": "On the inadmissibility of leaving the Ramadan fast without a reason",
      "text": "Anyone who ate during the daylight hours of Ramadan disobeyed Allah and His Messenger ﷺ and committed a great sin, for which he should bring great repentance. All scholars are unanimous in the opinion that a person who refuses to fast due to denial of its obligatory nature is unfaithful, since the Quran and Sunnah contain direct instructions in favor of the obligatory nature of fasting. If a person does not fast because of laziness and negligence, without having an acceptable justification from the point of view of Sharia, but without denying the obligation of fasting, then, according to the general opinion of all scholars, he is a wicked person, but not an infidel, and he should bring great repentance and not do such a thing. henceforth. See “Ithaf Ahlul-Islam bi hususyati-ssyam” 72. Abu Umama al-Bahili said: I heard the Messenger of Allah ﷺ say: **Once in a dream two people came to me, and taking me by the shoulders, they led me to a hard-to-reach mountain and said: “Get up.” I replied: Truly I cannot. They said, We will make it easy for you. And I began to climb until I reached the top of the mountain, and suddenly I heard strong screams. What are these screams? - I asked. These are the cries of the inhabitants of Fire, they answered. Then they led me further, and I saw people hanging by their veins, their cheeks were torn and bleeding. I asked them:  Who are these people? They replied: These are those who broke their fast ahead of time¹.**  If such severe punishment is imposed on those who neglected fasting and broke their fast ahead of time, it is difficult to imagine what will happen to those who did not fast at all without a good reason! Ibn Mas'ud (may Allah be pleased with him) said: “Whoever breaks the fast of one day of Ramadan without a valid reason will not be able to compensate for it (in full), even if he fasts throughout his life until he meets Allah , and if He wishes, He will forgive him, and if He wishes, He will punish him. Ibn Abu Shaybah 9784. Isnad is authentic. Imam al-Dhahabi (may Allah have mercy on him) said: “Believers generally believe that anyone who breaks the fast of Ramadan without a good reason is worse than an adulterer, a tax collector and a drunkard. Moreover, they doubt his Islam and believe his heretic. See al-Kabair 78.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Al-Nasai in Sunanul-kubra 3273. The authenticity of the hadith was confirmed by Imam al-Hakim, al-Dhahabi, Hafiz al-Haythami and Sheikh al-Albani)."
        }
       
      ]
    },
    {
      "id": 8,
      "subtitle": "How should we determine the beginning and end of the month of Ramadan?",
      "text": "The onset of Ramadan is determined in two ways: 1. The discovery of the month of Ramadan in the sky. If a crescent moon is seen on the night from the twenty-ninth to the thirtieth of Sha'ban, then this means that the month of Ramadan has arrived, during which it is necessary to fast, as Allah Almighty said: **So whoever of you sights (the crescent on the first night of) the month (of Ramadan i.e. is present at his home), he must observe Saum (fasts) that month.** (al-Baqarah 2: 185). 2. By establishing the end of the preceding month of Sha'ban. If thirty days of Sha'ban have passed, then the thirty-first day will definitely fall on the first day of Ramadan. The Messenger of Allah ﷺ said: **Fast when you see it and break your fast when you see it, and if the weather is cloudy treat Sha‘ban as having thirty days¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bukhari 1909, Muslim 1081)"
        }
       
      ]
    },
    {
      "id": 9,
      "subtitle": "The testimony of how many Muslims is needed to record the beginning and end of Ramadan?",
      "text": "To capture the vision of the crescent moon of Ramadan, the testimony of one pious Muslim is required. Ibn 'Umar said: “People tried to see the new moon, and I informed the Prophet ﷺ that I saw it. Then the Prophet ﷺ decided to fast and commanded people to do the same¹. The authenticity of the hadith was confirmed by the imams Ibn Khuzaimah, Ibn Hibban, al-Hakim, Ibn Hazm, az-Zahabi, al-Munziri, an-Nawawi, Ibn Hajar, al-Albani. As for the end of the month of Ramadan and the vision of the crescent of Shawwal, then for its recording there must be two testimonies of righteous Muslims. It is reported that 'Abdur-Rahman ibn Zayd ibn al-Khattab, during a sermon on the day of doubt about the onset of Ramadan, said: “Verily, I sat among the companions of the Messenger of Allah ﷺ and asked them (about the beginning of fasting), and they told me that the Messenger Allah ﷺ said: **Fast when you see it and stop fasting when you see it, and perform the rites on that basis. If it is obscured, then complete thirty days, and if two witnesses testify then fast and stop fasting.** Ahmad 4/321, an-Nasai 1/300, ad-Darakutni 232. The hadith is reliable. See Iruaul-gaalil 909. Thus, it becomes clear to us that people must begin and end the fast with the testimony of two Muslims who saw the moon, but Ibn Umar’s hadith about the beginning of the fast makes this an exception, while we have no evidence about the end of the fast that we can also limit ourselves to one witness . See Tuhfatul-Ahuazi 3/374.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Abu Daud 2342, ad-Darimi 1691, al-Hakim 1/423)"
        }
       
      ]
    },
    {
      "id": 10,
      "subtitle": "Does only the country that saw the moon fast, or all countries?",
      "text": "There is great disagreement among scientists on this issue. Some believe that based on the vision of the new moon, all Muslims in all corners of the world should fast, while others believe that only the country in which the new moon was seen should fast. Still others believed that all countries with the same geographical location should fast. At the same time, all scientists relied on the same hadiths, but disagreed in their understanding. However, the best opinion in this matter is that if the moon appears in a certain area, then fasting becomes obligatory for all areas that share the same night, since the appearance of the crescent moon varies geographically. For example, the appearance of a crescent moon in Asia looks different than in Europe, and in Africa differently than, say, in America. In each region or country, residents themselves determine the time of fasting. This is the opinion of the Hanafis, Shafi'is, Hanbalis and some Malikis. Sheikhul-Islam Ibn Taymiyyah also preferred this opinion¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See al-Kawaninul-fiqkhiya 103)"
        }
       
      ]
    },
    {
      "id": 11,
      "subtitle": "Fasting should begin and end with the Muslims of one's own country.",
      "text": "It is reported from Abu Hurayrah that the Prophet ﷺ said: **The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.** at-Tirmidhi 697, Ibn Majah 1660. The authenticity of the hadith was confirmed by Imam Abu Isa at-Tirmidhi, Imam Ibn Muflih, Sheikh Ahmad Shakir and Sheikh al-Albani. This hadith contains a refutation to those who believe that if a person saw the new moon with his own eyes, but the imam did not accept his testimony, then he should fast himself. Imam Abu 'Isa at-Tirmidhi said: Some scholars have said that the meaning of this hadith is that one should fast and break the fast with the jama'at (community) and the majority of the people. See al-Jami' 3/311. Shaykhul-Islam Ibn Taymiyyah said: “A person should not start fasting or finish fasting alone, even if he saw the moon. He should fast and finish fasting with people, as indicated by the hadith of the Prophet ﷺ.” See Majmu'ul-Fataawa 25/114. Ibn al-Qayyim said: This hadith contains a refutation for people who say that one who knows the position of the moon through astronomical calculations is allowed to fast and break his fast, even if others do not know. It is also said that if an individual saw the moon, but the judge did not accept his testimony, he should not fast alone. See Tahzibu-Ssunan 3/214. Imam al-San'ani said: This hadith contains evidence that being in harmony with people is customary in establishing the holiday ('id), and that an individual who believes that the day of the holiday has arrived due to the discovery of the moon is obliged be in harmony with people. Unity of people regarding holiday prayer, completion of fasting and sacrifice is obligatory for an individual. See Subulu-Ssalyam 2/72. This opinion is confirmed by the actions of the Companions. Masruk said: “I came to Aisha on the day of Arafah, and she said: “Give Masruk some porridge and make it sweeter.” Masruk said: “Nothing would have stopped me from fasting on that day if I had not been afraid, that today is the day of Sacrifice. To this 'Aisha said: The Day of Sacrifice is when all people make a sacrifice, and the day of breaking the fast is when all people break their fast! al-Bayhaqi. Isnad is good. See al-Silsilya al-Sahiha 1/442. Based on these arguments, it becomes clear that the actions of those who, while living in Islamic countries, do not fast with their own country are wrong. Those. if, say, the beginning of Ramadan was fixed in Saudi Arabia, and say in Egypt or another Islamic country, Muslims did not see the moon, then a resident of this country should not fast with Saudi Arabia, since such an act would be a contradiction to the command of the Prophet ﷺ, who said: **The fast is the day the people fast, the breaking of the fast is the day the people break their fast.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": ""
        }
       
      ]
    },
    {
      "id": 12,
      "subtitle": "Is it possible to rely on astronomical calculations of the beginning and end of Ramadan?",
      "text": "At the beginning it was already said that the beginning and end of the month of Ramadan in Sharia is established in only two ways: 1. Visual fixation of the moon. 2. And in case of cloudiness, count 30 days of Shaban, after which fast the first day of Ramadan. The Messenger of Allah ﷺ clearly and unequivocally said: “Fast when you see the crescent moon, and break your fast when you see the crescent moon, and if you do not see it, then complete the previous month (Sha’ban) with thirty days.” al-Bukhari 1909, Muslim 1081. But many Muslims these days do not pay attention to these words of the Messenger of Allah ﷺ, and inform people a year in advance of the beginning and end of fasting, based on some astronomical calculations, at the time when the Prophet ﷺ commanded to fast and break the fast upon seeing the new moon ! Neither the companions of the Prophet ﷺ nor the righteous predecessors (salaf) did anything like this. And this method of calculating the beginning and end of Ramadan is an innovation that contradicts the unanimous opinion of the imams of the Ummah, who said that the beginning and end of the fast of Ramadan should be determined only by visual fixation. See Bidayatul-Mujtahid 1/423, Hashiyatu Ibn 'Abidin 2/393, Fathul-Bari 4/159. Many scholars have conveyed the unanimous (ijma') opinion of the Ummah regarding the impermissibility of relying on astronomical calculations for the beginning and end of the fast of Ramadan. Hafiz Ibn Hajar said: “Ibn al-Mundhir reported the unanimous opinion that one cannot rely on astronomical calculations in establishing fasting!” See Fathul-Bari 4/147. Sheikhul-Islam Ibn Taymiyyah said: “There is no doubt that the Sunnah and the unanimous opinion of the companions indicate that one cannot rely on astronomical calculations! And the one who relies on this in affirming the beginning of the month is lost in Shariah, an adherent of innovations in religion and erring in reason and in his calculations! See Majmu'ul-Fataawa 25/207. However, some scholars reported that this ijma'u was contradicted by the famous tabi'in Mutarrif ibn Abdullah ash-Shahir, who allegedly allowed relying on astronomical calculations in establishing fasting. However, Hafiz Ibn Abdul-Barr said: “What is transmitted from Mutarrif ibn Abdullah is not reliable! But even if it were reliable from him, it cannot be followed because of the fallacy of this opinion!” See at-Tamhid 14/352. The same thing was conveyed by Sheikh-Islam Ibn Taymiyyah: “Even if this is reliable from him, it is a mistake of the scientist¹. Ibn Rushd also mentioned in his book Bidayatul-Mujtahid 2/557 that Imam al-Shafi’i also allowed a similar method for calculating Ramadan. However, this is also not reliable, since there is no indication of this in the works of Imam al-Shafi'i, and famous Shafi'i scholars conveyed from him an opinion corresponding to ijma'u. Sheikhul-Islam Ibn Taymiyyah said: “This is a lie erected against Imam al-Shafi’i, which has no basis, moreover, the opposite of this is transmitted from al-Shafi’i!” See Majmu'ul-Fataawa 25/183. The same thing was said by Hafiz Ibn Abdul-Barr, Qadi Abu Bakr ibn al-Arabi and Hafiz Ibn Hajar. See at-Tamhid 14/354, Ahkamul-Kuran 1/82, Fathul-Bari 4/146. Thus, the truth of the unanimous opinion in this matter becomes clear to us, and that which contradicts it has no basis. But even if it were confirmed that one of the imams allowed the astronomical calculation of the beginning and end of Ramadan, this would not indicate the permissibility of such an act. Sheikh-ul-Islam Ibn Taymiyyah said: “The Sharia proof is the Quran, the Sunnah and the unanimous opinion (ijma')! And as for the customs of some cities, or even the majority, or the words of the majority of scholars or simply worshipers, etc., nothing of this cannot be opposed to the words of the Messenger of Allah! See al-Iqtida 1/270. Imam Ibn Qudamah said: “If someone begins to rely on the words of astronomers at the beginning of the fast, and even if their words coincide with the correct one, then his fast is invalid, even if those astronomers are often right (in calculating Ramadan)! The fact is that This method of calculating fasting is not a Sharia argument on which it is permissible to rely, and the presence of such a method is the same as if it does not exist. And the Prophet ﷺ said: “Fast when you see the crescent moon, and break your fast when you see the crescent moon,” and in another hadith he said: “ Don't fast until you see the moon and don't break your fast until you see the moon! See al-Mughni 3/9. Imam al-Harashi said: “Fasting is not approved on the basis of the words of an astronomer. Shariah approved fasting only on the basis of a vision of the moon, or the testimony of those who saw it, or at the end of the month of Shaban. And Shariah did not report anything beyond this. Therefore, if An astronomer will say that the month has ended or begun, then one cannot rely on his words and his calculations, regardless of whether the heart trusts him or not! See Sharh mukhtasar Khalil 2/237. The Messenger of Allah ﷺ pointed out a method for calculating the onset and completion of fasting, and this is a visual fixation that can be used by everyone without exception. And he did not establish such an astronomical regulation for establishing fasting, since only a few have this knowledge. It should also be noted that we are talking specifically about the astronomical calculation of the onset and completion of the fast, and not about the use of any instruments to detect the moon.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Majmu'ul-Fataawa 25/182)."
        }
       
      ]
    },
    {
      "id": 13,
      "subtitle": "What to do if a Muslim lives in a country in which the beginning and end of fasting are determined according to astronomical calculations?",
      "text": "Above, we considered that a Muslim is obliged to begin and end the fast with all or the majority of the inhabitants of his country, as stated in the hadith: **Fast when everyone is fasting, and break your fast when everyone breaks their fast, and perform a sacrifice when they perform it All¹.** The authenticity of the hadith was confirmed by Imam Abu Isa at-Tirmidhi, Imam Ibn Muflih, Sheikh Ahmad Shakir and Sheikh al-Albani.And we also considered the issue that the onset and end of fasting is not allowed to be established on the basis of astronomical calculations, the basis for which is the clear commands of the Prophet ﷺ:  **Fast when you see the crescent moon, and break your fast when you see the crescent moon, Do not fast until you see the moon and Don't break your fast until you see the moon!** However, the question arises: What to do if, for example, a Muslim lives in a country that does not rely on visual fixation of the moon? Should we fast with the majority, who fast in such countries based on calendars based on astronomical calculations, or rely on an Islamic country that fasts on the basis of visual fixation? A question was asked on the website of Sheikh al-Munajid:  I live in Holland and people began to disagree on the onset of the first day of Ramadan. Among them were those who began to fast with Egypt and those who were waiting for the announcement of the al-Jazeera channel. What is correct in this? Answer: Firstly, the onset of fasting is not established except by visual fixation of the month, as the Prophet ﷺ said: **Fast when you see the crescent moon, and break your fast when you see the crescent moon.** Al-Bukhari 1909, Muslim 1081. And there is no point in resorting to astronomical calculations. Secondly, if among Muslims living in non-Islamic countries, if there is a certain Sharia organization to which they turn and which relies on the Sharia method in calculating the onset and completion of fasting, then the scholars of the Standing Committee have given fatua that such an organization has status for them Shariah government and they should follow them regarding the beginning and end of Ramadan. However, if they do not have such an organization, then there is no sin on them if they follow a trusted country that establishes Ramadan on the basis of Sharia, and not astronomical calculations. They also answered: If a Muslim lives in a country of infidels, or in a country that plays with the issue of starting and ending the fast in accordance with his passions, then there is no problem if he follows a country that is guided by the rules of Sharia! They were also asked: “We live in Germany, and the problem is that the imam of one mosque says: We will soon begin fasting together with Saudi Arabia, and in another mosque they say: We will fast together with an Islamic organization in Europe. What will you tell me about this? Answer: If this Islamic organization in Europe relies on visual recording of the onset of Ramadan, then it is more correct and preferable to follow it in the onset and end of the fast!” See questions “Sual wa Jauab” No. 1602, 1248, 1226, 12600, 50522 for more details. Sheikh Ibn Baz was asked about who lives in Spain, but begins and ends the fast with Mecca and Medina. He replied: “As for you fasting and breaking your fast during Ramadan with us because you live in Spain, there is no problem with that. The Prophet ﷺ said: **Fast when you see the crescent moon, and break your fast when you see the crescent moon, and if you do not see it, then complete the previous month (Sha'ban) with thirty days.** This is a general appeal to the entire community, and two cities like Mecca and Medina deserve to follow them more than other countries, may Allah add to them diligence and the straight path. Reason. This means that you are in a country where they do not live according to Islam!” See Fataawa Ibn Baz 15/105. To summarize, it should be noted that if Muslims live in a country in which, say, the Spiritual Administration relies on astronomical calculations and announces the onset of fasting a month in advance, then one should not follow them in this. Above were the words of Imam Ibn Qudamah: If someone begins to rely on the words of astronomers at the beginning of the fast, and even if their words coincide with the correct one, then his fast is not valid, even if those astronomers are often right (in calculating Ramadan)! The reason for this action on their part is often related to the agreement of this issue with the government, since it is necessary to declare a holiday, etc. this of course refers to playing with Sharia regulations. In such a situation, a Muslim should follow the Islamic country, which calculates the onset of fasting based on visual fixation. But if that same spiritual guidance in the onset of fasting is based on visual fixation, and the majority of Muslims in this country follow it in this matter, then one should fast with them. Also, if at the beginning of the fast they rely on any Islamic country, say Egypt, then one should begin the fast with them. rather than relying on Saudi Arabia to follow the command of the Prophet ﷺ:  **Fast when everyone else is fasting.** This way you can combine existing opinions on this issue. Here it is necessary to point out the opinion of Sheikh al-Albani, who believed that in Islamic countries the fast should be kept in accordance with its inhabitants, even if this country relies on astronomical calculations in establishing the fast. He believed that this was the unity of the ummah, and gave the example that there are cases when a father and son, sitting in the same house, fast differently, since the son fasts for Saudi Arabia, and the father for his own country. He also said that initially Muslims all over the world should observe fasting on the basis of one visual fixation, which is the unity and command of the Prophet ﷺ addressed to everyone: **Fast when you see the crescent moon, and break your fast when you see the crescent moon,** but this does not happen. And for this reason, one should choose the lesser of two evils, and that is to fast with one’s country, even if it is based on an astronomical calculation. The sheikh spoke about this more than once in “Silsilatul-khuda wa-nnur” No. 403, 698. But we don’t know whether his opinion can be extended to the countries of infidels where Muslims live. This opinion of the respected sheikh was mentioned for the sake of fairness, but I (A'mash author of this article) follow in this matter the opinion of Lyajna, especially the statements of the imams regarding the fact that simply fasting based on an astronomical calculation is invalid in itself, even if it was a correct calculation, quite scary. And then, in the question: are all countries obliged to fast on the basis of seeing the moon in one country, or is only the country in which the moon was noticed fasting? There is acceptable disagreement and strong disagreement on both sides, which cannot be said about the issue of establishing a fasting in accordance with astronomical calculations.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(at-Tirmidhi 697, Ibn Majah 1660)."
        }
       
      ]
    },
    {
      "id": 14,
      "subtitle": "Repentance",
      "text": "Allah Almighty said: **And whosoever does not repent, then such are indeed Zalimun** (unfair, wrong-doers, etc.) (Hujurat 49:11). The Merciful and Merciful Allah accepts repentance from the repentant always and at any time, but woe to him who does not earn the forgiveness of his Lord in this great month, because of his vices and sins and refusal to repent. The Messenger of Allah ﷺ said: **The angel Jibril came to me and said: O Muhammad! Anyone who is caught in the month of Ramadan and is not granted forgiveness will enter the Fire and Allah will remove him from Himself. Say: Amen! and I said: Amen.** Ahmad, Ibn Hibban, at-Tabarani in al-Kabir. The hadith is reliable. See Sahih at-targhib 3/216. The gates of repentance are open to those who want to repent until death overtakes them. The Messenger of Allah ﷺ said: **Verily, Allah, the Almighty and the Great, accepts the repentance of a slave until he begins to make a death rattle.** at-Tirmidhi 3537, Ibn Majah 4253. Sheikh al-Albani called the hadith good. How many people wanted to catch this month, but it turned out differently - and in their graves they turned into hostages who could neither increase their righteous deeds nor repent of their many sins. So let no one ignore the opportunity to repent, no matter how great his sins, because Allah the All-Forgiving said: “O My servants who have transgressed against themselves, do not despair of the mercy of Allah! Verily, Allah forgives sins completely: for He is Forgiving, Merciful! (az-Zumar 39: 53). The Messenger of Allah ﷺ said: **He who repents of a sin is like one who has not committed a sin¹.** Therefore, a person should not despair of the mercy of Allah and say that he has many sins and vices and there is no opportunity or means to get rid of them, and for this reason continue to commit disobedience and sins, angering the Merciful Lord. However, it is necessary to know that the Lord is Forgiving and Merciful, but He grants His forgiveness and mercy when a certain condition is met, namely, if a person turns to Allah Almighty with complete and sincere repentance. Repentance requires compliance with three conditions: - stopping the commission of sin, - repentance for sin, - determination never to do something like this. If at least one of the above conditions is not met, then repentance will not be accepted. In the same case, when the sin committed somehow affects another person, repentance will have to satisfy four conditions, namely the three above-mentioned and one more, the essence of which is to make amends to those who suffered from it , asking him for forgiveness or returning to the victim what was illegally appropriated, if the matter concerns the illegal appropriation of material assets, etc².",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ibn Majah 4250. The hadith is good. See Sahih al-Jami' 3008)."
        },
        {
          "source": "²(See al-Adhkar 321, Riyadu-ssalihin 28)."
        }
       
      ]
    },
    {
      "id": 15,
      "subtitle": "Multiple readings of the Qur'an",
      "text": "Allah Almighty said: **The month of Ramadan in which was revealed the Qur’an, a guidance for mankind and clear proofs for the guidance and the criterion** (between right and wrong).  (al-Baqarah 2: 185). Ibn 'Abbas (may Allah be pleased with him) said:  The angel Jibril met with the Prophet Muhammad ﷺ every night of Ramadan and studied the Quran with him. al-Bukhari 6, Muslim 2308. Hafiz Ibn Rajab said: This hadith indicates the desirability of gathering to study the Qur'an in Ramadan. The hadith also indicates an increase in the reading of the Qur'an in the month of Ramadan. See Lataiful-ma'arif 189. If a Muslim fasts during daylight hours and reads the Quran at night, then on the Day of Judgment he will have two intercessors: fasting and the Quran. The Messenger of Allah ﷺ said:  **Fasting and the Qur’an intercede for a man. Fasting says, ‘O my Lord, I have kept him away from his food and his passions by day, so accept my intercession for him. The Qur’an says, I have kept him away from sleep by night, so accept my intercession for him. Then their intercession is accepted.**  Ahmad 2/174. The authenticity of the hadith was confirmed by Imam al-Hakim, Hafiz al-Munziri, Sheikh Ahmad Shakir and al-Albani. See Sahih at-targib 973. The Prophet ﷺ and his companions, and then their followers, sought to spend the days and nights of Ramadan reading the Holy Quran, penetrating its meanings. When the month of Ramadan arrived, they increased the frequency of their reading of the Quran and the great imams of our community followed their example. For example, Imam Malik abandoned all his studies during Ramadan and began reading the Qur’an. Sufyan al-Thawri did the same. Some scholars from among our righteous predecessors read the Quran every three days during night prayers, others - every seven, and still others - every ten days. It is also reported that  Qatada read the entire Qur'an every seven days, and when Ramadan came, he read the Qur'an every three days. See al-Siyar 5/276. However, you should not read the Quran faster than in three days, since the Prophet ﷺ himself did not read the Quran in less than three days, and said: He who reads it faster than three days does not understand the Quran!¹ For those Muslims who do not know how to read the Quran, we wish them to gain willpower and master the letters of the Arabic alphabet in order to read the Quran both in the blessed month of Ramadan and at other times, earning a great reward for this! The Messenger of Allah ﷺ said: **Whoever recites a letter from the Book of Allah, he will be credited with a good deed, and a good deed gets a ten-fold reward. I do not say that Alif-Lam-Mim is one letter, but Alif is a letter, Lam is a letter and Mim is a letter.** At-Tirmidhi 2910, Imam Ibn Qudam and Sheikh al-Albani called the hadith authentic.Sa'd ibn Abu Waqqas (may Allah be pleased with him) said: “If a person completes reading the entire Quran at the beginning of the night, then the angels will pray for him until the morning, and if he completes reading the Quran at the end of the night, then the angels will pray for him.” for him until the evening. Ahmad, ad-Darimi. The message is good. See al-Adhkar 136.Thabit al-Bunani said: “When Anas ibn Malik (may Allah be pleased with him) completed reading the entire Quran, he gathered his children and family members and turned to Allah with a prayer.” ad-Darimi 2/469, Sa'id ibn Mansur 1/140. Imam al-Nawawi, Hafiz Ibn Hajar and Sheikh al-Albani confirmed the authenticity of the isnad.Ibn Utayba said: “One day Mujahid and Abda ibn Abu Lubab sent for me, and when I came, they said: “Indeed, we sent for you for the reason that we wanted to complete the reading of the Qur'an, for prayer after the completion of the Qur'an is accepted. Ibn Abu Dawud: Imam an-Nawawi called the isnad authentic. See al-Adhkar 119.As for certain prayers that are said after reading the Quran, legitimized by people, this has no basis, and therefore Imam al-Shatibi called it: “Added innovation.” See al-Da'ifa 13/315.Therefore, after completing the reading of the Quran, you can turn to Allah with any prayers, since there are no specific prayers for this!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Abu Daud 1394, at-Tirmidhi 2949, Ibn Majah 1347. Sheikh al-Albani called the hadith authentic)."
        }
       
      ]
    },
    {
      "id": 16,
      "subtitle": "Show more generosity",
      "text": "The month of Ramadan comes as a time of generosity and mercy, in which the faithful compete with each other in demonstrating these qualities. Ibn 'Abbas said: **The Messenger of Allah was the most generous of people, and he was most generous in Ramadan when Jibril met him. Jibril use to meet him every night during the month of Ramadan and study Quran with him. And he said: When Jibril met him, the Messenger of Allah was more generous in doing good than the blowing wind.** al-Bukhari 6, Muslim 2308. The Prophet ﷺ encouraged his community to take care of those who are fasting, and he said: **Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.** Ahmad 5/192, at-Tirmidhi 807. Imam Abu Isa at-Tirmidhi, Hafiz al-Munziri and Sheikh al-Albani confirmed the authenticity of the hadith. Sheikhul-Islam Ibn Taymiyyah in al-Ikhtiyarat said that the hadith refers to such an amount of food that will be enough to satisfy oneself with it. Imam Ibn Shihab al-Zuhri, when the month of Ramadan began, said: “This is the month of reading the Quran and feeding the people.” Ibn 'Abdul-Barr in at-Tamhid 6/110. Many of our righteous predecessors, among whom were Ibn 'Umar, Malik ibn Dinar, Imam Ahmad, sacrificed their food for the benefit of the poor in order to break their fast. As for Ibn 'Umar, it is reported that he broke his fast only with an orphan or a beggar. See Sab'una masala fi-ssyam 19. Let us also strive to feed the fasting person, in order to please him with the breaking of his fast, and ourselves with the same reward that is intended for him. The Messenger of Allah ﷺ said: “The best of you are those who feed you food!” Ibn Majah, Abu Yala, at-Tabarani. Hafiz Ibn Hajar, al-Busayri and Sheikh al-Albani called the hadith good. See as-Silsilya as-sahiha 44. If treating people is one of the best manifestations of Islam, what can be said about such an act in the great month of Ramadan! Allah created Paradise for the God-fearing and those who are distinguished by the desire to forgive, spend, do good and promised them His forgiveness, saying: **And march forth in the way (which leads to) forgiveness from your Lord, and for Paradise as wide as the heavens and the earth, prepared for Al-Muttaqûn (the pious) Those who spend (in Allâh’s Cause) in prosperity and in adversity, who repress anger, and who pardon men; verily, Allâh loves Al-Muhsinun (the good-doers).**  (Ali Imran 3: 133-134).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": ""
        }
       
      ]
    },
    {
      "id": 17,
      "subtitle": "Be more diligent in worship",
      "text": "'Aisha (may Allah be pleased with her) said: **During Ramadan, the Messenger of Allah ﷺ was more diligent than at any other time, and during the last ten days of Ramadan he was even more diligent than on the other days of this month.** Muslim 1175. Abu Hurayrah (may Allah be pleased with him) said:  The Messenger of Allah ﷺ encouraged people to perform additional night prayers during Ramadan, but did not categorically order them to do so, but said:  **Whoever stood the nights of the month of Ramadan in prayers with faith and hope for reward of Allah, his previous sins will be forgiven.** al-Bukhari 37, Muslim 759. 'Amr ibn Murra al-Juhani said: One day a man came to the Prophet ﷺ and said:  O Messenger of Allah! Do you know that I testify that there is no deity worthy of worship except Allah and that you are the Messenger of Allah, and that I pray, pay zakat, fast and spend the nights of Ramadan in prayer?! The Prophet ﷺ said: **He who if he dies on this, he will be among the truthful and martyrs in Paradise¹.** What else is needed for God-fearing Muslims who strive for the pleasure of Allah and want the reward of a martyr?!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bazzar, Ibn Khuzaima, Ibn Hibban. The hadith is authentic. See Sahihu-ttargib 1/419)"
        }
       
      ]
    },
    {
      "id": 18,
      "subtitle": "What to do for a sick person?",
      "text": "Allah Almighty said: **and whoever is ill or on a journey, the same number (of days which one did not observe fasts must be made up) from other days.** (al-Baqarah 2: 185). The patient breaks his fast if it is difficult for him to fast or if fasting interferes with his rapid recovery. Scholars differed as to what the severity of the illness should be before it was permissible to leave the fast. Some scholars have said: everything that is a disease allows you to leave the fast. At the same time, they relied on the words of Allah Almighty, Who did not specify the severity of the disease, but said: “What if any of you is sick?” However, if the illness is not associated with difficulties and does not weaken the person, such as a runny nose, allergies and the like, which is called illness, but does not weaken the fasting person, then he must observe the fast and not leave it. See Sahih fiqhu-Sunnah 2/119. Imam al-Qurtubi said: “The patient has two situations: the first is when he is unable to fast. In such a case, breaking the fast is obligatory for him. The second condition is when the patient can fast, but with difficulty, causing harm to himself. In In this case, it is highly desirable for him to break his fast, and no one will fast in such a situation except an ignoramus!” See Tafsir al-Qurtubi 2/276. Imam Ibn Qudama said: “If a sick person fasts despite his illness, then he is committing something blameworthy, since he is harming himself and leaving relief from Allah.” See al-Mughni 4/404. If a seriously ill person, despite his illness, fasts, then his fast is valid, on which all scientists are unanimous. From Ibn 'Umar it is reported that the Prophet ﷺ said: **Truly, Allah Almighty loves when His reliefs are accepted, just as He does not like when His prohibitions are transgressed.** Ahmad 2/108, Ibn Hibban 2742, al-Qada'i 1078. Hafiz al-Munziri, Hafiz al-Haythami and Sheikh al-Albani confirmed the authenticity of the hadith¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Majma'u-zawaid 3/165, Sahih at-targhib 1059.)"
        }
       
      ]
    },
    {
      "id": 19,
      "subtitle": "Traveler",
      "text": "Allah Almighty said: **And whoever is ill or on a journey, the same number [of days which one did not observe fasts must be made up] from other days.**  (al-Baqarah 2: 185). The traveler is allowed to break his fast according to the unanimous opinion of the community (al-ijma'), regardless of his physical condition and the difficulty of the journey. This means that even if his path is easy and not difficult, he is allowed not to fast and to shorten his prayers. See Majmu'ul-Fataawa 25/210. A person who goes on a trip has the right to both fast and break his fast. This is indicated by the words of Anas ibn Malik, who said: “We were often on the road with the Prophet ﷺ, and the one who fasted did not blame the one who did not fast, and the one who did not observe the fast did not blame the one who fasted¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bukhari 1947.)"
        }
       
      ]
    },
    {
      "id": 20,
      "subtitle": "What is better for a traveler, fasting or breaking his fast?",
      "text": "Scolars have expressed different opinions on how best to proceed while traveling. The best opinion on this matter is the opinion of those scientists who said that a traveler can choose what is easier for him. These scholars said that if it is easier for a traveler to fast than to compensate for the fast later, then it is better for him to fast, and if it is difficult for him to fast on the road, then it is better for him to break the fast. At the same time, these scientists relied on the words of Allah Almighty: **Allah intends for you ease, and He does not want to make things difficult for you.** (al-Baqara 2: 185). Hamzah ibn 'Amra once asked the Prophet ﷺ about fasting while traveling, and the Prophet ﷺ said: **Do what is easier for you! Break your fast if you wish or fast¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Tamam in al-Fawaid 1/161. The authenticity was confirmed by Sheikh al-Albani. See al-Silsila al-sahiha 6/889)"
        }
       
      ]
    },
    {
      "id": 21,
      "subtitle": "Can a traveler break his fast before leaving home?",
      "text": "Most scholars believe that a traveler should not break his fast until he has passed through the populated areas of his city. As soon as he passes the city limits, he can break his fast. However, a strong opinion, which is based on the Sunnah, is that a traveler can break his fast before leaving. Muhammad ibn Ka'b said: “Once I came to Anas ibn Malik during Ramadan at a time when he was about to set off on a journey. He prepared a mount, got dressed and ordered food to be brought. When he had eaten, I asked him: “Is this Sunnah (to eat before leaving)?!” He said: **Sunnah,** then sat on horseback.” at-Tirmidhi 799, al-Bayhaqi 4/247, ad-Darakutni 2/187. Some scholars considered this hadith weak and for this reason did not rely on it. However, this hadith is reliable, the authenticity of which was confirmed by the imams at-Tirmizi, Ibn al-'Arabi, Hafiz ad-Diya al-Maqdisi, Sheikh Ibn al-Qayim, Abul-Mahasin, Sheikh al-Albani. Imam Ahmad and Ishaq ibn Rahaweikh also relied on this hadith. See in detail the authenticity of this hadith in Taskhikh hadith iftaru-ssaim kablya safarihi ba'dal-fajr wa radu 'ala mann da'afahu This hadith is also supported by the report from 'Ubayd ibn Jubayr, who said that when he and Abu Basir al-Ghifari were preparing to sail during Ramadan, Abu Basir approached the food and said: “Eat!” To which Ubaida asked: “Aren’t we home yet?!” Then Abu Basira said: “Are you refusing the Sunnah of the Messenger of Allah ﷺ?!” Ahmad, Abu Daud, ad-Darimi. The message is reliable. See Iruaul-gaalil 928. Imam al-Shaukani said: “These two hadiths provide evidence that a traveler can break his fast before leaving¹.” However, a person must be careful not to break the fast before leaving and then change his mind about making the trip!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Nailul-autar 4/311.)"
        }
       
      ]
    },
    {
      "id": 22,
      "subtitle": "An old man who is unable to fast",
      "text": "Ibn 'Abbas (may Allah be pleased with him) said: **An old man and woman who could not fast was allowed not to fast and not to make up for it, but was ordered to feed one poor person for each day missed¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bukhari 7/179, ad-Darakutni 2/205)"
        }
       
      ]
    },
    {
      "id": 23,
      "subtitle": "A patient who has no hope of recovery",
      "text": "Imam Ibn Qudama said: A sick person who does not hope for recovery does not fast and does not feed the poor every day, and in this he is equivalent to an old person¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Al-Mughni 4/396.)"
        }
       
      ]
    },
    {
      "id": 24,
      "subtitle": "Pregnant / Breastfeeding woman",
      "text": "From Anas (may Allah be pleased with him) it is reported that the Messenger of Allah ﷺ said: **The Great and Almighty Allah relieved travelers from the burden of fasting and half of the prayers, and pregnant and breastfeeding women from the burden of fasting.** at-Tirmidhi 715, Abu Dawud 2408, an-Nasai 2277. Imam Abu Isa at-Tirmidhi called the hadith good, and Sheikh al-Albani - reliable. Pregnant and breastfeeding women can break their fast if they fear for themselves or their child. However, if they are able to fast, then they are forbidden to leave the fast, for Allah Almighty says: “but fasting is better for you, if only you knew!” (al-Baqarah 2: 183). Imam Ibn 'Aqil said: If a pregnant and nursing woman fears for the fetus and child, then they should not fast, and if they do not fear, then they are forbidden not to fast!¹",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See al-Insaf 7/382.)"
        }
       
      ]
    },
    {
      "id": 25,
      "subtitle": "Insane / Epileptic",
      "text": "From 'Aisha, 'Ali, Sauban and other companions (may Allah be pleased with them all) it is reported that the Messenger of Allah ﷺ said:  **There are three people whose actions are not recorded, a sleeping person till he awakes, a child till he is a grown up, and an insane person till he is restored to reason or recovers his sense¹.** Shaykh Ibn 'Uthaymeen said: Mad people are not responsible for their actions, but if a person is mad at one time and sane at another, he should fast during the time of sanity, and he is exempt from it during the time of madness. If he loses his sanity during fasting, then this does not break his fast, just as if someone loses his mind due to illness or some other reason, because he intended to fast when he was sane². The same applies to epileptics.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ahmad 1/104, Abu Daud 4398 and 4402, an-Nasai 3432, Ibn Majah 2041, ad-Darimi 2296, Ibn al-Jarud, al-Bayhaqi 6/57, al-Bazzar 1540. The authenticity of this hadith was confirmed by imams Ahmad, al -Bukhari, Ibn Khuzaima, Ibn al-Jarud, Ibn Hibban, Ibn al-Munzir, al-Hakim, az-Zahabi, Ibn Hazm, Abu Bakr ibn al-Arabi, Ibn Taymiyya, Ahmad Shakir, al-Albani)"
        },
        {
          "source": "²(See Majalisa Shahri Ramadan 28.)"
        }
       
      ]
    },
    {
      "id": 26,
      "subtitle": "Child",
      "text": "From 'Aisha, 'Ali, Sauban and other companions (may Allah be pleased with them all) it is reported that the Messenger of Allah ﷺ said:  **There are three people whose actions are not recorded, a sleeping person till he awakes, a child till he is a grown up, and an insane person till he is restored to reason or recovers his sense¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ahmad 1/104, Abu Daud 4398 and 4402, an-Nasai 3432, Ibn Majah 2041, ad-Darimi 2296, Ibn al-Jarud, al-Bayhaqi 6/57, al-Bazzar 1540. The authenticity of this hadith was confirmed by imams Ahmad, al -Bukhari, Ibn Khuzaima, Ibn al-Jarud, Ibn Hibban, Ibn al-Munzir, al-Hakim, az-Zahabi, Ibn Hazm, Abu Bakr ibn al-Arabi, Ibn Taymiyya, Ahmad Shakir, al-Albani)"
        }
       
      ]
    },
    {
      "id": 27,
      "subtitle": "A man fearing for his health",
      "text": "If a person feels very hungry or thirsty, and fears that he may die or that something serious may happen to his health, then he can stop his fast and make up for it later, because preserving his life is mandatory. See  al-Mukhalla  6/228, Kauaninul-fiqkhiya 82. Allah Almighty said: **And do not kill yourselves. Surely, Allah is Most Merciful to you.** (an-Nisa 4:29). But it is not permissible to break your fast because of tolerable inconvenience or because of a feeling of fatigue or because of fear of imaginary illnesses. People working in physically tiring jobs are not allowed to break their fast, and they must intend to fast the next day at night. If they cannot stop working and are afraid of some injury that may happen to them at work during the day, or they encounter some extreme difficulties that force them to break the fast, then they can stop the fast and make it up later. Workers in physically demanding jobs, such as furnace handling and metal smelting, should try to adjust their work schedule to work at night or take time off during Ramadan. Every Muslim should look for a job where he can combine his religious and worldly duties, and Allah Almighty said: **And whosoever fears Allâh and keeps his duty to Him, He will make a way for him to get out (from every difficulty). And He will provide him from (sources) he never could imagine.** (at-Talaq 65: 2-3)¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataawa al-Lajnah ad-daimah 10/233)"
        }
       
      ]
    },
    {
      "id": 28,
      "subtitle": "A Mujahid who fights in the path of Allah if fasting weakens him and prevents him from fighting",
      "text": "Those who fight with enemies or are besieged by enemies, if their fast weakens them so that they cannot fight, are allowed to break their fast, even if they are not on the road. If they need to break their fast before the battle, they can do so. Proof of this is the hadith from Abu Sa'id, which reports that during the campaign against Mecca, the Prophet ﷺ told his companions: **In the morning you will face the enemy, and breaking the fast will make you stronger, so do not fast¹.** From this hadith it becomes clear that the Prophet ﷺ called the reason for breaking the fast not being on the road or on a campaign, but maintaining strength to fight enemies. Hafiz al-Munziri, al-Munawi, Shamsul-Haq 'Azym Abadi and others spoke about this. Preserving strength to participate in jihad, to repel aggression and protect Muslim lands is a valid reason for breaking the fast, and imams Ahmad, Ibn Taymiyyah, Ibn al-Qayyim, Ibn Muflih and others spoke about this.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Muslim 1120)"
        },
        {
          "source": "²(See al-Furu' 3/28)"
        }
       
      ]
    },
    {
      "id": 29,
      "subtitle": "Woman on her period / Woman with a postpartum graveyard",
      "text": "Unlike the above categories, women who have menstruation or postpartum bleeding not only can not fast, but they are prohibited from fasting in this state, on which scientists are unanimous. See al-Majmu' 6/259. Proof that women who are menstruating should not fast is the hadith in which it is reported that when asked by women: “What is the shortcoming of our religion?”, the Prophet ﷺ replied: **Isn’t a woman who has her menstruation stops praying and fasting?** al-Bukhari 304, Muslim 2/132. Also an indication that a woman who has postpartum bleeding should not fast is the hadith from Umm Salama, who said: “In the time of the Prophet ﷺ, women with postpartum bleeding abstained from prayer for forty days.” Ahmad 6/203, Abu Dawud 1/311, al-Baghawi 2/136, good hadith. Naturally, if it was forbidden to pray, then it was forbidden to fast. The Companions of the Prophet ﷺ and their followers were unanimous that a woman after giving birth should not fast or pray for forty days, unless she cleanses herself first. See Nailul-autar 1/274. If a pregnant woman miscarries the fetus while various parts of the body are forming, such as the head or arm, then such a case is considered as postpartum hemorrhage and the woman does not fast. If a miscarriage occurs in the early stages of pregnancy (before eighty days), then the woman is considered to be in a position of istihadah (painful bleeding) and she should not leave her fast¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataawa al-Lajnah ad-daimah 10/224.)"
        }
       
      ]
    },
    {
      "id": 30,
      "subtitle": "What is the intention to take?",
      "text": "When fasting, a Muslim must have the intention of obeying the command of Allah Almighty and drawing closer to Him. And the fast of those who fast only because it is good for health, or fast because everyone has started fasting, or so that people will praise him, is invalid. Not only will their fast not be accepted, but those who fasted for show will also be punished for it. The Messenger of Allah ﷺ said: **The one who fasted and they want the people to know about their fasting has committed shirk.** Ahmad 4/126, at-Tayalisi 1216. Imam-muhaddith Abu Bishr Yunus ibn Habib called the hadith authentic. See Tahrij Musnad at-Tayalisi 2/444. It is also reported from Abu Umama al-Bahili (may Allah be pleased with him) that the Messenger of Allah ﷺ said: **Truly, Allah accepts only those deeds that are done sincerely, in an effort to get closer to His face!¹**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Nasai 3140, Sheikh al-Albani confirmed the authenticity of the hadith.)"
        }
       
      ]
    },
    {
      "id": 31,
      "subtitle": "When should you set your intention for fasting?",
      "text": "In order for the message to be valid, it is necessary before dawn, every night of Ramadan, to affirm in your soul the intention to fast, and this is the strongest opinion based on reliable hadiths. From Hafsi (may Allah be pleased with him), the wife of the Prophet ﷺ, reports that the Messenger of Allah ﷺ said: **There is no fast for the one who does not intend to fast before dawn¹.** Imam al-Baghawi said: This hadith indicates that according to most scholars (to establish the intention of fasting until dawn), since each day's fast is a sequential worship that requires their intentions². Imam Ibn Khuzaimah said: “It is obligatory to declare your intention to travel at night, except for voluntary fasting.” See Sahih Ibn Khuzayma 3/198. Sheikh Siddyk Hasan Khan said: “It is obligatory to affirm the intention for every day.” See Raudatu-nadiya 1/539.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Abu Dawood, Ibn Majah, at-Tirmidhi, an-Nasai. The authenticity of the hadith was confirmed by the imams ad-Darakutni, Ibn Khuzaima, Ibn Hibban, al-Hakim, Ibn Hazm, al-Khattabi and al-Albani. See “Tuhfatul-Ahuazi” 2/80, “Iruaul-Galil” 914. Aisha and Ibn Umar said the same thing. Malik 1/288, ad-Darakutni 2/172. Both arenads are authentic.)"
        },
        {
          "source": "²(See Sharhu-Ssunna 3/476. See also “Raddul-mukhtar” 2/87 and “Sharkhul-kabir” 1/521.)"
        }
       
      ]
    },
    {
      "id": 32,
      "subtitle": "About the fast of one who did not confirm his intention before dawn for a reason",
      "text": "If a person overslept, did not know or forgot to confirm his intention before dawn, then his fast is valid, since the Prophet ﷺ said: **Allah, the Most High, has overlooked my follower's mistakes and forgetfulness, and what they are forced to do against their will¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ibn Majah 2045, al-Bayhaqi 7/356, at-Tahawi 2/56. The authenticity of the hadith was confirmed by Imam al-Hakim, al-Zahabi, Imam an-Nawawi, Hafiz Ibn Rajab, Sheikh al-Albani. See also Iruaul-gaalil 83.)"
        }
       
      ]
    },
    {
      "id": 33,
      "subtitle": "How should one assert intention?",
      "text": "Intention is an activity of the heart, and it can be expressed at any moment of the night, even if it happened just before the morning. Imam al-Nawawi said: “Fasting is invalid except with intention, and the place of intention is the heart!¹ As for pronouncing the intention out loud, as many people do, this is an innovation, for neither the Prophet, nor his companions, nor any of the imams did anything like this. Shaykhul-Islam Ibn Taymiyyah said: “Saying an intention out loud is an innovation (bid'a), and anyone who knows that tomorrow will be one of the days of Ramadan and wants to fast is obliged to confirm the intention².",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Raudatu-ttalibin 2/350.)"
        },
        {
          "source": "²(See Majmu'ul-Fataawa 25/215.)"
        }
       
      ]
    },
    {
      "id": 34,
      "subtitle": "Do you need to set an intention every night or is one intention per month enough?",
      "text": "Sheikh ibn Uthaymeen, may Allah have mercy on him, said: “It is well known that every Muslim wakes up in the last part of the night and eats food before dawn (suhoor). And he, undoubtedly, thereby wants to fast all day. Since any reasonable person commits any deed of his own choice. And he does it according to his desire, whereas it is impossible to do anything without desire. And desire is intention. Therefore, a Muslim eats food in the last part of the night, only because wants to fast. If he just wanted to eat, then he usually does not do it at such a time. Therefore, this is the intention! However, this leads us to the question: If a Muslim fell asleep before sunset in the month of Ramadan, and continued to sleep until the next day, until it was dawn, since no one woke him up. And he did not confirm the intention at night for the following day of fasting, then do we say that his fast is counted based on the previous intention he made? Or do we say that his the post is not read, because he did not confirm the intention at night? In response to this, we say that his post counts. Because the more correct opinion (according to the Sheikh - approx. trans.) is that setting the intention at the beginning of the month of Ramadan is sufficient, which does not need to renew the intention every day. Except if there are no sharp reasons that allow you to break your fast. Because if he breaks his fast in the middle of the month, then in this case it is necessary to renew the intention to observe the fast¹. Although most scholars agree that it is necessary to affirm the intention every night of Ramadan. Since a clear, precise hadith came, where it was said: **There is no fasting for one who has not confirmed the intention to fast before dawn..** (Abu Dawood, Ibn Majah, at-Tirmidhi, an-Nasai). Imam Ibn Khuzaima said: “It is obligatory to affirm the intention to fast at night, with the exception of voluntary fasting².  And the highest council of scientists of Saudi Arabia said: “So that there is a firm intention to observe fasting. And it must be affirmed every night in the month of Ramadan. And help only comes from Allah. Peace and blessings of Allah be upon our Prophet Muhammad, and his family and companions!” (See fataua lajnatul-daimah lil bukhus almiya wal-ifta, 10/246). As for the issue raised by the venerable sheikh and eminent scholar Sheikh ibn Uthaymeen, may Allah have mercy on him, such a person's fasting is valid, based on the words of the Prophet ﷺ, who said: “My community has been forgiven for what was done by mistake, forgetfulness and what they were forced to do. (Ibn Majah 2045, al-Bayhaqi 7/356, at-Tahawi 2/56). Imam Malik said: “Whoever established his intention to fast at the beginning of the month of Ramadan, then this is enough for him for the entire month³.”",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Majmuu fatawa wa rasail 19/176, or Sheikh ibn Usaymin)"
        },
        {
          "source": "²(See Sahih Ibn Khuzayma 3/198)"
        },
        {
          "source": "³(See al-Istizkar 10/35)"
        }
       
      ]
    },
    {
      "id": 35,
      "subtitle": "Importance and dignity of suhoor (predawn meal)",
      "text": "Every Muslim should observe Suhoor during the last part of the night with the intention of fasting. The Messenger of Allah ﷺ said: **Eat Suhur. Surely, there is a blessing in Suhur. ** al-Bukhari 1923, Muslim 1095. Regarding the merits of performing suhoor, the Messenger of Allah ﷺ said: **Verily, Allah and His angels bless those who perform suhoor¹.** Suhur is also the difference between the fast of Muslims and the fast of Christians and Jews. The Messenger of Allah ﷺ said:  **Verily, the difference between our fasting and the fasting of the people of the book is suhoor².** The importance of suhoor is spoken of in many authentic hadiths. From Ibn 'Amr, Abu Sa'id and Anas (may Allah be pleased with them) it is reported that the Prophet ﷺ said: **Perform suhoor with at least a sip of water³.**  The Prophet ﷺ also said: **Truly, there is blessing in suhoor, so do not abandon it.** Ahmad 11003. The hadith is good. See Sahih al-Jami' 3683. The Prophet ﷺ also said: **The best suhoor for a believer is dates.** Abu Daoud. The hadith is authentic. See Sahih at-targib 1/448.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ahmad 3/12. Sheikh al-Albani called the hadith good)"
        },
        {
          "source": "²(Muslim 2/770.)"
        },
        {
          "source": "³(Ahmad, Abu Ya'la, Ibn Hibban. The hadith is authentic. See Sahih al-Jami' 2945)"
        }
       
      ]
    },
    {
      "id": 36,
      "subtitle": "Suhoor is desirable, but not required",
      "text": "Despite the importance and merits of suhoor, it is not obligatory. If a person did not perform suhoor before fasting, be it a voluntary or obligatory fast, or even more so overslept suhoor, then this does not affect the fast in any way and does not violate it, so that the fast should be interrupted or abandoned because of this. Imam Ibn al-Mundhir conveyed the unanimous opinion that it is desirable to perform Suhoor. See al-Ijma' 52. Question: “Is it possible to fast without suhoor (morning meal)?” Answer: “A person who is fasting should take morning food (suhoor) before sunrise, because this food is a support for fasting. In addition, the Prophet ﷺ encouraged taking morning food, explaining that there is grace in suhoor. However, if a person fasted without morning food, then his fast is valid¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Collection of Fatwas of the Standing Committee for Scientific Research and Fatwas (Second Collection), 9/26, No. 14093. Committee members: Abdullah ibn Gudayan, Abdur-Razzak 'Afifi, Abdul-'Aziz ibn Abdullah ibn Baz)"
        }
       
      ]
    },
    {
      "id": 37,
      "subtitle": "Suhoor time - 1",
      "text": "The time of Suhoor begins shortly before dawn. If a person eats a few hours before dawn or before going to bed, then it is not called suhoor. See al-Mausu'atul-fiqhiyya 3/269. It is advisable to postpone suhoor until the last part of the night, until morning prayer. Ibn 'Abbas said: I heard the Messenger of Allah ﷺ say: **We, the Prophets, were ordered to break our fast early and perform suhoor later¹.** Ibn 'Abbas reported that the Messenger of Allah ﷺ said: **The dawn is of two types: the dawn at which it is forbidden to eat and the morning prayer is permitted, and the dawn at which it is forbidden to perform the morning prayer but it is permitted to eat².** A person can eat until he is sure that it is beginning to get light. Allah Almighty said: **...and eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night)** (al-Baqarah 2: 187). Ibn Abbas said: Allah has permitted you to eat and drink until your doubts disappear (regarding the dawn)³. The statement that the cessation of eating and drinking, in order to avoid mistakes, should be before dawn, for example, ten minutes, is an innovation (bid'ah). Some schedules even have a separate line in which “imsak” is written (i.e., the time to stop eating and drinking) and a separate column for the beginning of morning prayer - this has no basis, and moreover, contradicts reliable hadiths. Abu Hurayrah reported that the Messenger of Allah ﷺ said: **If any of you hears the call (adhan) to prayer and a dish (of food) is in the hand of one of you, then he should not put it down until he has finished eating from it⁴.** This hadith indicates that the so-called time of refusal to eat (imsak), which is set 15-20 minutes before morning prayer, out of fear of eating until the onset of adhan, is an innovation. See Tamamul-minna 418. This hadith is confirmed by many reliable traditions. Abu Umama said: “Once, when they were called to prayer, Umar had a glass in his hand, and he asked the Prophet ﷺ: “Should I finish this, O Messenger of Allah?” He said:  **Yes, finish it.** Ibn Jarir at-Tabari 3017. The isnad of the hadith is good.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ibn Hibban, at-Tabarani, ad-Diya. The hadith is authentic. See al-Silsila al-sahiha 4/376)"
        },
        {
          "source": "²(Ibn Khuzayma, al-Hakim, al-Bayhaqi. The authenticity of the hadith was confirmed by Imam Ibn Khuzaima, al-Hakim and Sheikh al-Albani. See al-Silsila al-sahiha 693)"
        },
        {
          "source": "³('Abdu-Rrazzak, hafiz Ibn Hajar called the isnad reliable See Fathul-Bari 4/135.)"
        },
        {
          "source": "⁴(Abu Daud 1/549, Ahmad 2/423, al-Hakim 1/426, al-Bayhaqi 4/218, ad-Darakutni 2/165. The authenticity of the hadith was confirmed by Imam al-Hakim, Sheikh-ul-Islam Ibn Taymiyyah and Sheikh al-Albani. See al-Silsila al-sahiha 1394.)"
        }
       
      ]
    },
    {
      "id": 38,
      "subtitle": "Suhoor time - 2",
      "text": "Abu Zubair said: “I asked Jabir, what should a person do who wants to fast and has a glass of drink in his hand during the call? He said:  We also mentioned the same case to the Prophet ﷺ, and he said:  **Let him drink¹.** Sheikh al-Albani said: “In the hadith, by the words: **If any of you hears the call (adhan) to prayer,** the second adhan is meant. This is not the first adhan, which is incorrectly called the adhan of not eating (imsak). We should know that there is no basis in the Sunnah for calling the first adhan the adhan of refusal (imsak). It is narrated from Ibn Mas'ud (may Allah be pleased with him) that the Prophet ﷺ once said: **The call to prayer proclaimed by Bilal at night should in no case prevent you from eating before dawn, for he pronounces the words of the adhan to distract those who are awake among you and to awaken those who are sleeping, and not to announce the arrival of the time for morning prayer².** Another version of the hadith says: **Therefore, eat and drink until the adhan is proclaimed by Ibn Umm Maktoum.** Ibn Umm Maktoum proclaimed the second azan, which meant that food from that moment became forbidden, and that it was now time for the morning (fajr) prayer. But, nevertheless, the Prophet ﷺ made a remark, saying: **If any of you hears the call (adhan) to prayer and the dish is in the hand of one of you, then let him not put it down until he has finished eating from it.** Shaykh al-Albani also said: “Censure is fiqh and contrary to the Sunnah, telling people: If a person hears the second adhan and there is food in his mouth, he should spit it out. from which Allah and His Messenger ﷺ warned us, said: **And beware of going to extremes (guluw) in religious matters, for those who came before you were destroyed because of going to extremes in religious matters.** an-Nasai 2/49, Ibn Majah 2/242. The hadith was approved by al-Hakim, az-Zahabi, an-Nawawi, and Ibn Taymiyya. Ibn Umar reports that the Prophet ﷺ said: **Indeed, Allah the Most High loves that His permissions be practiced, just as he dislikes that disobedience to Him be committed.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ahmad 3/348. Hafiz al-Haythami called the isnad of the hadith good. See Majmu'u-Zzawaid 3/153.)"
        },
        {
          "source": "²(al-Bukhari 621, Muslim 2/768)"
        },
        {
          "source": "³(Ahmad 2/108, Ibn Hibban 2742, al-Qadai 1078. The hadith is authentic. See Sahih at-targhib 1059)"
        }
       
      ]
    },
    {
      "id": 39,
      "subtitle": "On the merits of breaking the fast (iftar)",
      "text": "Jabir said: “The Messenger of Allah ﷺ said: **At every breaking of the fast Allah has people whom He frees (from the Fire), and that happens every night¹.**",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ibn Majah 1643, Ibn Khuzaima 1883. Sheikh al-Albani called the hadith authentic)"
        }
       
      ]
    },
    {
      "id": 40,
      "subtitle": "When should you stop fasting?",
      "text": "From Umar ibn al-Khattab it is reported that the Messenger of Allah ﷺ said:  ** When the night approaches on this side and the day retreats on that side and the sun sets, he who fasts has reached the time to break it.** al-Bukhari 1954, Muslim 1100. It is also reported that once, when the Prophet ﷺ ordered one of his companions to prepare food for breaking the fast, he said: “O Messenger of Allah, He replied, It is still daytime.” The Messenger ﷺ did not answer this, but again ordered iftar to be prepared. The narrator of this hadith said: “We could see daylight in front of us when we broke our fast,” and then added: “If one of us had mounted his camel, he would have seen the sun.” al-Bukhari 1955. Shaykhul-Islam Ibn Taymiyyah said:  As soon as the disk of the sun disappears completely, the fasting person should break his fast, not paying attention to the red glow remaining on the horizon¹.” Or, as soon as they call for evening (magharib) prayer, the fasting person must break his fast. As for the muazzin who pronounces the adhan, he must be well aware of the times of prayers and their definitions, since he bears great responsibility. The Messenger of Allah ﷺ said: **Muazzins are those who guard the breaking of fast and suhoor of Muslims².”",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Majmu'ul-Fataawa 25/216.)"
        },
        {
          "source": "²(at-Tabarani. Hafiz al-Haythami, Imam al-Suyuty and Sheikh al-Albani called the hadith good. See Sahih al-Jami' 6647.)"
        }
       
      ]
    },
    {
      "id": 41,
      "subtitle": "On the need to hasten to break the fast",
      "text": "Everything said above applies to this section. Also in the hadith from Sahl ibn Sa'd (may Allah be pleased with him) it is said that the Messenger of Allah ﷺ said: **People will continue to adhere to good as long as they hasten to break the fasting¹.** Abu Hurayrah reported that the Messenger of Allah ﷺ said: **Religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so².**  'Amr ibn Maymun said: The companions of the Prophet Muhammad ﷺ were the fastest in breaking the fast and delaying suhur. Abdur-Razaq. Hafiz Ibn Abdul-Barr called the isnad authentic. See also Fathul-Bari 4/199. If a fasting person cannot find anything to break his fast, he should break his fast with intention, and not suck his finger, as some do.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bukhari 1957, Muslim 1092.)"
        },
        {
          "source": "²(Abu Dawud an-Nasai, al-Hakim. Hadith is good. See also Sahih al-Jami' 7689.)"
        }
       
      ]
    },
    {
      "id": 42,
      "subtitle": "With what and how should you break your fast?",
      "text": "Breaking the sun's fast begins with fresh or dried dates or water. The Messenger of Allah ﷺ said: **When one of you is breaking his fast, he should eat some dates. If dates are not available, then break it with some water, for water is purifying¹.** One should break the fast immediately with the call to the evening (magharib) prayer, until the perfection of this prayer, as the Prophet ﷺ did. Anas ibn Malik (may Allah be pleased with him) event: “I never saw the Messenger of Allah ﷺ perform the evening (maghrib) prayer when he fasted without breaking his fast with at least some water².” The fatwa of the Standing Committee says: “In accordance with the Sunnah, the fasting person should hasten to break the fast after he is convinced that the sun has set. The Messenger of Allah ﷺ said: **People will not be deprived of good until they do not rush to break the fast.** Sahih Al-Bukhari, (1957), Sahih Muslim, (1098). He also said in another hadith: **The most beloved servants of Allah before the Almighty are those who are in a hurry to break their fast.** Ahmad, (2/237 -238, 239), At-Tirmidhi, 3/83, (700), Abu Ya'la, 10/378, (5974) and others. The best thing for a fasting person is to break the fast with dates, and leave the meal after evening prayer (Maghrib). Thus, he will fulfill the Sunnah, hastening to break the fast, and collectively perform the evening prayer at the beginning of his time, following the Prophet ﷺ in this. Regarding the hadith: **No Salat (prayer) can be (rightly offered) with food brought (before the worshiper) or when he is resisting the urge to relive himself of the two filths** (i.e. urine and feces). Sahih Muslim, (560), Sunan Abu Dawood, (89), Musnad Ahmad (6/73), as well as the hadith: **If they bring dinner and (at this time) announce the beginning of prayer , then start with dinner².** All these hadiths mean that the one to whom food is served, as well as the one who sits at the table, should start with food before performing namaz. All this is so that during prayer a person does not think about food, and his heart is humble. However, a person should not ask to be served food before prayer if he knows that this will result in him not being able to perform the prayer at the beginning of his time or missing the congregational prayer. Collection of fatwas of the Standing Committee on Scientific Research and Fatwas (second collection), 9/32-33 (No. 18372). Committee members: Bakr Abu Zeid, Salih Al-Fawzan, Abdullah ibn Gudayan, Abdul-'Aziz Al Ash-Sheikh, Abdul-'Aziz ibn Abdullah ibn Baz.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Abu Daud 2355, at-Tirmizi 658, Ibn Majah 1699. The authenticity of the hadith was confirmed by the imams Abu Hatim, Abu Isa at-Tirmizi, Ibn Khuzaima, Ibn Hibban, al-Hakim, az-Zahabi.)"
        },
        {
          "source": "²(Abu Ya'la, Ibn Khuzaima. Sheikh al-Albani confirmed the authenticity. See “Sahih at-targhib” 1076.)"
        },
        {
          "source": "²(Al-Bukhari 1/164, 6/215, Muslim 557, At-Tirmidhi 353, An-Nasai 853, Ibn Majah 933)"
        }
       
      ]
    },
    {
      "id": 43,
      "subtitle": "dua before breaking fast",
      "text": "From 'Abdullah ibn 'Amr (may Allah be pleased with him) it is reported that the Messenger of Allah ﷺ said: **Verily, the prayer of a person who fasts before breaking his fast is not rejected¹.** The Prophet ﷺ after breaking the fast said: **The thirst is gone, the veins are moistened, and the reward is confirmed, if Allah wills.**\n**Dhahabaz-zama', wabtallatil-`urūqu, wa thabatal-'ajru inshaAllah²**\nSheikh 'Abdul-Muhsin al-'Abbad said in Sharh Sunan Abi Daud: This dhikr can be said both before and after iftar.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ibn Majah 1753, al-Hakim 1/422. Hafiz Ibn Hajar, al-Busayri and Ahmad Shakir confirmed the authenticity of the hadith.)"
        },
        {
          "source": "²(Abu Daoud 2357, al-Bayhaqi 4/239. The authenticity of the hadith was confirmed by Imam ad-Darakutni, al-Hakim, al-Zahabi, al-Albani.)"
        }
      ]
    },
    {
      "id": 44,
      "subtitle": "Intentional eating during the daytime of Ramadan",
      "text": "Allah Almighty said: **...and eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night)** (al-Baqarah 2: 187). Shaykh Ibn al-Qayyim said: “There is no disagreement that intentionally eating and drinking breaks the fast². Anyone who intentionally ate during daylight hours in Ramadan has committed a great sin, for which he must bring great repentance. Most scholars (jumhur) also said that if a person deliberately swallows food stuck between his teeth, then his fast becomes invalid. Imam Ibn Qudamah said: “The situation of one who has food left between his teeth is divided into two types: If a very small piece of food is swallowed and it was not possible to spit it out, then the fast is not broken, because it is like saliva. Ibn al-Mundhir said, that scholars are unanimous on this. The second type is when there is a large piece of food left between the teeth that can be spat out. And if he swallows this piece consciously, then his fast is broken according to the majority of scholars, since this is tantamount to eating¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See al-Mughni 3/260.)"
        },
        {
          "source": "²(See Zadul-ma'ad 2/60.)"
        }
      ]
    },
    {
      "id": 45,
      "subtitle": "Smoking",
      "text": "Smoking also breaks the fast, moreover, it is a violation of the fast through the forbidden¹. And Sheikh Uthaymeen (an-Nur ala ad-Darb entry No. 140 (a) 15:00 and entry No. 171) also spoke about this.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataua Islamiya 2/183. Sheikh al-Albani (Fataawa Jeddah entry No. 28, 11:47))"
        }
      ]
    },
    {
      "id": 46,
      "subtitle": "Nutritional injections",
      "text": "Injections that are a substitute for food or drink breaks the fast. The Standing Committee (10/252) was asked about the fatwa regarding injections during Ramadan, be it medicine or meal replacement. They replied: It is permissible, if necessary, to take injections into a vein or into a muscle during fasting, but it is not permissible for this to be a substitute for food, because it is similar to eating or drinking, in which case such an injection will break the fast of Ramadan. But it would be better if injections will be given at night. The fast is broken if, during the fast, a person is given a nutritional injection, with which he can go without food or drink. In this case, the injection plays the role of food and drink, as Sheikh Ibn 'Uthaymeen said¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Majalis Shahr Ramadan (P. 70))"
        }
      ]
    },
    {
      "id": 47,
      "subtitle": "Sexual intimacy during daylight hours of Ramadan",
      "text": "The hadith says: “Verily, sexual intercourse breaks the fast.” See Sahih Ibn Khuzayma 3/242. Anyone who intentionally committed sexual intercourse in Ramadan during fasting in such a way that two genital organs came together, and inserted the head into the genital organ or anus, broke his fast. And it makes no difference whether there was ejaculation or not. Such a person must repent, continue fasting on this day, then make up for this day and, in addition to this, make atonement (free a slave, if he cannot, then maintain a continuous fast for two months, if he is not able, then feed 60 poor people). There is no disagreement among scholars regarding the fact that intercourse during the daylight hours of Ramadan breaks the fast¹. The ban on copulation is lifted after sunset. Allah Almighty said: ** It is made lawful for you to have sexual relations with your wives on the night of As-Saum (the fasts). They are garment (calmness) for you and you are the same for them.** (al-Baqarah 2: 187).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See ad-Durarul-mudyya 2/22.)"
        }
      ]
    },
    {
      "id": 48,
      "subtitle": "Intentionally inducing vomiting",
      "text": "It is reported from Abu Hurayrah (may Allah be pleased with him) that the Messenger of Allah ﷺ said: **Whoever is overcome and vomits is not to make up for the day, but whoever vomits intentionally must make up the day.** See Al-Ijma 47. If a person intentionally caused vomiting, he committed a sin, for which he should also repent. Imam Ibn al-Mundhir said: “Scholars are unanimous that the one who caused vomiting intentionally broke his fast². It should be noted that the imams have long disagreed regarding this hadith, despite the fact that all its transmitters are reliable, since some imams believed that there was confusion in it. The narrator of this hadith named ‘Isa ibn Yunus said: “The people of Basra stated that Hisham ibn Hassan made a mistake in this hadith.” See Musnad al-Darimi (1/561). Among the possessors of knowledge who considered this hadith weak: Ahmad, al-Bukhari, at-Tirmidhi, al-Bayhaqi, Ibn Kathir, Ibn Hajar. See “Masail Abi Dawood” (1864), “al-Ilal al-kabir” (p. 115), “al-Sunan al-kubra” (4/370), “Irshad al-faqih” (1/287 ), “Hidayatu-rrua” (1948). Supporters of this opinion spoke about the weakness of either a specific version of this hadith, or believed that it was correct that these words actually belonged to Abu Hurayra himself, and not to the Prophet (peace and blessings of Allah be upon him). After all, 'Umar ibn Hakim narrated from Abu Hurayrah (may Allah be pleased with him) that he said: “If one of you vomits, then his fast is not broken, for thereby something came out of him, and did not enter into him. al-Bukhari in “at-Tarikh (1/353). As for the possessors of knowledge who considered this hadith reliable, among them: Ibn al-Jarud, Ibn Khuzaima, Ibn Hibban, 'Abdul-Haqq al-Ishbili, Ibn Qudama, al-Munziri, Ibn al-Salah, an-Nawawi, Ibn Taymiyya, az-Zahabi, Ibn al-Qayim, Ibn al-Mulyakqin, Ahmad Shakir, 'Ubaydullah al-Mubarakfuri, Ibn Baz, al-Albani, 'Abdul-Qadir al-Arnaut, Shu'ayb al-Arnaut. See al-Muntaqa (424), al-Ahkam as-sug’ra (1/388), “al-Kafi” (1/441), Sharh mushkil al-Uasyt (3/196), “ al-Majmu' (6/323), al-Badr al-munir (5/661), Majmu'ul-Fataawa (25/222), Raf' al-yadein (p. 187) , Iru'a al-g'alil (923), Mir'at al-mafatih (6/514), Fataua Ibn Baz (15/276), Sahih Abu Daud (2059), Tahrij Jami' al -usul (4405), Tahrij al-Musnad (10463). The scholars who called this hadith authentic believed that Hisham ibn Hassan is a reliable transmitter without a doubt, especially since he conveys this hadith from the words of Ibn Sirin, and Hisham is one of the most accurate and reliable transmitters regarding Ibn Sirin, as reported by Ibn Abi ' Aruba. For this reason, they did not see any compelling and justifiable reasons for weakening this hadith. However, those who considered this hadith weak spoke out about this not for the reason that they considered Hisham weak and not because he secluded himself in this transmission, but for the reason that they believed that he made a mistake in this hadith. In any case, all the imams relied on this hadith and did not disagree that the fast of someone who vomits is not accidentally broken, but the fast of someone who causes vomiting is deliberately broken. For this reason, Imam at-Tirmidhi, despite the fact that he mentioned the words of al-Bukhari about the weakness of this hadith, nevertheless said after that: “But the possessors of knowledge relied on this hadith from Abu Hurayrah. See al-Sunan (3/90). Ibn al-Mundhir said: “Scholars are unanimous that the one who caused vomiting intentionally broke his fast.” See al-Ishraf (3/129). Al-Khattabi said: “I know of no disagreement among those who have knowledge that the one who vomited by chance did not break his fast, and that the one who caused the vomiting is consciously obliged to make up for that day.” See Ma'alim al-Sunan (2/112). Ibn Qudamah said: And this is the opinion of all scholars. See al-Mughni (4/368).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
       
      ]
    },
    {
      "id": 49,
      "subtitle": "Response to asar from Abu Hurairah regarding intentional vomiting",
      "text": "As for the message from Abu Hurayrah (may Allah be pleased with him), who said: “If one of you vomits, then his fast is not broken, for thereby something came out of him, and did not enter into him.” al-Bukhari in “at-Tarikh” (1/353). Imam al-Bukhari, citing this message in his collection “al-Sahih,” said: “But it is also reported from Abu Hurayrah that the one who pulled out broke his fast, but the first message is more reliable.” See Sahih al-Bukhari (2/685). Hafiz Ibn Hajar said about these words of his: “It is possible to combine the words of Abu Hurayrah regarding the fact that the one who pulled out did not break the fast with his words that he broke the fast by what was explained in the prophetic hadith.” See “Fathul-Bari” (4/175). Those. this is united by the fact that the fast is broken precisely if the vomiting was intentionally, and not broken if the vomiting was involuntary. But even if someone insists that the prophetic hadith of this chapter is weak, and that there is no unanimous opinion on this issue, as al-Shaukani said, besides Abu Hurayrah believed that vomiting does not break the fast in any case, then this should be answered: It is narrated with authentic isnad as the sun from Ibn 'Umar (may Allah be pleased with him) that he said: “Whoever causes himself to vomit during fasting is obliged to make up for that day, and whoever has involuntary vomiting, he is not obliged to do anything.” compensate. Malik in al-Muwatta (750), al-Shafi'i in al-Umm (2/110). The authenticity was confirmed by Ibn al-Athir and Badruddin al-‘Aini. See “Sharh Musnad al-Shafi'i” (3/187), Nuhab al-afkar (8/529). This asar was narrated by Malik from Nafi’a, who narrated from Ibn ‘Umar. The imams called this isnad “golden”, considering it one of the most reliable. And these words of Ibn ‘Umar strengthen the hadith of this chapter. But even if we assume that there are two conflicting opinions among the companions on this issue, then Sheikh-Islam Ibn Taymiyyah said perfectly regarding this issue: “Even if there were no prophetic hadith in this chapter, and the opinion of the companions was divided, then it would be more primary to follow for the opinion of the one who said that conscious vomiting breaks the fast. After all, breaking the fast by vomiting cannot be drawn from the analogy with breaking the fast by eating and drinking. Anyone who denied breaking the fast by deliberate vomiting relied on the obvious proposition that fasting breaks what goes inside. And the one who obliged breaking the fast relied on additional knowledge and the Sunnah, which was hidden from others.” See Sharh al-Umda (1/403).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
      
      ]
    },
    {
      "id": 50,
      "subtitle": "Сonclusion",
      "text": "Thus, the opinion that the one who vomited deliberately breaks his fast is more justified and reasoned for several reasons: First, there is a direct prophetic hadith on this topic, despite disagreement regarding its authenticity. Secondly, on this topic there are also reliable words from Ibn ‘Umar, which strengthen the prophetic hadith. Thirdly, regarding this issue, many imams conveyed a unanimous opinion. And Allah knows best about everything. It should be noted that if a person intentionally caused vomiting, then in addition to making up for the fast, he must also repent, since by doing so he committed a sin, since he violated the obligatory fast without a Shariah reason. And here another question arises: “And if a person was forced to induce vomiting, does he thereby commit a sin and is his fast broken in this case?” Answer: “Yes, his fast is broken because his vomiting was conscious and not voluntary, but there is no sin on him for this, since he had a need for it.” Sheikh Ibn ‘Uthaymeen said about this: “If a person deliberately vomits without a reason, then this act is prohibited in relation to the obligatory fast, since it breaks the fast. If he caused vomiting for a reason, then we will say: “You broke your fast.” Why? Because he vomited for a reason that allowed him to break his fast. And to such a person we say: “Now you can eat and drink (during the daytime of Ramadan).” After all, anyone who breaks his fast for a Sharia reason is allowed to eat and drink. Remember this rule, it is very useful for a person: “Whoever breaks his fast for a Sharia reason at the beginning of the day, he is allowed to eat and drink for the rest of the day.” We say to the fasting person: “If the doctors told you or you yourself see what should be vomited, as, for example, a person is poisoned by food, and the best cure for this is to induce vomiting, and if a person vomits up all this poisoned food, then we say to him: “You caused vomiting for a Shariah reason, therefore, eat and drink so that your strength returns.” For this reason, the urge to vomit in such a case is the mercy of Allah. However, if a person does not need it, then we tell him: “Do not deliberately pluck while observing the obligatory fast, as this will ruin your fast.” Sl. “Jalasat Ramadaniya” (No. 9).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
      
      ]
    },
    {
      "id": 51,
      "subtitle": "Menstruation and postpartum bleeding",
      "text": "If during fasting a woman begins to menstruate or has postpartum bleeding, then she is obliged to break the fast, and there is no disagreement among scholars regarding the fact that in such a state it is forbidden to fast and that the fast is not valid¹. If a woman expects that her period will come tomorrow, she should still maintain her intention and continue fasting. She should not break her fast until her period begins.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Sahih fiqhu-Sunnah 2/105.)"
        }
      ]
    },
    {
      "id": 52,
      "subtitle": "Is it permissible to take pills that prevent menstruation?",
      "text": "When Ibn Umara asked a woman who wanted to take a medicine to stop her periods, he replied that he saw nothing wrong with it¹. However, if such pills cause harm to health, you should not take them! And often, after taking any medications, women’s menstrual cycles are disrupted.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Ab-Razzaq 1219. Ibn Abi Najih also answered. Abdur-Razzak 1220.)"
        }
      ]
    },
    {
      "id": 53,
      "subtitle": "Does the intention to break the fast break the fast?",
      "text": "Anyone who intends to break a fast becomes invalid, whether he does so or not, since “actions are related to intentions.” However, there is no unanimous opinion among scholars on this issue. Other scholars said that if a person intended to break his fast for a day for a good reason, for example, he decided to go on a journey but then changed his mind, then his fast is still valid. He is like a man who intended to say something during prayer, but did not do it. However, in order to avoid mistakes and to resolve disagreements, one should make up for the fast later, because the intention, as Sheikh Abdur-Rahman al-Sa'di said, is the basis of any worship, which, if violated, violates the worship! Shaykh Ibn 'Uthaymeen (may Allah have mercy on him) was asked: “A man decided to break his fast one day in the month of Ramadan, but then he changed his mind. What is the judgment regarding this situation?” The sheikh replied: “The fast that he intended to break is considered broken and invalid.” The Prophet ﷺ said: **Truly deeds  are to be judged only by intentions, and a man will have only what he intended.** and therefore when this person decided to break the fast, his fast interrupted, and he is obliged to make up for that day. He cannot resume the intention of observing fasting during the light period of the day of fasting, since it is necessary to confirm the intention of observing obligatory fasting before the time of morning prayer, otherwise the fast will not be valid. This is supported by the words of the Almighty (semantic translation): **And eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night)** (al-Baqarah 2: 187). A person who has confirmed the intention to fast only during the light period of the day cannot be considered to have fasted the whole day, for it is necessary to confirm the intention to observe the obligatory fast before the time of morning prayer². The sheikh was also asked the question: “Is the fast broken by a firm intention to break it, even if the person has not eaten or drunk?” Answer: “It is known that fasting consists of [two pillars] - intention and abstinence. A person intends through his fast to get closer to Allah (Almighty and Great is He), abstaining from everything that makes the fast invalid. And if a person really firmly decides to break his fast , then his fast becomes invalid. If it was on the fasting day of the month of Ramadan, then he [despite the fact that his fast is broken and invalid] must still abstain until sunset from everything that breaks the fast of a person. Since the one who during the obligatory fast of the month of Ramadan, without a valid reason from the point of view of Sharia, he committed something that violates the fast, is obliged to observe the fast of this day until the end, and then compensate for it. Regarding the one who did not have a firm intention, but was only in hesitation , the scholars disagreed; some said that this breaks the fast, since hesitation is incompatible with firm conviction [to observe the fast, which must be present throughout the entire period of fasting]. Others said that hesitation does not break the fast, because one must proceed from the fact that a person’s original intention to observe the fast remains until he replaces this intention with a firm decision to break the fast. And this opinion, in my opinion, is more correct, but Allah knows best about this! (See Majmoo' Fatawa wa Rasa'il ash-Sheikh Muhammad bin Salih al-'Usaymeen 19/187-188).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Al-Muhalla 6/175, Al-Mughni 3/25, Al-Majmu 6/314.)"
        },
        {
          "source": "²(See Majmu' Fatawa wa Rasa'il al-Sheikh Muhammad bin Salih al-'Uthaymeen 19/187.)"
        }
      ]
    },
    {
      "id": 54,
      "subtitle": "Apostasy (riddah)",
      "text": "There is no disagreement among scholars that apostasy breaks the fast, just like all other things. See al-Mughni 3/25. Allah Almighty said:  **And indeed it has been revealed to you (O Muhammad!), as it was to those (Allah’s Messengers) before you: If you join others in worship with Allah, (then) surely (all) your deeds will be in vain, and you will certainly be among the losers. (al-Zumar 39: 65).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
       
      ]
    },
    {
      "id": 55,
      "subtitle": "Nasal drops",
      "text": "Question:  Do nasal drops break the fast? Answer of Sheikh 'Uthaymeen (rahimahu-Allah): Our answer is this - drops in the nose if they get into the stomach, then they break the fast (spoil the fast), because the Messenger of Allah, may Allah bless him and grant him peace, said in the hadith of Laqyit ibn Sabira: “Rinse your nose thoroughly unless you are fasting,” and therefore it is not permissible for a fasting person to use nasal drops that enter the stomach. As for what does not enter the stomach, be it nasal drops, they do not break the fast¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See “Sharh Mumti”, Majmu’ al-Fataawa Sheikh, 551).)"
        }
      ]
    },
    {
      "id": 56,
      "subtitle": "Aromatic smells and smoke",
      "text": "The Standing Committee of scholars was asked: I am one of the workers of the state water treatment corporation and the month of Ramadan is approaching when we are fasting and working and there is steam coming out of the station where we are working which we sometimes inhale. Does this break our fast? Do we need to compensate for the day on which we inhaled the vapor, regardless of whether it was an obligatory or voluntary fast, and should we give alms for each day? They replied: If the situation is as you described, then your fast is considered valid and you are not obligated to compensate for anything¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Fatwas of lajnah ad-daimah 10/275)"
        }
      ]
    },
    {
      "id": 57,
      "subtitle": "Food, drink and sexual intercourse by forgetfulness",
      "text": "It is reported from Abu Hurayrah (may Allah be pleased with him) that the Prophet ﷺ said: **Whoever forgets that he is fasting, and eats or drinks is to complete his fast, as it was Allah who fed him and gave him something to drink.** al-Bukhari 1933, Muslim 2/171. Most scholars relied on this hadith, and only Imam Malik believed that this requirement only applies to a voluntary situation. However, his opinion is unacceptable since another hadith clearly and clearly states that we are talking about the fast of Ramadan. The Messenger of Allah ﷺ said: **If a person forgetfully ate on the fasting day of the month of Ramadan, then he should neither make up for this day nor perform expiatory actions¹.** If anyone sees someone eating or drinking out of forgetfulness, he is obliged to stop him and remind him that he is fasting, since the Prophet ﷺ said: **Let the one of you who sees something wrong change it.** Muslim 1/78. Hasan al-Basri and Mujahid said: “Whoever commits sexual intercourse out of forgetfulness should not make any compensation.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Hakim 1/420, ad-Darakutni 2/178. The authenticity of the hadith was confirmed by Imam al-Hakim, al-Bayhaqi, Hafiz al-Zahabi, Imam al-Nawawi, Hafiz Ibn Hajar and Sheikh al-Albani.)"
        },
        {
          "source": "²(See Sahih al-Bukhari 1/452.)"
        }
      ]
    },
    {
      "id": 58,
      "subtitle": "Swallowing drool and phlegm",
      "text": "There is no disagreement among scholars regarding the permissibility of swallowing saliva during fasting. 'Ata said: Swallowing drool does not break the fast. See Sahih al-Bukhari 1/451. Even if a person deliberately accumulated saliva in order to swallow it all at once, then, according to the most correct opinion, his fast is also not broken. See al-Mughni 3/106. However, it is better not to do this. As for swallowing phlegm or anything from the nasopharynx, scholars have differing opinions regarding the permissibility of swallowing this. Imams Ahmad and al-Shafi'i believed that swallowing phlegm does not break the fast. See Raddul-makhtar 2/101, al-Mughni 2/43. The opinion that swallowing phlegm breaks fasting is difficult for Muslims, and the purpose of Sharia is to alleviate the situation of Muslims, and not to make it difficult, especially considering that there are no prohibitions on this either in the Quran, or in the Sunnah, and not in this issue is the unanimous opinion of scholars (ijma'). See Sahih fiqhu-Ssunna 2/117. Sheikh al-Albani also preferred this opinion, and when asked: “Does swallowing phlegm break the fast?”, he answered: No, it does not break the fast.” Sl. Silsilatu khuda ua-nnur No. 52. However, if a person extracts sputum from the nose or throat into the mouth, then one should not swallow it, but should spit it out¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Raudatu-ttalibin 2/360.)"
        }
      ]
    },
    {
      "id": 59,
      "subtitle": "Hugs and kisses",
      "text": "During fasting, it is permissible for both husband and wife to kiss, hug and caress each other. 'Aisha said: **During the fast, the Prophet ﷺ often hugged and kissed his wives, but he controlled himself better than any of you.** al-Bukhari 1927, Muslim 1/65. It is also reported that Masruk, Aisha's nephew, asked her: “What is permitted for a husband and wife during fasting?” She replied: “Everything except intercourse.” 'Abdur-Razzak 4/190. The authenticity was confirmed by Hafiz Ibn Hajar. See Fathul-Bari 4/183. These hadiths indicate that a fasting person can hug and caress his wives if he is sure that it will not end in sexual intercourse. If a person is weak and knows that he cannot restrain himself, then he should refrain from doing so. There is an important rule in Sharia: “What leads to the forbidden is also forbidden.” If during kissing a person secretes a clear liquid (lubricant), then his fast is not broken. The proof of this is that there is no evidence that these discharges break the fast. Fasting is a rite of worship, and it is possible to assert that one or another rite of worship becomes invalid only if there are reliable texts of the Quran and Sunnah¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Sharkhul-Mumti' 6/397.)"
        }
      ]
    },
    {
      "id": 60,
      "subtitle": "Does fasting breake conscious ejaculation without sexual intercourse?",
      "text": "Most scholars believed that a person who ejaculated not due to sexual intercourse then his fast was broken and that this day must subsequently be compensated. At the same time, they relied on the Holy Hadith, which reports that Allah Almighty said: Fasting is done for My sake, and I will reward it, for a person refuses the satisfaction of his passions and his food for My sake!  Muslim 1151. And in another version of this hadith it is said: “Because he leaves food for My sake, drink for Me, pleasure for Me and wife for My sake!” Ibn Khuzayma 1151. Isnad is authentic. Ibn Qudamah said: The one to whom this happened because kissing ejaculated broke his fast, and we do not know any disagreement about this¹. But it should be noted that pollution (ejaculation during sleep) does not break the fast, it is about intentional ejaculation due to a kiss or hug or masturbation, May Allah Almighty protect us all from actions that lead to breaking our fast.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fathul-Bari 4/151-152.)"
        }
      ]
    }
  ]
}