{
  "id": "15",
  "author": "Islam forum",
  "category": "Fiqh",
  "published": "2015",
  "lang": "En",
  "title": "Ramadan a comprehensive guide volume 2",
  "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FRamadan%20volume-2.jpeg?alt=media&token=0de6fff0-9cc5-47d4-9c41-cd9a2d6356dc",
  "chapters": [
    {
      "id": 61,
      "subtitle": "Constant bleeding in women (al-istihadah)",
      "text": "Painful bleeding in a woman does not affect prayer, fasting, or other forms of worship. This blood is not impurity (najasa), and a woman with istihadah is allowed everything that is prohibited for women who have menstruation or postpartum bleeding¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Sahih fiqhu-Ssunna 1/216-217.)"
        }
      ]
    },
    {
      "id": 62,
      "subtitle": "Swallowing dust and anything accidentally put into your mouth",
      "text": "Sheikh Ibn Baz said: “If a fasting person gets hurt or comes out of church with a nosebleed, or accidentally water or gasoline opens his mouth without his desire, then this will not hinder his fast².” Moreover, if dust, smoke or a fly accidentally enters his mouth, this will also not affect his fast. Things that cannot be avoided when swallowed, such as saliva or dust from dry earth, do not break the fast. If a person collects a sufficient amount of saliva in the mouth and then swallows it on purpose, then this does not break the fast, according to the strictest opinion¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Al-Mughni 3/106.)"
        },
        {
          "source": "²(See “Fataua Islemya” 2/134.)"
        }
      ]
    },
    {
      "id": 63,
      "subtitle": "Forbidden words and looks",
      "text": "**Five things break the fast and ablution: lying, gossip, slander, looking with passion and a false oath.** This hadith is unreliable¹. However, despite the fact that the things listed in this unreliable hadith do not break the fast, these things are great sins in Islam, devaluing the fast and reducing the reward for it!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See as-Silsila ad-da'ifa wal-maudu'a 1708.)"
        }
      ]
    },
    {
      "id": 64,
      "subtitle": "Oxygen equipment for asthmatics",
      "text": "Oxygen equipment used for asthma does not break fasting, because the compressed gas going into the lungs is not food and the need for it is constant, both in Ramadan and at other times¹. Oxygen equipment used for asthma does not break fasting, because the compressed gas going into the lungs is not food and the need for it is constant, both in Ramadan and at other times. See Sab'una masala fi-ssyam 36. Question to Sheikh Muhammad 'Ali Farkus: A woman suffering from asthma wonders whether it is possible to use an oxygen tank, which helps open the airways, by inhaling the medicines contained in it, be it during Ramadan or at other times, i.e. when she is fasting?. Answer: “If the components of the canister are expressed in oxygen (oxygen), which helps open the respiratory pipes, then we do not see any obstacle to its use, be it in Ramadan or at other times. This cannot be considered as something that breaks the fast. If the components consist of substances that change from vapor to liquid, and leave a taste and reaction when taken into the throat and then into the stomach, then it will be considered as breaking the fast.Based on the last point, if a person uses it once or twice a day Ramadan, then he is considered as a sick person who will have to make up for those days in which he opened his fast. And if the use of this occurs during most of Ramadan, so that it goes beyond the usual limits, then in that case, he is considered as a sick person chronic illness, who will have to atone for his fasts (by feeding the poor)",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Sab'una masala fi-ssyam 36.)"
        }
      ]
    },
    {
      "id": 65,
      "subtitle": "Contact lenses",
      "text": "It is allowed to use contact lenses while fasting. The permissibility of their use is not affected by the fact that they are in a cleaning solution before use. The most that can happen is that some of the solution will seep into the eyes, but this is similar to using eye drops. And eye drops do not spoil the fast, as the correct opinion of scientists says. Shaykh Ibn 'Uthaymeen (may Allah have mercy on him) said: There is nothing wrong with a fasting person using antimony for the eyes, eye drops or ear drops. Even if he tastes the drops in his mouth, this will not break the fast. Because they are not food or drink and do not replace them. The proof of this is that it is forbidden to take food and drink during fasting, and what does not act as food or drink is not forbidden. What we have mentioned is the opinion that the sheikh chose l-Islam Ibn Taymiyyah, may Allah have mercy on him. And this opinion is correct¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Fiqhu-l-'ibadat. P. 191)"
        }
      ]
    },
    {
      "id": 65,
      "subtitle": "Bleeding in the mouth",
      "text": "Question: “I have bleeding in my mouth during fasting. It occurs when I wake up from sleep and when I rinse my mouth with water during prayers. If I rinse my mouth two or three times, the amount of blood decreases and the color becomes light red and sometimes yellow. How should I swallow saliva, considering that the bleeding sometimes continues for a while? And what is the position of swallowing saliva that is yellow in color if it does not taste like blood? Considering that I went to the doctor and he prescribed me a medicine that did not have any beneficial effect. Answer: “If the situation is as you described, then you should get rid of the blood that mixes with saliva by rinsing your mouth. You should be careful not to swallow any of it. And what remains of the small amount of traces (blood) of yellow color in saliva, then there is no problem for you, and your fast is valid if Allah wills.” Standing Committee on Scientific Research and Fatwas. Abdulaziz ibn Abdullah ibn Baz. Abdulaziz Ali Al-Sheikh. Salih Al-Fawzan. Bakr Abu Zeid¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fatawa Al-Lajna ad-Daima, 2 set, 9/210)"
        }
      ]
    },
    {
      "id": 66,
      "subtitle": "Pregnant and breastfeeding women can break the fast if necessary",
      "text": "That pregnant and breastfeeding women can break their fast if necessary Anas ibn Malik reported that the Messenger of Allah ﷺ said: “The Great and Almighty Allah freed travelers from fasting and half the prayers, and freed pregnant and breastfeeding women from fasting¹. A pregnant or breastfeeding woman may not fast if she fears for herself, for the fetus, or for loss or lack of milk, and there is no disagreement among scientists about this. However, if they are able to fast without fear for all of the above, then they are prohibited from leaving the fast, for Allah Almighty says: **And that you fast is better for you if only you know!** (al-Baqarah 2: 184). Ibrahim an-Naha'i said: “One day a woman came to Alqama and said: “I am pregnant, but I am able to fast, but my husband forbids me to do so.” Then Alqama said to her: “Obey Allah and do not obey your husband! 'Abdur-Razzaq No. 7566. Imam Ibn 'Aqil said: If a pregnant or breastfeeding woman fears for the fetus or child, then they should not fast, and if they do not fear (for their health), then they are forbidden not to fast! See al-Insaf 7/382. Sheikh Ibn 'Uthaymeen said: It is not permissible for a pregnant or breastfeeding woman not to fast, except when necessary! See Fataua al-syam 161. Thus, a pregnant or breastfeeding woman may not fast only in case of concern, and not simply because of breastfeeding or pregnancy, as many believe.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(at-Tirmidhi 715, Abu Dawud 2408, an-Nasai 2277. The authenticity of the hadith was confirmed by Imam Abu 'Isa at-Tirmidhi, Imam Ibn Khuzaimah and Sheikh al-Albani.)"
        }
      ]
    },
    {
      "id": 67,
      "subtitle": "Miscarriage",
      "text": "If a pregnant woman has a miscarriage while the fetus is forming various parts of the body, such as the head or arms, then such a case is considered as an-nifas (postpartum bleeding), and the woman does not fast. If the miscarriage occurs in the early stages of pregnancy (up to eighty days), then the provisions related to istihadah (painful bleeding) apply to the woman and she should not leave her fast¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataawa al-Lajna ad-daimah 10/224.)"
        }
      ]
    },
    {
      "id": 68,
      "subtitle": "Are missed fasting days due to pregnancy and breastfeeding reimbursed?",
      "text": "Regarding this issue, there are five well-known opinions among scientists, of which only one is correct, since there is only one truth, and contradictory disagreements have nothing to do with it. Imam Malik said: “I swear by Allah, there is only one truth and two contradictory opinions cannot be correct at the same time¹!” The correct opinion is that pregnant and breastfeeding women are not obliged to make up for it, but must feed one poor person for each missed day. This was the opinion of Ibn 'Abbas and Ibn 'Umar, and they were also followed in this matter by Sa'id ibn al-Musayib, Sa'id ibn Jubair, Qatada, Qasim ibn Muhammad, Ishaq ibn Rahawayh, Said Sabik and al-Albani. See al-Imam bi ahkami-ssyam 300-301, Sahih fiqhu-Ssunna 2/125. Ibn 'Abbas in relation to the verse: **And as for those who can fast with difficulty, they have (a choice either to fast or) to feed poor person** (for every day). (al-Baqarah 2:184) said that it was canceled by the command to fast, and then added: “It is established that the feeding of one poor person for each missed day is established for the old man and the old woman who are unable to fast, as well as for the pregnant and breastfeeding woman who fear (for the children). al-Bayhaqi 4/230, Ibn al-Jarud 381. The authenticity was confirmed by Imam an-Nawawi, Sheikh Ahmad Shakir and Sheikh al-Albani. Ibn 'Abbas also said: **If a pregnant woman fears for herself, and a breastfeeding woman fears for her child, then they leave the fast in the month of Ramadan and feed one poor person for each missed day, and they do not have to make up for their fast².** It is also reported that Ibn 'Abbas said to the pregnant woman: **You are one of those who can fast with difficulty, so feeding the poor is upon you, not compensation.** al-Bazzar 1/365. Imam ad-Darakutni and Hafiz Ibn Hajar confirmed the authenticity. It is also reported that one day Ibn 'Umar, seeing that his pregnant wife was finding it difficult to fast, said to her: “Leave fasting, since you are one of those who cannot observe it. Therefore, feed the poor for every day and do not make up for your fast.” . Nafi' said that Ibn 'Umar ordered the same thing to his pregnant daughter. ad-Darakutni 2/207/10. The authenticity of the isnad was confirmed by Imam ad-Darakutni and Sheikh al-Albani. See Iruaul-gaalil 4/20. Such famous imams from among the followers (tabi'un) as Sa'id ibn Jubair and Qatada also said: A pregnant woman who fears for her child does not fast, and a breastfeeding woman who fears for her child does not fast. They must for each the missed day to feed the poor, and they are not obliged to make up the fast³.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Jami'ul-bayanil-'ilm 2/82.)"
        },
        {
          "source": "²(at-Tabari 2758 and others. The authenticity of the isnad was confirmed by Hafiz Ibn 'Abdul-Barr in al-Istizkar 3/364, Ibn Hajar in al-Matalibul-'aliya 1/258 and Sheikh al-Albani in Iruaul-Galil 4/19.)"
        },
        {
          "source": "³('Abdur-Razzak 7555, 7556.)"
        }
      ]
    },
    {
      "id": 69,
      "subtitle": "That a pregnant/breastfeeding woman should not make up for fasting, but should feed the poor for the missed day",
      "text": "As we can see, of the five opinions mentioned, the strongest and most well-reasoned is the fifth opinion, which is that a pregnant and breastfeeding woman should not make up for fasting, but should feed one poor person for each missed day. This opinion is the strongest for the following reasons: Firstly, it is the opinion of the companions of the Prophet ﷺ, who witnessed the revelation of the Quran and who knew its meaning better than others. Among these companions is Ibn 'Abbas, about whom Ibn Mas'ud said: The best interpreter of the Quran is Ibn 'Abbas! at-Tabari 1/89. The isnad is reliable. Secondly, in the quoted words of Ibn 'Abbas: “established,” there is an indication that this is not his personal opinion or understanding of the Quran, but that he knew this from the Sunnah of the Prophet ﷺ, since the companions in religion did not establish anything. See Iruaul-gaalil 4/38. Thirdly, the fact that one of the companions interprets the verse and speaks about the reason for its revelation and its abrogation indicates that this is an establishment of the Sharia, and not his personal opinion, and in the science of hadith this principle is well known. See Tadrib ar-rawi 1/192, 'Ulumul-hadith 1/24. Fourthly, even if this opinion is based on the opinion of Ibn 'Umar and Ibn 'Abbas, then their opinion is more worthy of being followed. Moreover, there are no reliable reports that at least one companion would contradict them on this, and it is not allowed to contradict the companions with the opinion of anyone other than the Prophet ﷺ! All imams of Ahl-Sunnah, including four imams, believe that if among the companions there were two opinions on any issue, then no one is allowed to introduce a third opinion on this issue. Just as if the Companions have united on one issue, it is not allowed to contradict them. See ar-Risala 595, al-Ihkam 4/561, al-Usul 1/318. Once Sa'id ibn al-Musayib was asked about his opinion on some issue, and he said: The companions of the Messenger of Allah ﷺ disagreed on this issue, and my opinion should not have a place among them!” Ibn 'Abdul-Barr in Jami'ul-bayanil-'ilm 1423. It should also be noted that if the words or deed of a companion is not a consequence of his ijtihad and it is not known that any of the other companions objected to him, then this is a Sharia argument that must be accepted, and is referred to as ijma'u sukuti! Regarding this rule, all the followers (tabi'un) and imams were unanimous, except for those who deviated from the truth, such as the Ash'arites, Mu'tazilites, philosophers and some extreme Hanafis. See al-Ihkam 4/120, at-Tahsyl 2/319. Imam Abu Hanifa said: “If I say something that contradicts the Book of Allah, then leave my words and follow the Book of Allah.” He was asked: What if they contradict the saying of the Messenger of Allah ﷺ? He said: Leave my words and follow the hadith of the Messenger of Allah ﷺ. He was again asked: “And if they contradict the statements of his companions?” He replied: Leave my words and follow the statements of the companions. See al-Madkhal ila-Ssunanil-kubra 203-204, Imam al-Bayhaqi and Fathul-Majid 241. Ibn Mas'ud said: Do not blindly imitate people in your religion, but if you have to do this, then imitate the dead (i.e. companions), and not the living! al-Khatib 1/438, al-Lalyakai 131. Isnad is good.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
       
      ]
    },
    {
      "id": 70,
      "subtitle": "Clarification of some doubts related to the reimbursement of fasting for a pregnant/breastfeeding woman",
      "text": "Answer to a third opinion and analogy comparing a pregnant and breastfeeding woman with a traveler or a sick person: Firstly, Allah himself indicates the replacement of fasting for travelers and the sick, who said: **And as for those who can fast with difficulty, they have (a choice either to fast or) to feed poor person** (for every day). (al-Baqarah 2: 185). However, there is no indication either in the Quran or in the Sunnah that a woman who is breastfeeding and a pregnant woman is obliged to compensate for her fast. Secondly, with regard to the proof that in the hadith pregnant and lactating women are mentioned along with the traveler and the analogy that, based on this, they should compensate for their fast, the correctness of this analogy is doubtful. The meaning of the fact that in this hadith the pregnant and nursing women are mentioned along with the traveler is that these categories of people are exempt from fasting. But even if from this hadith we draw an analogy between a traveler on the one hand and a pregnant or breastfeeding woman on the other, we can say: After all, a traveler who shortens his prayers on the way, performing them in two rak'ats, is not obliged to restore these shortened prayers upon his return . In the same way, it can be said that the mention of a traveler in one hadith with a pregnant and lactating woman does not indicate that they are obliged to compensate for their fast. See Ahkamu-nnisa 37, Sahih fiqhu-Ssunna 2/125. The answer to the fourth opinion, that pregnant and breastfeeding women should neither fast nor feed the poor, is that this opinion could be accepted in the absence of contradictory instructions from the Companions. What they convey about feeding the poor and not fasting for pregnant and breastfeeding women is not just their opinion, but has the status of “marfu”, i.e. what is transmitted from the Prophet ﷺ himself. Further, some scholars believed that Ibn 'Abbas went against the rest of the companions by considering the verse: And those who are able to fast with difficulty should feed the poor. (al-Baqarah 2: 184), is not abrogated. The fact is that when Allah Almighty made fasting a duty for Muslims, He allowed them to either fast or feed one poor person for each missed day, saying: **And as for those who can fast with difficulty, they have (a choice either to fast or) to feed poor person** (for every day). (al-Baqarah 2: 184). Fasting was unusual for Muslims and therefore the Merciful Allah, instead of a categorical command, gave His slaves a choice between fasting and feeding the poor. Subsequently, Allah obliged everyone who was able to fast to fast, saying: **And that you fast is better for you if only you know!**, and saying: **So whoever of you sights the month he must observe fasts that month.** (al-Baqarah 2: 184, 185). The story of this is transmitted in hadiths from many companions, including Ibn 'Umar, Mu'adh and Zayd ibn Aslam. See Syfatu-ssum an-nabi 82. However, the fact is that Ibn 'Abbas was also aware of the abrogation of this verse, as we have already mentioned. He said: “As for the command to feed the poor, it was canceled by the verse: **So whoever of you sights the month he must observe fasts that month.** (al-Baqarah 2: 185). However, it was established for the old man and the old woman who are unable to observe fasting, and also for pregnant and breastfeeding women who fear (for their children), feeding one poor person for each day missed.” al-Bayhaqi 4/230, Ibn al-Jarud 381. The authenticity was confirmed by Imam an-Nawawi, Sheikh Ahmad Shakir and Sheikh al-Albani. Thus, it became clear to us that there was no disagreement between Ibn 'Abbas and other companions regarding the abrogation of the verse about feeding the poor, and we see that he knew about this as well as others, but at the same time he points out an exception to the general situation, namely, in relation to which categories of people this verse has not been abrogated. This is also supported by the hadith of Mu'adh ibn Jabal, who said: “As for fasting, when the Messenger of Allah ﷺ arrived in Medina, he fasted for three days every month and on the day of 'Ashura. Then Allah made him obligated to fast Ramadan, saying : ** O you who believe! Observing fasting is prescribed for you as it was prescribed for those before you,** (al-Baqarah 2: 183). Then Allah revealed another verse: **The month of Ramadan in which was revealed the Qur’ân, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights the month, he must observe fasts that month.** (al-Baqarah 2: 185). And Allah approved fasting for a healthy person and made it easier for the sick and the traveler. And He also established the feeding of the poor for an old person who is unable to fast. Abu Dawud 507, Ahmad 5/246. The hadith is reliable. See Iruaul-Galil 4/20. We see that Mu'adh also makes an exception for the old person from the general command to fast. And there is no disagreement among scientists about the fact that an old man who is unable to fast does not fast, but feeds one poor person every day. The same can be applied to pregnant and breastfeeding women, since Ibn 'Abbas spoke about their exclusion from the general situation. Also, Ibn 'Umar, from whom the message about the abrogation of this verse is conveyed, says that pregnant and breastfeeding women should feed the poor, and not compensate for the fast. Based on these messages from the companions, we see that the verses about feeding the poor have been canceled, but they have not been canceled in relation to an old person who finds it difficult to fast, a pregnant woman, or a woman who is breastfeeding. Messages from companions about the abolition of the verse allowing the replacement of fasting by feeding the poor are generalized, and messages about an old person, a pregnant woman and a breastfeeding woman are specific and make an exception to the general command. Imam al-Qurtubi said: “It is reliably narrated from Ibn 'Abbas that this verse (about feeding the poor) has not been abrogated in relation to the mentioned categories of people (an old person, a pregnant woman and a breastfeeding woman). And the first opinion that this verse has been abrogated is also correct However, we are talking here about the abrogation of a verse in which there is an exception. See Tafsir al-Qurtubi 2/126. None of the companions could make such an exception to the general command except by relying on the Sunnah, and this rule is well known in Sharia. See al-I'lyam 1/35, al-Muuafaqat 3/118. How could Ibn 'Umar and Ibn 'Abbas say to pregnant or breastfeeding women: “You are one of **those who can fast with difficulty,** while they, like other companions, knew about the abrogation of this verse?! Only if there is an exception in the Sunnah for pregnant or breastfeeding women as well as for an old person who finds it difficult to fast. Also, one of the doubts regarding this issue is the words of scientists who claim that there was disagreement among the Companions on this issue. In doing so, they rely on the words of Imam al-Jasas, who in his Tafsir said: “The Salaf divided into three opinions on this issue. 'Ali said: “A pregnant woman and a breastfeeding woman are obliged to compensate for the fast and they should not feed the poor.” Ibn 'Abbas said: “They should not compensate, but should feed the poor man.” Ibn 'Umar said: “They should both feed the poor man and compensate the fast.” However, the Imam did not mention the isnad (chain of narration) of these messages. There are reports with an isnad that Ibn 'Umar believed that a pregnant and breastfeeding woman should both compensate for the fast and feed the poor, but these isnads are unreliable from him. It is reliably conveyed from him that they should not compensate, but should feed one poor person for each missed day. See al-Istizkar 3/365. And there are no messages from 'Ali with isnad at all. But even if the message from 'Ali: The pregnant woman and the nursing mother are obliged to compensate for the fast and they should not feed the poor were reliable, it cannot be given preference over the message of Ibn 'Abbas, which has the position of marfu, and the words: It is established! In fact, it is not known for certain that any of the companions contradicted Ibn 'Abbas and Ibn 'Umar on this issue, as reported by Imam Ibn Qudama. See al-Mughni 3/21. Summarizing all of the above, it should be noted once again that the messages from Ibn 'Abbas and Ibn 'Umar regarding the fast of a pregnant or breastfeeding woman have the status of marfu (that which is transmitted from the Prophet ﷺ. And among the learned muhaddiths there is no disagreement that such reliable messages from the Companions, who, when interpreting the Qur'an, point out an exception from the general, is not their personal opinion.There is no doubt that these arguments cannot be equally countered by either analogy or the words of scholars based on ijtihad. This opinion is the most reasoned and fair of all existing ones.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        
      ]
    },
    {
      "id": 71,
      "subtitle": "What should a poor person be fed?",
      "text": "An old person, a pregnant woman and a breastfeeding woman are the same in regard to feeding the poor. For each day of fasting they miss, they must feed one poor person with half a sa' or one mudd of food, which roughly corresponds to 1.5 kg. Ibn 'Abbas said: When an old man cannot fast, he feeds the poor man one mudd of food for each day, another version says: Feeds half a sa' wheat. ad-Darakutni 1/249, Imam ad-Darakutni and al-Albani confirmed the authenticity. See Iruaul-gaalil 4/18. It is reported from Malik that Nafi' reported from Ibn 'Umar, who, when asked about fasting by a pregnant woman who fears for her child, said: “She does not fast and feeds the poor man with one mudd of wheat for each day.” al-Bayhaqi 4/230. The isnad is reliable. It is reported that “when Anas ibn Malik became old and could not fast, he prepared sarid, called thirty poor people and fed them all.” ad-Darakutni 2/207. Sheikh al-Albani confirmed the authenticity of the isnad. Imam al-Bukhari said: “If an old person is unable to fast, then he feeds the poor, as Anas did, who, after he grew old, fed the poor with meat and bread every day.” See Sahih al-Bukhari 2/345. Thus, any food can be fed and distributed to the poor. You can also give food to the same poor person, which is atonement for one or more days. You can feed the poor or distribute food either at the beginning of the month of Ramadan, or in the middle or at the end. See Fataawa Ibn Baz 15/203. If a person does not have the opportunity to feed the poor, then this responsibility is removed from him. Imam Ibn Qudamah said: “If an old man or an old woman cannot feed a poor man, then they should not do anything, for **Allah burdens not a person beyond his scope.** (al-Baqarah 2: 286). See al-Mughni 4/396. The same applies to pregnant and breastfeeding women, who are not able to feed the poor for missing a fast.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
      
      ]
    },
    {
      "id": 72,
      "subtitle": "It is not allowed to pay money instead of food when making up for a fast.",
      "text": "This provision is similar to Zakat al-Fitr, which must be paid in food. Sheikh Salih al-Fawzan said: The poor person should be fed half a sa’ of food that is consumed in the area, and half a sa’ is approximately one and a half kilograms. The poor person should be fed with food, and not paid money, since Allah Almighty said: **And as for those who can fast with difficulty, they have to feed poor person**  (al-Baqarah 2: 184). And the text of the Quran points specifically to food¹!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See al-Fataawa al-Fawzan 3/140.)"
        }
      ]
    },
    {
      "id": 73,
      "subtitle": "Ruling on someone breaking the Ramadan fast due to difficult work",
      "text": "Question: “I am a young man, I am seventeen years old, I perform salat, read the Quran, avoid sins, but I have one problem: during Ramadan I do not fast, because I have a difficult job, especially in the summer. Is it possible for me to fast in another time? And what should I do? Give me advice, may Allah reward you. Answer from Sheikh ibn Baz: You must make up for the missed days and repent to Allah. Repent to Allah and fast with people in the future and leave this hard work, find yourself a job that will not burden your fast. And if you have no other choice but to leave this job, then it is better to leave this job this month. Set aside (money) for Ramadan as much as seems sufficient to you from the previous months, so that during Ramadan you will not be in need. Or train yourself to do work during Ramadan that will not make it difficult for you to fast. A negligent attitude towards Ramadan due to the desire for worldly life, in particular leaving fast due to hard work, is prohibited. Fear Allah to the best of your ability. If you really really need this work, then work less so that it does not interfere with your fasting, or work well before Ramadan so that you can fast together with Muslims. We ask Allah for guidance and help for us and for you. Question: “Oh, Honorable Sheikh, some give a fatwa to workers and those who work in hard work that it is possible to break the fast during Ramadan. Are their words correct?” Answer: I don't know the basis for this. Anyone who says this has no reason to support it. It is obligatory for them that they work to the best of their ability, but if they need to work, then let them finish it after Ramadan and put aside what they accumulated before Ramadan so that it will help them maintain Ramadan. Not taking this issue seriously is a great evil and its consequences are severe. If he can combine some kind of work with his fast, then there is no problem. And if he cannot work during fasting, then it is better to leave such work and use the money that he had before for fasting.”¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataua al-Syyam 68.)"
        }
      ]
    },
    {
      "id": 73,
      "subtitle": "Fasting rules for children in the month of Ramadan",
      "text": "Sheikh ibn Uthaymeen, may Allah have mercy on him, said: “If a child has not reached the age of majority, then he is not obliged to fast in the month of Ramadan. However, if he is able to fast without difficulty, then he is ordered to observe it. For the companions of the Prophet ﷺ taught their children to fast, forcing them. And when one of them began to cry, they gave them toys through which they were distracted. (Bukhari, 1960, and Muslim, 1136) However, if it is stated that it will bring him harm, then he is restrained from it. Because if Allah Almighty forbade us to give property to children, fearing that they might misuse them and destroy them, then truly, the fear of harming human bodies comes from the first section, in order to keep them from doing this. However, this should not prevent children from fasting when they want to do so through severity. For, truly, such treatment of children is not appropriate when raising children¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fihk al-'Ibadat, p. 225, Sheikh Ibn Usaymin.)"
        }
      ]
    },
    {
      "id": 74,
      "subtitle": "Can someone who has a good reason not to fast eat openly?",
      "text": "Imam al-Mardawi wrote: Qadi said: It is blameworthy to eat openly during the bright time of Ramadan, even if there is a reason for this. It is said in al-Furu': Eating openly is prohibited in any case. When Ibn 'Aqil was asked: Should a traveler, a sick person or a woman on her period be prohibited from eating openly?, he replied: If the reason for not fasting is hidden, like a disease that has no trace or a traveler about whom nothing is known he is a traveler, then eating openly should be prohibited¹!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See al-Insaf 7/348)"
        }
      ]
    },
    {
      "id": 75,
      "subtitle": "Is it allowed to feed someone who does not fast during Ramadan for no reason?",
      "text": "Scientists forbade feeding people during the daytime who are obliged to fast and do not have a Sharia reason for leaving the fast. Allah Almighty said: **Help you one another in righteousness and piety, but do not help one another in sin and transgression.** (al-Maida 5:2). Imam ar-Ramli reported that the scholars forbade selling food to an infidel if a person knows or assumes that he will eat it during the daylight hours of Ramadan, and ar-Ramli said: The reason for this prohibition is that this act is providing assistance in committing sin, and also, according to the most correct opinion, the obligations of Sharia apply to infidels too. See Nihayatul-mukhtaj 5/274, Mausu'atul-fiqkhiya 9/212. Thus, a person should not feed during the bright time of Ramadan someone who is obliged to fast, so as not to be an accomplice in sin. The exception to this is the sick, travelers and others from whom the obligation to fast is removed. This is the general situation in this matter. However, in this case, one should be wise and take into account the benefits and harms. Like, for example, if a father, who through ignorance and ignorance does not observe the fast, tells his fasting daughter to cook food for him, and she refuses, then this can lead to even greater evil for her, for this father may begin to forbid her to wear a headscarf and perform prayer, and will prevent her from doing good, etc. Therefore, it is necessary to take into account the issue of benefit and harm, and each case should be approached individually! Question: “On the first day of Ramadan, an old woman who is already 100 years old visited me. Sometimes she is sane and sometimes not. She asked me to make coffee for her and I complied with this request. Is there a sin on me? I warned her that it is Ramadan. Please clarify this issue, may Allah bless you. Answer: “Praise be to Allah! If it seems that this woman is already old and mentally disabled, then she is not obliged to fast and there is no sin on you for preparing a cup of coffee. The fact that sometimes she is reasonable, for example, when she asks to do or bring something - then, is not an indicator of her mental health. In most cases, people who have reached the age of one hundred suffer from senile dementia and change greatly. If you think that she is mentally disabled and is not aware of it, then she is allowed to eat and drink during fasting. But , if you think she is mentally healthy and negligent, then do not treat her to coffee or anything else, so as not to help her in sin. Allah says: **Help you one another in righteousness and piety, but do not help one another in sin and transgression.** (Surah al-Maida, 5:2) If a healthy Muslim asks for food during the daytime of Ramadan, then you cannot give him food, drinks, or cigarettes and you cannot help him in this sin. But if he is mentally incompetent, for example, suffers from mental disorders, senile dementia or is very old, then there is no sin on him and he is not obliged to fast¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Fatawa an-Nur ala ad-Darb, 3/1267)"
        }
      ]
    },
    {
      "id": 76,
      "subtitle": "Is it necessary for someone who did not fast for a good reason to fast for the rest of the day if that reason no longer exists?",
      "text": "If a sick person has recovered or a traveler has returned home or a woman with postpartum bleeding or menstruation has cleared herself, and all this happened during the daytime, then are they obligated to fast for the rest of the day or not? There is disagreement among scientists on this issue. One group of scholars believed that they were obliged to fast because the reason that allowed them not to fast had ceased to operate. Other scholars believed that they were not obligated to fast for the rest of the day, since such a fast would not count for them anyway. Shaykh Ibn Uthaymeen said: If a traveler returns to his city in the middle of the day without fasting, or a woman stops menstruating during the day, then they are not obliged to fast for the rest of the day. They can eat and drink, because their abstinence does not play any role, since they are already obliged to make up for this day, and it will not be counted against them. This opinion is correct, and this is the madhhab of Imam Malik and al-Shafi'i, as well as one of the opinions of Ahmad. And from Ibn Mas'ud it is reported: Let the one who has already eaten the first part of the day eat for the rest of the rest of the day¹. Thus, there is no evidence for the obligation to fast for the rest of the day, because the mentioned categories of people have a Sharia reason for not fasting. It is known that Allah Almighty completed His religion, bringing it to perfection, and it is not known that He obliges anyone to fast for the rest of the day who did not fast for a good reason. Imam an-Nawawi said: “If a traveler returned home in the middle of the day without fasting, and found his wife cleared of menstruation or healed of an illness in the middle of the day, then he can have sexual intercourse with her, and there is no atonement for them according to our opinion²!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(al-Bayhaqi. See Fatawa Ibn Usaymin volume 19 questions No. 58, 59)"
        },
        {
          "source": "²(See al-Majmu' 6/174)"
        }
      ]
    },
    {
      "id": 77,
      "subtitle": "Some common but weak or fictitious hadiths about Ramadan and fasting",
      "text": "The Messenger of Allah ﷺ said: **Whoever tells a lie about me deliberately, let him take his place in Hell!** al-Bukhari 109. Hafiz Ibn Hajar about the words of the Prophet ﷺ: **Whoever conveyed from me what he himself considers a lie is one of the liars,** said: “Even if you tell in the name of the Prophet ﷺ what he did not say is forbidden, what can be say about committing an act based on this?! There is no difference when committing an act based on a hadith, whether it concerns legal provisions (ahkam) or merits (fadail), since all this is Shariah! (See Tabyin al-'ajab 3-4). **If the worshipers knew about the greatness of Ramadan, they would wish that the whole year would be Ramadan.** Ibn Khuzayma 1886. This hadith is fictitious. In the chain of this hadith is Jarir ibn Ayyub, who narrated false hadiths. See Lisan al-mizan 2/101. Imam al-Bukhari, Imam an-Nasai, Imam Ibn al-Jawzi, Sheikh al-Albani and others spoke about the unreliability of this hadith. See also “al-Maudu'at” 2/188. **The beginning of Ramadan is mercy, the middle is forgiveness, and the end is liberation from Fire... And the one who does good in this month will receive a reward for it as an obligatory deed, and the one who performs an obligatory deed will receive a reward as seventy obligatory deeds at another time.** Ibn Khuzayma 1887, al-Bayhaqi 3/128. s This hadith is weak due to the narrator named Ali ibn Zayd, who was called weak by Ahmad ibn Hanbal, Ibn Sa'd, Ibn Abi Haytham, Ibn Khuzaym and others. See Tahzib at-tahzib 7/322. Imam Ibn Sa'd, Ibn Ma'in, Ibn Abi Hatim and others spoke about the weakness of this hadith. See also as-Silsilya ad-da'ifa wal-maudu'a 871. **Fast and you will be healthy** by at-Tabarni in “al-Ausat” 1/69. Despite the fact that fasting really is the cause of human health, this hadith is weak due to the narrator Nahshal ibn Sa'd, who is unacceptable and often lied. And also because ad-Dahhak did not find Ibn Abbas. See as-Silsila ad-da'ifa wal-maudu'a 253. “Whoever breaks the fast of one day of Ramadan without a valid reason and not due to illness will not be able to make up for that day, even if he fasts throughout his life.” al-Bukhari 4/160. Hafiz Ibn Hajar said that this hadith has three defects: 1. Ambiguity, 2. Unknown transmitter, 3. Interrupted isnad. See Fathul-Bari 4/161. The weakness of this hadith was also pointed out by imams Ahmad, Ibn Khuzaimah, al-Munziri, al-Baghawi, al-Qurtubi, az-Zahabi, and many others. other. And also the weakness of this hadith is indicated by al-Bukhari himself, who said about this hadith: It is reported from Abu Hurayrah..., since he speaks in a vague and non-affirmative form, in contrast to the reliable hadiths, which he speaks affirmatively about. : Told me..., Told us..., etc. In the science of Hadith, vague words such as “narrated, عن” “said, قِيل” or “reported رُوي” indicate doubt or weakness in such reports. Whereas what does not raise doubts is conveyed as: said قال, heard سمع, etc., as Imam an-Nawawi explained it. See al-Majmu' 1/63. **The fasting person's sleep is worship, his silence is tasbih, his prayer is accepted, and his deeds are doubled** al-Bayhaqi 3/143. Imam al-Bayhaqi said: Ma'ruf ibn Hasan (the transmitter of this hadith) is weak, and Suleiman ibn Amr an-Naha'i (another transmitter) is even weaker than him! Hafiz al-'Iraqi said: Suleiman an-Naha'i is one of the liars! See Tahrij al-Ihya 1/310. This hadith was also called weak by Imam al-Munawi and Sheikh al-Albani. See Faydul-Qadir No. 9293, as-Silsila ad-da'ifa wal-maudu'a 4696. **The month of Ramadan is between heaven and earth, and nothing will raise it to Allah except zakat al-fitr** ad-Dailami, Ibn Shaheen. This hadith is weak due to the narrator named Muhammad ibn Ubayd, who is unknown. See al-Ilal 824. Sheikh al-Albani said: “If this hadith were authentic, it would indicate that the fast of Ramadan is not accepted without paying zakat al-Fitr! I do not know any of the scholars who would say that fasting without zakat Al-Fitr is not accepted. See as-Silsila ad-da'ifa 1/118.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        
      ]
    },
    {
      "id": 78,
      "subtitle": "About marriage in Ramadan",
      "text": "Question to the Standing Committee on Scientific Research and Fatawam (No. 8901) about nikah (marriage) in the month of Ramadan: What is the ruling for this, and is it blameworthy? Answer: “There is no condemnation for performing nikah in the month of Ramadan, since there are no arguments prohibiting (indicating) this. And good luck comes from Allah, and may Allah bless and greet our Prophet Muhammad, his family and the Sahabah.” Sheikh ibn Baz, Abdul Razzak al-'Afifi, Abdullah al-Ghudyan, Abdullah ibnu Qu'ud.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        
      ]
    },
    {
      "id": 79,
      "subtitle": "Chewing gum during fasting",
      "text": "Sheikh Useymin in “sharh mumti” ‘ala zadul-mustakni’ said: “It is condemned to chew elastic gum for a fasting person, which does not disintegrate or split, because if it has a taste, it can penetrate (into the stomach)! If there is no taste, then this is not condemned! However, at the same time, it is not allowed to chew it in front of people! Because they may think wrong about him. They don’t know whether he chews elastic or non-elastic gum, and they also don’t know whether this gum has taste or not. And some may follow this example and then chew gum with taste Chewing gum also has three disadvantages, as stated in ar-raud: 1 - causes phlegm (glands, gastric juice), 2 - mixes with saliva, 3 - causes thirst. The sheikh also said further: “It is forbidden to chew gum that is not elastic, that is not hard and becomes like sand after chewing. This type of chewing gum is prohibited for those who are fasting! Because parts of such chewing gum can get into the stomach with saliva, and this will be a reason for breaking the fast! However, if the fasting person does not swallow such saliva, then there is no prohibition for him!",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        
      ]
    },
    {
      "id": 80,
      "subtitle": "A very long day in Ramadan",
      "text": "Sheikh Ibn 'Uthaymeen was asked: “In the Scandinavian and other countries located in the north, Muslims are faced with the problem of the length of the night and day. The day in these countries can last twenty-two hours, and the night only two, and in another season of the year it may be the other way around. One of the questioners encountered this problem when he was passing through these countries during the month of Ramadan. He was also told that the night in some areas lasts for six months, and the day for the remaining six months. How to deal with such a situation? How to determine the beginning and the end of fasting in such countries, and how should Muslims there fast, as well as those Muslims who temporarily come there to work or study? The Sheikh replied: “In these countries, it is difficult not only with fasting, but also with prayers. However, if in a given state there are day and night, then everything should be done in accordance with this, no matter how long or short the day is. As for the countries located beyond the Arctic Circle, where there is no day and night in our understanding. That is, if the day there lasts six months, and the other six months it is night, then Muslims in these countries must determine the time of fasting and prayers. However, , how should they determine this time? A group of scholars believes that they should be guided by Mecca time, since Mecca is the mother of all settlements, and for this reason it is necessary to navigate in such countries by Mecca. Other scholars believe that in such countries one should take something the average and determine the length of the night at twelve hours and the length of the day at twelve hours, since this is precisely the average length of the light and dark hours of the day. Also, some scientists believe that residents of the polar regions should focus on the nearest city (area), in which the change of day and night occurs regularly. Apparently, this opinion is the most correct, since focusing on the nearest country is most reliable, since it is the closest both in climate and geographical location. Based on this, Muslims of the polar regions should adhere to the time of day and night in the country closest to them, determining the timing of fasting or prayer¹. Also, Sheikh al-Albani (rahimahu-Allah), after being asked about fasting in countries with long days, said: “Regarding those places where the sun does not set for so long that people do not see the night or vice versa, then they determine fasting according to the area closest to them. However, there is a situation that can be sorted out (and even needs to be sorted out): and this is when in the area you are asking about, the day is different and the night can also be distinguished. But there is a big difference between the length of the day and the length of the night . Suppose, for example, with varying degrees of exaggeration, the day will be 20 hours and the night 4 hours. Should they fast for 20 hours? Answer: As long as they see the sunrise and as long as they see the sunset, they should fast, even if it will be long and reach 20 hours or so. But it is no secret that for any Sharia position there are limits. Fear Allah as much as you can. And whoever is able, being in such an area, to fast for 20 hours until the day after sunrise ( and until sunset) reaches such a duration, then they must fast. I am convinced that this is an easy matter there, because the difficulty arises in those countries where it is hot, where the fasting person needs to drink. As for countries with cold climates, such a long fast, lasting so many hours, is not difficult, as it seems to me. But at the same time, we establish a rule: whoever still cannot keep a fast, then he falls under one of two things: 1. One who can be classified as a decrepit old man who cannot fast even in an area with a temperate climate, then he atones for each day of fasting by feeding the poor. 2. Or he uses for fasting the time when the long day becomes short and when it becomes easier for him to fast. Then he makes up for the days he missed. His position in such a situation is similar to the position of a patient hoping for a cure, and not despairing of a cure. As for the patient who has lost hope of recovery, the situation is regarded as that of a weak and decrepit old man, and every day of fasting he atones for feeding one poor person. As for the patient who has hope of recovery, his situation is as Allah Almighty said:  **and whoever is ill or on a journey, the same number (of days which one did not observe fasts must be made up) from other days.** (al-Baqarah 2: 185). And so, as for those people who live in places where there are very long hours of the day during Ramadan. Among them, some can hold fast, while others cannot fulfill it as expected. Anyone who cannot keep the fast in the form in which it is prescribed, then makes up for it (at another time), if he is able to do so. Otherwise, his position falls under the position of the weak, who atones for every day of fasting by feeding the poor. See Silsila huda ua nur, cas. N. 18, 39 min.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(See Fataua al-syam, 37)"
        }
      ]
    },
    {
      "id": 81,
      "subtitle": "Нестерпимый голод и сильная жажда",
      "text": "If the fasting person feels unbearable hunger or extreme thirst so that he has serious reasons to worry about his health, there is a high probability of losing any of the senses, and not just imagination, then in this case he is allowed to break the fast, and then he must will reimburse it, since maintaining health is mandatory. However, one cannot break the fast simply because of hunger or thirst, which can be tolerated, or because of fatigue or an imaginary illness. Therefore, workers in difficult conditions should not interrupt their fasts, and they must make the intention to fast at night. If workers cannot leave work, and at the same time there are serious reasons to fear for their health, or they feel an unbearable difficulty that forced them to break the fast, then they break their fast, eliminating the difficulty that has arisen, abstaining from food and drink for the remaining day until sunset sun, and then make up for the broken fast. A worker in difficult conditions, such as a person working with blast furnaces, who is physically unable to fast, should try to switch to a night shift or take a vacation during the month of Ramadan, even if it is not paid. If he cannot do the things listed, then he should better look for another job in which he could combine his religious and secular responsibilities. And whoever fears Allah, He creates a way out of the situation and gives him inheritance from where he does not even imagine. Fatua al-Lajna ad-Daima, 10/233-235. It is also worth noting that exams at universities are not a reason for breaking fast, so you should not break it, even if you have to disobey your parents in this, since you cannot obey a person in what is a sin before the Creator¹.",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": "¹(Fatua al-Lajna ad-Daima, 10/241)"
        }
      ]
    },
    {
      "id": 82,
      "subtitle": "Masturbation",
      "text": "The Supreme Council of Scholars of Saudi Arabia said: “It is prohibited to engage in masturbation, whether in the month of Ramadan or in other months. It is not permissible to engage in it, based on the words of Allah Almighty: **And those who guard their chastity** (i.e. private parts from illegal sexual acts). **Except from their wives or the** (women slaves) **whom their right hands possess - for (then) they are not blameworthy. But whosoever seeks beyond that, then it is those who are trespassers.** (Al-Maarij, 29-31). Therefore, anyone who engages in masturbation during the daytime of the month of Ramadan, while fasting, should bring repentance to Allah and make up for the fast of this day. But there is no atonement for it, for the expiatory actions came only in relation to the one who committed sexual intercourse with his wife during Ramadan, while fasting. Help is only from Allah. Peace and blessings of Allah be upon our Prophet Muhammad, and his family and companions! (See “fataua lajnatul-dayima” lil bukhus almiya wal-ifta, 10/256).",
      "url": "",
      "isAudioUrl": false,
      "sources": [
        {
          "source": ""
        }
      ]
    }
  ]
}