{
    "id": "2",
    "author": "Ислам форум",
    "category": "Акыда",
    "published": "2009",
    "lang": "Ru",
    "title": "Условия свидетельства ля иляха илля-Ллах",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FshadahRu.jpeg?alt=media&token=56647fd3-e314-4ceb-972e-3999ec1106a4&_gl=1*l2gamh*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5Nzg4NDc3My4zNi4xLjE2OTc4ODQ5MzUuMTIuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Семь условий свидетельства",
            "text": "Шейх ‘Абдур-Рахман ибн Хасан Али Шейх говорил: **В свидетельстве (ля иляха илля-Ллах) необходимо семь условий, и произнесение этого свидетельства не принесет пользы, если не будет какого-либо из этих условий! Первое: Знание, исключающее незнание; Второе: Убежденность, исключающая сомнение; Третье: Принятие, несовместимое с отвержением; Четвертое: Повиновение, исключающее непокорность (оставление); Пятое: Искренность, исключающая многобожие; Шестое: Правдивость, исключающая лицемерие; Седьмое: Любовь, несовместимая с ненавистью** (неприязнью)¹",
            "sources": [
                {
                    "source": "¹(См. “Фатхуль-Маджид” стр. 190)"
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "**Доводы из Корана и Сунны на эти семь условий**",
            "text": "1 - Знание, исключающее незнание Всевышний Аллах сказал: **Знай, что нет никого достойного поклонения, кроме Аллаха, и проси прощения за свой грех!** (47: 19). Со слов ‘Усмана ибн ‘Аффана сообщается, что посланник Аллаха (мир ему и благословение Аллаха) сказал: **Тот, кто умер, зная, что нет никого достойного поклонения, кроме Аллаха, войдет в Рай!** ¹»",
            "sources": [
                {
                    "source": "¹(Муслим 26)"
                }
            ]
        },
        
        {
            "id": 3,
            "subtitle": "**2 - Убежденность, исключающая сомнение**",
            "text": "Всевышний Аллах сказал:  **Верующими являются те, которые уверовали в Аллаха и Его посланника, а потом не испытывали сомнений** (49: 15). Всевышний Аллах также сказал: **Приведи им притчу о двух мужах. Одному из них Мы устроили два виноградника, оградили их пальмами и поместили между ними ниву. Оба сада приносили плоды, и ни-что из них не пропадало, а между ними Мы проложили реку. У него были плоды, и он сказал своему товарищу, беседуя с ним: У меня больше имущества и помощников, чем у тебя. Он вошел в свой сад, поступая несправедливо по отношению к себе, и сказал: Я не думаю, что он когда-нибудь исчезнет. Я не думаю, что настанет Час. А если же меня возвратят к моему Господу, то по возвращении я обрету там нечто еще более прекрасное. Товарищ его, беседуя с ним, сказал: Неужели ты не веришь в Того, Кто сотворил тебя из земли, потом – из капли, а потом сделал тебя мужчиной? Что же касается меня, то мой Господь – Аллах, и я никого не приобщаю в сотоварищи к моему Господу!** (18: 33-38). Со слов Абу Хурайры сообщается, что посланник Аллаха (мир ему и благословение Аллаха) сказал: **Я свидетельствую, что нет божества, достойного поклонения, кроме Аллаха, и что я – посланник Аллаха! Какой бы раб Аллаха не встретил Аллаха с этими двумя свидетельствами, не сомневаясь в их истинности, он обязательно войдет в Рай!** ¹ Также Абу Хурайра рассказывал, что посланник Аллаха (мир ему и благословение Аллаха) сказал ему:  **Ступай, и кого бы ты ни встретил за этой стеной, свидетельствующего, что нет божества, достойного поклонения, кроме Аллаха, будучи убежденным в этом своим сердцем, обрадуй его Раем!** ² Шейх Аба Бутайн говорил: Коран указывает на то, что сомнение в основах религии является неверием. Сомнение (шакк) – это колебаться между двумя вещами, как тот, кто не утверждает правдивость посланника (мир ему и благословение Аллаха), но и не обвиняет его во лжи. Или же не утверждает о Судном дне, как и не отрицает его, и тому подобное. Так же например как тот, кто не считает молитву обязательной, но и не отрицает ее обязанность, или не считает прелюбодеяние запрещенным, но в тот же момент и не говорит о его дозволенности. Все это является неверием по единогласному мнению!”  Однако необходимо делать различие между сомнением и временным наущением шайтана! Шейхуль-Ислам Ибн Таймия сказал: “Наущение (уас-уас) – это то, что проникает в сердце без желания человека. И если раб Аллаха испытывает ненависть к этим наущениям и отвергает их, то его ненависть к ним является истинным проявлением веры!⁴»",
            "sources": [
                {
                    "source": "¹(Муслим 27)"
                },
                {
                    "source": "²(Муслим 31)"
                },
                {
                    "source": "³(См. “Хукму такфир аль-му’айан” 17)"
                },
                {
                    "source": "⁴(См. “ад-Дыя аш-шарикъ” 374)"
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "**3 - Принятие, несовместимое с отвержением**",
            "text": "Всевышний Аллах сказал: « **Таким же образом, какого бы предостерегающего увещевателя Мы ни отправляли до тебя в какое-либо селение, его изнеженные роскошью жители обязательно говорили: “Воистину, мы нашли своих отцов на этом пути, и мы верно следуем по их стопам!** » (43: 23). Всевышний Аллах также сказал: « **Воистину, так Мы поступаем с грешниками. Когда им говорили: Ля иляха илля-Ллах, – они превозносились и говорили: Неужели мы откажемся от наших божеств ради одержимого поэта?** » (37: 34-36). Со слов Абу Мусы сообщается, что пророк (мир ему и благословение Аллаха) сказал: « **Руководство и знание, с которыми Аллах послал меня к людям, подобны выпавшему на землю обильному дождю. Часть этой земли была плодородной, она впитала в себя воду, и на ней выросло много всяких растений и травы. Другая ее часть была плотной, она задержала на себе воду, и Аллах обратил ее на пользу людям, которые стали употреблять эту воду для питья, поить ею скот и использовать ее для орошения. Дождь выпал также и на другую часть земли, представлявшую собой равнину, которая не задержала воду и на которой ничего не выросло. Эти части земли подобны тем людям, которые постигли религию Аллаха, получили пользу от того, с чем послал меня Аллах, сами приобрели знание и передали его другим, а также тем, кто не обратился к этому сам и не принял руководства Аллаха, с которым я был направлен к людям** ¹».\n‘Абдуллах ибн Мас’уд говорил: **Тот, кто проявил неверие хотя бы в одну букву Корана, тот проявил неверие по отношению к нему всему!**  ‘Абдур-Раззакъ 8/472. Шейхуль-Ислам Ибн Таймия подтвердил достоверность. См. “аль-Фатауа аль-кубра” 5/48.\nИмам Ибн Батта сказал: “Любой, кто отвергает то, что вменил Аллах в своей Книге или, что утвердил посланник Аллаха (мир ему и благословение Аллах) в Сунне, отрицая это и считая это ложью, тот неверный!” См. “аль-Ибана аль-кубра” 2/764. Имам Ибн Абиль-‘Изз говорил: “Нет разногласия среди ученых в том, что если кто-то проявит от-крыто непринятие известных обязанностей, передающихся многими путями или известные запретные вещи и тому подобное, то его следует призвать к покаянию, а в случае упорства казнить как вероотступника!²",
            "sources": [
                {
                    "source": "¹(аль-Бухари 79, Муслим 2282)"
                },
                {
                    "source": "²(См. “Шарх ‘акъида ат-Тахауия” 355)"
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "**4 - Повиновение, исключающее непокорность**",
            "text": "Всевышний Аллах сказал: « **А кто покорился Аллаху, будучи творящим благо, тот ухватился за надежную рукоять** » (31: 22). Всевышний Аллах также сказал: « **Но нет – клянусь твоим Господом! – они не уверуют, пока они не изберут тебя судьей во всем том, что запутано между ними, не перестанут испытывать в душе стеснение от твоего решения, и не подчинятся полностью!** » (4: 65). ‘Абдуллах ибн ‘Амр передал, что посланник Аллаха (мир ему и благословение Аллаха) сказал: « **Не уверует никто из вас до тех пор, пока страсть его не последует за тем, с чем я пришел!** ¹»\nОтносительно достоверности этого хадиса есть известное разногласия среди ученых. Однако имам Абу Ну’айм, имам ан-Науауи, шейх Ибн аль-Къайим, имам Ибн Муфлих, хафиз ас-Суюты, шейх Мухаммад ибн ‘Абдуль-Уаххаб, шейх Сыддыкъ Хасан Хан, хафиз аль-Хаками назвал его достоверным.²\n И даже если бы этот хадис был и слабый со стороны иснада, смысл его правильный, так как подтверждается Кораном! Всевышний Аллах сказал: « **Для верующего мужчины и верующей женщины нет выбора при принятии ими решения, если Аллах и Его посланник уже приняли решение! А кто ослушается Аллаха и Его посланника, тот впал в очевидное заблуждение** » (33: 36). Всевышний Аллах также сказал: « **Если они не ответят тебе, то знай, что они лишь следуют за своими страстями. А кто может быть более заблудшим, чем тот, кто следует своим страстям без верного руководства от Аллаха?** » (28: 50). Однако не любое ослушание Аллаха делает человека неверным! Из числа непокорности есть виды, делающие человека неверным, и есть виды, делающие человека грешным нечестивцем, но не неверным!",
            "sources": [
                {
                    "source": "¹(Ибн Аби ‘Асым в “ас-Сунна” 15, аль-Байхакъи в “аль-Мадхаль” 209, аль-Хатыб в “ат-Тарих” 4/469)"
                },
                {
                    "source": "²(См. “аль-Арба’ин” № 41, “аль-Адабу-шшар'ия” 3/69, “Усуль аль-иман” 1/264, “Ма'аридж аль-къабуль” 2/78)"
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "**5 - Искренность, исключающая многобожие**",
            "text": "Всевышний и Всемогущий Аллах сказал: « **Поклоняйся же Аллаху, будучи искренним перед Ним в религии!**» (39: 2). Абу Хурайра рассказывал: “Однажды я спросил: «О посланник Аллаха, кто будет самым счастливым из людей благодаря твоему заступничеству в Судный день?» В ответ посланник Аллаха (мир ему и благословение Аллаха) сказал мне: « **О Абу Хурайра, я так и думал, что никто не спросит об этом раньше тебя, поскольку я видел, как ты стремишься слушать мои слова! В День воскрешения счастливейшим из людей благодаря моему заступничеству станет тот, кто сказал: Ля иляха илля-Ллах, будучи искренним в сердце своем!** ¹»",
            "sources": [
                {
                    "source": "¹(Аль-Бухари 99)"
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "**6 - Правдивость, исключающая лицемерие**",
            "text": "Всевышний Аллах сказал: « **Среди людей есть такие, которые говорят: Мы уверовали в Аллаха и в Последний день” Однако, они неверующие! Они пытаются обмануть Аллаха и верующих, но обманывают только самих себя и не осознают этого** » (2: 8-9). Всевышний Аллах также сказал: « **Когда лицемеры приходят к тебе, они говорят: Свидетельствуем, что ты – посланник Аллаха. Аллах знает, что ты – Его посланник, и Аллах свидетельствует, что лицемеры являются лжецами!** » (63: 1). Му‘аз ибн Джабаль рассказывал, пророк (мир ему и благословение Аллаха) сказал ему: « **Кто бы ни свидетельствовал, что нет божества достойного поклонения кроме Аллаха, и что Мухаммад – посланник Аллаха, будучи правдивым в своем сердце, того обязательно Аллах сделает запретным для Огня!** ¹»\nИмам Абу Музаффар ас-Сам’ани сказал: “Куфр лицемерия – это признание языком того, чего нет в сердце²”.\nКъады Абу Бакр ибн аль-‘Араби сказал: “Лицемерие – это произнесение языком или совершение дея-ний, которые противоречат тому, что в сердце из слов и убеждений! Лицемерие бывает двух видов: в единобожии Аллаха и признании этого, или же в деяниях. Лицемерие в единобожии однозначное неверие, а лицемерие в делах – грех. И лицемерие в делах является лицемерием, которое меньше лицемерия, как бывает неверие меньше неверия!³\nХафиз Ибн Касир сказал: “Лицемерие – это проявления блага и сокрытие зла, и оно бывает разных видов: лицемерие в убеждении, и это то, которое влечет человека навечно в Ад, и лицемерие в делах, что является величайшим из грехов!⁴”\nЛицемерие в делах, это к примеру те качества, о которых говорил пророк (мир ему и благословение Аллаха) в известном хадисе: « **Истинным лицемером является тот, кому присущи четыре качества, а отличающийся одним из них будет отмечен одним из свойств лицемерия, пока не избавится от него. Этими качествами отличается тот, кто предает, когда ему доверяются; лжет, когда рассказывает о чем-либо; поступает вероломно, когда заключает договор, и преступает границы дозволенного, когда враждует с кем-либо** ⁵»",
            "sources": [
                {
                    "source": "¹(Аль-Бухари 128, Муслим 32)"
                },
                {
                    "source": "²(См. “Тафсир ас-Сам’ани” 1/46)"
                },
                {
                    "source": "³(См. «‘Аридатуль-ахуази» 10/110)"
                },
                {
                    "source": "⁴(См. “Тафсир Ибн Касир” 1/87)"
                },
                {
                    "source": "⁵(аль-Бухари 34, Муслим 58)"
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "**7 - Любовь, несовместимая с ненавистью (неприязнью)**",
            "text": "Всевышний Аллах сказал: « **Горе тем, которые не уверовали! Он сделает тщетными их деяния. Это – потому, что они возненавидели ниспосланное Аллахом, и Он сделал тщетными их деяния! **» (47: 9). Всевышний Аллах также сказал: « **О те, которые уверовали! Если кто-нибудь из вас отступит от своей религии, то Аллах приведет других людей, которых Он будет любить, и которые будут любить Его** » (5: 54). Со слов Анаса сообщается, что посланник Аллаха (мир ему и благословение Аллаха) сказал: « **В том, в ком будут три качества, ощутит сладость имана (веры)! Кто будет любить Аллаха и посланника Его больше всего остального; будет любить какого-то человека только ради Аллаха; и будет не желать возвращения к неверию после того, как Аллах спас его от него, также как не желает он быть брошенным в огонь!** ¹»\nЭтот великий хадис указывает на то, что сладость имана ощутит тот, кто полюбил Аллаха и Его посланника (мир ему и благословение Аллаха) сильнее всего иного! Кто любит и ненавидит только ради Аллаха! И кто не хотел бы вернуться в неверие после того, как Аллах оказал ему милость Исламом, так же сильно, как бы он не хотел попасть в Огонь!²",
            "sources": [
                {
                    "source": "¹(аль-Бухари 16, Муслим 43)"
                },
                {
                    "source": "²(См. “аль-Муфхим” 1/215, “аль-Икмаль” 1/278)"
                }
            ]
        },
        {
            "id": 1,
            "subtitle": "**8 - Непризнание и отречение от иной религии и всего, чему поклоняются помимо Аллаха**",
            "text": "Всевышний Аллах сказал: « **Кто не верует в тагъута, а верит в Аллаха, тот ухватился за самую надежную рукоять, которая никогда не сломается. Аллах – Слышащий, Знающий!** » (2: 256). Всевышний Аллах передал слова пророка Худа (мир ему), сказавшего: « **Воистину, я призываю Аллаха в свидетели и прошу вас засвидетельствовать, что я непричастен к тем, кому вы поклоняетесь вместо Него** » (11: 54-55). Всевышний Аллах также сказал: « **Вот Ибрахим сказал своему отцу и народу: Воистину, я не причастен к тому, чему вы поклоняетесь, кроме Того, Кто сотворил меня. Воистину, Он поведет меня прямым путем** » (43: 26-27). Также Всевышний Аллах сказал: « **Воистину, религией у Аллаха является Ислам** » (3: 19). Также Всевышний Аллах сказал: « **От того, кто ищет иную религию помимо ислама, это никогда не будет принято, и в Последней жизни он окажется среди потерпевших урон** » (3: 85). Со слов Тарикъа ибн Ашьяма сообщается, что посланник Аллаха (мир ему и благословение Аллаха) сказал: « **Кто сказал: Ля иляха илля-Ллах, а затем отверг все, чему поклоняются помимо Аллаха, того имущество и кровь запретны, а ответ его у Аллаха** ¹»\nДанное условие весьма важное и является одним из самых основных! Ведь даже если человек примет свидетельство «ля иляха илля-Ллах», будет произносить его языком и быть убежденным в его истинности сердцем, более того, поклоняться только Одному Аллаху, однако вместе с этим не будет считать ложным все, чему поклоняются люди помимо Аллаха, то его свидетельство будет недействительным!²\nЕсли при всех упомянутых условиях шахады, человек будет полагать, что есть скажем какая-либо религия, которая также является истинной, как например те, кто говорит, что христиане и иудеи не являются неверными и что они будут спрошены на основании своего Писания, то его свидетельство ля иляха илля-Ллах, является недействительным! И в завершение, хвала Аллаху – Господу миров, мир и благословение нашему пророку Мухаммаду, членам его семьи, его сподвижникам и всем, кто искренне последовал по их пути!",
            "sources": [
                {
                    "source": "¹(Муслим 23)"
                },
                {
                    "source": "²(См. “Тайсируль-Азизиль-Хамид” 286)"
                }
            ]
        }
    ]
}