{
    "id": "3",
    "author": "Sufyan al-Sauri",
    "category": "Adab",
    "overview": "The great instruction of Imam Sufyan al-Thawri, which he gave to ‘Ali ibn al-Hasan al-Sulami. Full name Abu Abdullah Sufyan ibn Said ibn Masruk (97 AH - 161 AH/715 CE - 778 CE) great scholar muhiddis from the generation of followers of the Tabeins",
    "lang": "En",
    "title": "The Great Guidance of Imam Sufyan al-Sauri",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FsufyansuryEn.jpeg?alt=media&token=688c0045-f157-418c-b417-570dbef0fe70&_gl=1*vnqru1*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5Nzg4NDc3My4zNi4xLjE2OTc4ODQ5NTUuNjAuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Adhere to truthfulness in all matters",
            "text": "Adhere to truthfulness in all matters. Beware of lying, treachery, and associating with those who possess these qualities, for all of these are sins. Beware, O my brother, of showiness in words and actions, for it is, in itself, a form of polytheism. Guard against self-deception, for an action mixed with it does not ascend to Allah. Do not accept your religion from anyone except those who fear for their religion. For he who does not fear for his religion is like a sick person who cannot cure himself or wish good for himself, for how can someone who does not fear for himself be concerned about your religion, O my brother? Truly, your religion is your flesh and blood. Mourn for your soul and have mercy on it, for if you do not show it mercy, you will not be shown mercy. Associate only with those who instill indifference to this world and lead you toward the Hereafter. Beware of sitting with lovers of this world, for they indulge in discussions of this world, and they will corrupt your heart and your religion.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Remember death often",
            "text": "Remember death often. Frequently seek forgiveness from Allah for your past sins. Ask Allah for success in what remains of your life.  After that, O my brother, hold fast to piety and good character. Do not contradict the Muslim community (Al-Jama'ah), for goodness lies within it. But do not be with those who are preoccupied with this world and immersed in it, for they are like those who build by destroying another. Give guidance to every Muslim when they ask you about matters of religion. Do not withhold sincere advice when someone seeks counsel from you regarding what pleases Allah. Beware of betraying a fellow Muslim, for he who betrays a Muslim is like one who betrays Allah and His Messenger. If you love your brother for the sake of Allah, do not spare yourself or your wealth for him. Avoid disputes, arguments, and debates, for all of these will make you unjust, treacherous, and sinful. Practice patience in all situations, for indeed, patience leads to righteousness, and righteousness leads to Paradise. Beware of anger and malice, for they lead to sinfulness, and sinfulness leads to the Fire.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Do not argue with a scholar",
            "text": "Do not argue with a scholar, for this will make them resent you. Approaching scholars is a grace, and distancing yourself from them is the wrath of the Most Merciful, for scholars are the heirs of the prophets. Show detachment from this world, and Allah will reveal to you the flaws of this world. Be devout, and Allah will ease your account. Leave aside what causes you doubt and perform what you are certain about, and you will be in a state of well-being. Push away doubt with certainty, and your religion will be preserved. Call to what is approved and forbid what is disapproved, and you will become a beloved of Allah. Despise the wicked, and you will drive away the devils. Express less joy and elation over what you gain from the worldly life, and your greatness in the sight of Allah will increase.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 4,
            "subtitle": "Act for your Hereafter",
            "text": "Act for your Hereafter, and Allah will relieve you of worldly concerns. Correct your inner (hidden) deeds, and Allah will rectify your outward deeds. Weep for your sins, and you will be among the highest ranks. Do not be heedless, for there are many conditions and obligations you have before Allah that you must fulfill. Do not be careless about them, for you are not neglected, and you will be held accountable for all of this on the Day of Resurrection. If you desire to engage in worldly matters, beware of haste. If you see that an action will benefit you in the Hereafter, proceed with it; otherwise, refrain until you observe how someone else performs it and how they fare. Seek prosperity from Allah. Once you decide to embark on a deed from the deeds of the Hereafter, hasten towards it before Satan blocks your path to it.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Do not be gluttonous",
            "text": "Do not be gluttonous. Do not act in accordance with how much you eat, for that is blameworthy. Do not eat without intention or necessity. Do not stuff your stomach, lest you fall to the ground like one who does not remember Allah. Mourn often and reflect, for the greatest of righteous deeds that a believer finds in their record are sadness and contemplation. Beware of desiring what people have, for greed destroys religion. Beware of worldly thirst, for it hardens the heart. Beware of chasing the worldly, for this will be a source of disgrace for people on the Day of Judgment. Be pure in both heart and body, far from sins and disobedience. Let your hands be clean from injustice, your heart free from lies, deceit, and fraud, and your stomach free from the forbidden, for a body nurtured on the forbidden will not enter Paradise.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Reduce your sins",
            "text": "Reduce your sins, accept apologies, and forgive mistakes. Be the one from whom people are shielded from harm and upon whose goodness they rely. Do not hold hatred towards anyone who submits to Allah. Be compassionate both towards the general masses and individuals. Do not sever family ties. Maintain relationships with those who have severed them with you. Uphold family bonds, even when they have been broken. Forgive those who have been unjust to you, and you will be among the prophets and witnesses. Beware of parting with the dirham, for it is most beneficial for your intellect. Do not deny yourself the sweet, for it adds to your self-restraint. Consume meat, and you will not regret it. Do not abstain from meat for forty days, or else your disposition will be affected. Do not deprive yourself of the good, for it increases your wisdom. Consume lentils, as they encourage the shedding of tears and soften the heart. Wear coarse clothing, and you will taste the sweetness of faith. Eat less, and you will be able to observe the night prayer. Fasting, indeed, fasting closes the doors of wrongdoing and opens the doors of worship. Speak less, and your heart will soften. Be silent more often, and you will attain piety. Do not chase after this world's glimmer. Do not envy, and you will quickly understand. Do not insult people, and you will be saved from the evil of their tongues. Be gentle, and you will become beloved among people.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "Turn your gaze away from people, do not go out unnecessarily",
            "text": "Turn your gaze away from people, do not go out unnecessarily, speak with wisdom, and do not reach out for what does not belong to you. Worry and fear for the remainder of your life, for you do not know what might happen to your religion in the time allocated to you. Be cautious about guaranteeing safety for yourself in this regard, for how can you ensure that when Allah has already declared you unjust and ignorant? Indeed, your forefather Adam (peace be upon him) could not remain in Paradise; he was expelled from it due to his disobedience to Allah. Reduce your sins, accept apologies, and forgive mistakes. Be the one from whom people are protected, and on whose good people rely. Do not hold hatred towards anyone who submits to Allah. Be merciful to the general masses as well as to specific individuals.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "Do not sever family ties",
            "text": "Do not sever family ties. Maintain relations with those who have severed them with you. Uphold family bonds even when they have been severed. Forgive those who have been unjust to you, and you will be with the prophets and witnesses. Beware of parting with the dirham, for it is most beneficial for your intellect. Do not deny yourself the sweet, for it adds to your self-restraint. Eat meat, and you will not regret it. Do not abstain from meat for forty days, or else your disposition will be affected. Do not deprive yourself of the good, for it increases your wisdom. Consume lentils, as they encourage the shedding of tears and soften the heart. Wear coarse clothing, and you will taste the sweetness of faith. Eat less, and you will be able to observe the night prayer.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 9,
            "subtitle": "Fasting, indeed, fasting closes the doors of wrongdoing",
            "text": "Fasting, indeed, fasting closes the doors of wrongdoing and opens the doors of worship. Speak less, and your heart will soften. Be silent more often, and you will attain piety. Do not chase after this world's glimmer. Do not envy, and you will quickly understand. Do not insult people, and you will be saved from the evil of their tongues. Be gentle, and you will become beloved among people. Be content with what Allah has provided you from sustenance, and you will be rich. Rely on Allah, and you will become strong. Do not compete with the adherents of this world in acquiring worldly goods, and Allah and the inhabitants of the earth will love you. Be modest, and you will complement acts of piety. Be forgiving, and you will obtain everything you need; be compassionate, and everything around you will become more compassionate.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 10,
            "subtitle": "O my brother, do not let your days, nights, and hours pass aimlessly",
            "text": "O my brother, do not let your days, nights, and hours pass aimlessly. Prepare for yourself in the Day of Thirst. O my brother, you will quench your thirst on that day only through the satisfaction of the Most Merciful, and you can only attain His satisfaction by obeying Him. Engage in more extra worship, and it will bring you closer to Allah. Be generous, and your mistakes will be concealed, and Allah will ease your judgment and the horrors of the Day of Judgment. Do more good deeds, and Allah will relieve your loneliness in the grave. Leave all that is forbidden, and you will feel the sweetness of faith. Sit with the pious and God-fearing people, and Allah will rectify your religion. Seek advice on religious matters from those who fear Allah.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 11,
            "subtitle": "Hasten to do good, and Allah will shield you from sin",
            "text": "Remember Allah more often, and Allah will make you indifferent to this world. Contemplate death, and Allah will ease your worldly burdens. Long for Paradise and strive for it, and Allah will lead you to submission to Him. Fear the Fire, and Allah will make difficult matters easy for you. Love the inhabitants of Paradise, and you will be with them on the Day of Resurrection. Despise the sinners, and Allah will love you. Believers are witnesses of Allah on earth. Do not insult any of the believers. Do not disdain anything that is praiseworthy. Do not compete with the adherents of this world in acquiring worldly goods. Look, my brother, the most important thing for you should be the fear of Allah, both inwardly and outwardly. Fear Allah with the fear of one who is convinced that they are mortal, will be resurrected, gathered with others, brought before the Almighty (Al-Jabbar), counted, and will eventually find themselves in one of two abodes - either the Eternal Paradise, full of bliss, or the Hellfire, with its numerous and endless forms of punishment, without death. Hope with the hope of one who knows they will either be forgiven or punished. Help comes only from Allah; there is no Lord but Him.",
            "sources": [
                {
                    "source": "(Hilyatul-Awliya 7/85-86)"
                }
            ]
        }
    ]
}