{
    "id": "4",
    "author": "имам Суфьяна ас-Саури",
    "title": "Великое наставление имама Суфьяна ас-Саури, которое он сделал ‘Али ибн аль-Хасану аль-Сулями",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2Fsufyan_saury.jpeg?alt=media&token=e11dd471-6063-424a-a28a-afab86d4c7c5&_gl=1*fe9uqt*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5NzUzODczMS4xOS4xLjE2OTc5Mzk0MjYuNC4wLjA.",
    "chapters": [
        
        {
            "id": 1,
            "subtitle": "Придерживайся правдивости во всех положениях",
            "text": "Придерживайся правдивости во всех положениях. Остерегайся лжи, предательства и нахождения с обладателями этих качеств, ведь всё это является грехом. Остерегайся, о, мой брат, показухи в словах и делах, ведь она сама по себе является многобожием. Остерегайся самообольщения, ведь деяние, к которому оно примешано, не возвышается (к Аллаху). Не принимай свою религию ни от кого, кроме того, кто боится за свою религию. Ведь тот, кто не боится за свою религию подобен больному человеку, который не может вылечить себя и желать добра самому себе, так как он сумеет вылечить других людей и желать им добра?! Как может беспокоится о твоей религии тот, кто не боится за себя? О, мой брат, поистине, твоя религия – это твоя плоть и кровь. Оплакивай свою душу и помилуй её, ведь если ты не проявишь к ней милосердия, то не будешь помилован. Находись лишь с тем, кто прививает тебе равнодушие к миру этому и устремляет тебя к Последней Жизни. И остерегайся сидеть с любителями мира этого, которые углубляются в обсуждения этого мира, потому что они испортят твоё сердце и твою религию.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 2,
            "subtitle": "Чаще вспоминай о смерти",
            "text": "Чаще вспоминай о смерти. Чаще проси у Аллаха прощения за свои прошлые грехи. Проси у Аллаха благополучия в том, что осталось из твоей жизни. После этого, о, мой брат, придерживайся благочестия и благого нрава. Не иди в противоречие общине мусульман (аль-Джама’а), ведь благо заключено в ней, но не будь вместе с тем, кто занят лишь этим миром и погружён в него. Он подобен тому, кто строит дом, разрушая другой. Давай наставление каждому мусульманину, если он спрашивает тебя о положениях религии. Не скрывай чего-либо из искреннего совета, когда кто-то советуется с тобой в отношении того, в чём заключено довольство Аллаха. И остерегайся предавать мусульманина, ведь тот, кто предал мусульманина подобен тому, кто предал Аллаха и Его посланника ﷺ. Если ты возлюбил своего брата ради Аллаха, то не щади для него ни себя, ни своего имущества. Остерегайся споров, пререканий и диспутов, ведь это всё тебя сделает несправедливым, предателем и грешником. Придерживайся терпения во всех положениях, ибо, поистине, терпение ведёт к благочестию, а благочестие ведёт в Рай. Остерегайся гнева и злобы, ведь они приводят к греховности, а греховность вводит в Огонь.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 3,
            "subtitle": "Не спорь с учёным",
            "text": "Не спорь с учёным, ибо тем самым он тебя возненавидит. Обращение к учёным является милостью, а отдаление от учёных является гневом Милостивого, ведь учёные являются наследниками пророков. Проявляй отрешённость к миру этому и Аллах обнажит тебе недостатки этого мира. Будь набожным и Аллах облегчит тебе расчёт. Оставь многое из того, что вызывает у тебя сомнение и совершай то, в чём ты убеждён и тогда ты будешь в благополучии. Отталкивай сомнение тем, в чём ты убеждён и сохранится твоя религия. Призывай к одобряемому и запрещай порицаемое, и тогда ты станешь любимцем Аллаха. Возненавидь нечестивцев и отведёшь от себя шайтанов. Поменьше проявляй радости и ликования по причине того, что тебе достанется от мирской жизни, и тогда увеличится твоё величие пред Аллахом.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        { "id": 4,
            "subtitle": "Действуй для своей Последней Жизни и Аллах избавит тебя от мирских забот.",
            "text": "Действуй для своей Последней Жизни и Аллах избавит тебя от мирских забот. Исправь свои внутренние (скрытые) дела и тогда Аллах исправит твои внешние дела. Плачь о своих грехах, и ты будешь из Высшего Сонма. Не будь беспечен, ведь к тебе беспечно не относятся. У тебя много условий и обязанностей перед Аллахом, которые тебе необходимо исполнить, так не будь к ним беспечен, ведь тебя не оставляют без внимания и ты будешь отсчитан за всё это в День Воскресения. Если ты желаешь выполнить что-то из мирских дел, то остерегайся спешки. Заметив, что это деяние приносит для тебя пользу в Последней Жизни, совершай его, в противном случае, откажись пока не увидишь того, кто его совершит и как он спасется. Проси у Аллаха благополучия. Решившись на какое-то деяние из деяний Последней Жизни, устремись к нему и спеши до того, как шайтан преградит тебе путь к этому деянию.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 5,
            "subtitle": "Не будь прожорливым.",
            "text": "Не будь прожорливым. Не совершай деяния согласно тому, сколько ты ешь, ведь это является порицаемым. Не ешь без намерения или без нужды. Не заполняй свой живот, дабы не упасть на землю подобно падали, не поминая Аллаха. Чаще грусти и размышляй, ведь самое большее из благих дел, что найдёт верующий в Книге (своих деяний) – это печаль и размышление. Остерегайся желать того, что есть у людей, ведь алчность губит религию. Остерегайся жажды (к мирскому), ведь она делает сердце чёрствым. Остерегайся бежать за мирским, ведь именно это станет позором для людей в Судный День. Будь чистым как сердцем, так и телом, далеким от грехов и ослушания. Пусть твои руки будут чисты от несправедливости, а сердце будет свободно ото лжи, коварства и обмана, а чрево будет свободно от запретного, ведь в Рай не зайдет тело, взращенное на запретном. Отведи свой взор от людей, не выходи без нужды, не говори без мудрости, и не протягивай руку к тому, что тебе не принадлежит. Волнуйся и бойся за оставшийся срок своей жизни, ибо ты не знаешь, что может произойти с твоей религией за отведённый тебе срок. И остерегайся гарантировать себе что-то из безопасности от этого. И как ты можешь себе гарантировать подобное, когда Аллах назвал тебя несправедливым и невежественным?! Ведь твой праотец Адам (мир ему) не смог остаться в Раю, и он был изгнан из Рая по причине ослушания Аллаха.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 6,
            "subtitle": "Уменьши свои грехи",
            "text": "Уменьши свои грехи, принимай извинения и прощай ошибки. Будь тем, от чьего зла избавлены люди и на чьё благо они надеются. Не проявляй ненависть к кому-либо, кто подчиняется Аллаху. Будь милосердным как для общей массы людей, так и для особых из их числа. Не порывай родственные узы. Поддерживай отношения с теми, кто их оборвал их с тобой. Поддерживай родственные узы, даже когда их оборвали. Прощай тех, кто был к тебе несправедлив, и тогда ты будешь вместе с пророками и шахидами. Остерегайся разлучаться с дирхемом, ведь это наиболее полноценнее для твоего разума. Не отказывай себе в сладком, ведь это прибавляет сдержанности. Питайся мясом, и не пожалеешь. Не оставляй употребление мяса в течение сорока дней, а иначе испортится твой нрав. Не отказывайся от благого, ведь оно прибавляет благоразумия. Питайся чечевицей, оно способствует появлению слёз и смягчению сердца. Одевай грубую одежду, и ты почувствуешь сладость веры. Ешь поменьше и ты сможешь выстаивать ночную молитву. Постись, поистине؟ пост закроет двери нечестия и откроет двери поклонения. Поменьше разговаривай и смягчится твое сердце. Чаще молчи и обретёшь набожность. Не гоняйся за этим светом. Не завидуй и будешь быстро понимать. Не оскорбляй людей и спасешься от зла их языков. Будь мягким и станешь любимым среди людей.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 7,
            "subtitle": "Будь доволен тем, что Аллах выделил тебе из пропитания и будешь богат",
            "text": "Будь доволен тем, что Аллах выделил тебе из пропитания и будешь богат. Уповай на Аллаха и будешь сильным. Не соперничай с приверженцами этого мира в обретении мирского и полюбит тебя Аллах и обитатели земли. Будь скромным и дополнишь деяния благочестия. Будь прощающим и обретёшь всё в чём нуждался, будь милосердным и всё вокруг станет к тебе более милостивым. О, мой брат, не давай своим дням, ночам и часам проходить бесполезно. Подготовь от себя себе же в День Жажды. О, мой брат, ты сможешь утолить жажду в тот день лишь посредством довольства Милостивого, а сможешь ты достичь Его довольства, лишь подчиняясь Ему. Совершай больше дополнительного поклонения и это приблизит тебя к Аллаху. Будь щедр и скроются твою ошибки, Аллах облегчит тебе расчёт и ужасы Судного Дня. Больше совершай благого и Аллах избавит тебя от одиночества в могиле. Оставь всё запретное и ты ощутишь сладость веры. Сиди с набожными и богобоязненными людьми и Аллах исправит твою религию. Советуйся в религиозных вопросах с теми, кто боится Аллаха.",
            "sources": [
                {
                    "source": ""
                }
            ]
        },
        {
            "id": 8,
            "subtitle": "Спеши творить добро и Аллах отгородит тебя от греха.",
            "text": "Спеши творить добро и Аллах отгородит тебя от греха. Чаще поминай Аллаха, и Аллах сделает тебя равнодушным к этому свету. Вспоминай о смерти и Аллах облегчит тебе мирские тяготы. Тоскуй и стремись к Раю и Аллах приведет тебя к подчинению Ему. Бойся Огня и Аллах облегчит тебе трудное. Возлюби обитателей Рая и ты будешь с ними в День Воскресения. Возненавидь грешников и полюбит тебя Аллах. Верующие являются свидетелями Аллаха на земле. Не оскорбляй никого из верующих. Не презирай ничего из одобряемого. Не соперничай с приверженцами этого света в обретении мирских благ. Смотри о мой брат, что бы самым важным для тебя был страх перед Аллахом как скрыто, так и внешне. Бойся Аллаха, страхом того, кто убеждён, что смертен и будет воскрешён, затем будет собран с другими, затем последует предстояние перед Могучим (Аль-Джаббар), затем будет отсчитан, после чего местом возвращения станет одно из двух обителей, либо Вечный Рай, полный блаженства, либо Ад, в котором многочисленные, бесконечные виды наказания, без смерти. Надейся надеждой того кто знает, что он либо будет прощён, либо будет наказан. Помощь лишь от Аллаха, нет иного Господа, кроме Него”.",
            "sources": [
                {
                    "source": "(Хильятуль-Аулия 7/85-86)"
                }
            ]
        }
    ]
}