{
    "id": "5",
    "author": "Шайх Абдурраҳмон Ибни Носири Саъдӣ",
    "category": "тафсир",
    "published": "2021",
    "lang": "Tj",
    "title": "Тафсири Ростин (сураи Фотиҳа)",
    "image": "https://firebasestorage.googleapis.com/v0/b/azkar-de3a2.appspot.com/o/images%2FtafseerSaadi.jpeg?alt=media&token=c7377214-8c4b-41c6-9f83-7abd7cf616e6&_gl=1*1x2li72*_ga*NDk2NTEzNzkuMTY5NDkzOTY1Mg..*_ga_CW55HF8NVT*MTY5ODY4MjMyOS42NC4xLjE2OTg2ODQwODkuMTYuMC4w",
    "chapters": [
        {
            "id": 1,
            "subtitle": "Муқаддимаи Шайх Муҳаммад Ибни Солеҳ",
            "text": "Тафсири Шайх Абдурраҳмон бин Носир ас-Сиъдӣ раҳимаҳуллоҳ яке аз беҳтарин тафсирҳост, чун хусусиятҳои зиёде дорад, ки иборатанд аз осон будани ибораҳо ва возеҳу равшан будани онҳо, ба гунае, ки фарди олим, фарди донишманд ва низ фарди камдониш онҳоро мефаҳмад. Дар ин тафсир аз овардани баҳси тулонӣ, ки фоидае ҷуз зоеъ кардани вақт ва парешонии фикри хонанда надорад, иҷтиноб шудааст. Масъалаҳои ихтилофӣ дар ин китоб зикр нашудаанд, магар он масъалаҳои ихтилофие, ки зикрашон ҳатмист. Инҳо вижагиҳо ва хусусиятҳои муҳим ва муфиде мебошанд, ки хонандаро бар як чиз мутамаркиз мекунанд. Дар тафсири оятҳое, ки дар онҳо сифатҳои Аллоҳ таъоло зикр шудаанд, роҳи гузаштагони накӯ дар пеш гирифта шудааст ва бидуни таҳриф (яъне маъноро бо дигар намуд гуфтан) ва бидуни мухолифат бо каломи Аллоҳ таъоло ин оятҳо тафсир шудаанд, ки дар ақида ин бисёр амри муҳим ба ҳисоб меравад. Истинботи (натиҷагирии) фоидаҳо, ҳукмҳо ва ҳикматҳо, ки дар баъзе аз оятҳо ошкор аст, ба монанди ояти вузӯ дар сураи Моида, ки аз он панҷоҳ ҳукм истинбот кардааст ва ҳамин тавр дар достони Довуд ва Сулаймон дар сураи Сод фоидаҳои зиёде низ истинбот намудааст. Зимни ин ки Қуръонро тафсир намудааст, инчунин асари тарбиятӣ бад-он додааст, ки хонандаро тарбият менамояд. Ҳамон тавр, ки дар тафсири ояти 199-и сураи Аъроф\n\n  خُذِ ٱلۡعَفۡوَ وَأۡمُرۡ بِٱلۡعُرۡفِ وَأَعۡرِضۡ عَنِ ٱلۡجَٰهِلِينَ \n\n  **[Эй паёмбар] Гузашт пеша кун ва ба некӣ фармон бидеҳ ва аз ҷоҳилон рӯ бигардон**  мушаххас мегардад. Бинобар ин ба ҳар касе, ки мехоҳад китобҳои тафсирро пеши худ дошта бошад, тавсия мекунам, ки китобхонаи ӯ аз ин тафсири арзишманд холӣ набошад. Аз Худованд мехоҳам, ки муаллиф ва хонандаро аз подоши он баҳраманд гардонад. Бегумон Худованд бузургвор ва бахшанда аст.\nМуҳаммад Ибни Солиҳ\n15 Рамазони 1416 ҳиҷри қамарӣ\nМутобиқ бо 5 феврали соли 1996",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        },
        {
            "id": 2,
            "subtitle": "Муқаддимаи муаллиф",
            "text": "Шукр ва сипос Худовандеро сазад, ки Қуръонро бар бандааш нозил кард, Қуръоне, ки ҷудокунандаи ҳалол аз ҳаром, ҷудокунандаи хушбахт аз шақиву бадбахт ва ҷудокунандаи ҳақ аз ботил аст. Ситоиш Парвардигореро сазост, ки дар зери раҳмат ва лутфи хеш Қуръонро бар ҳамаи мардум ва барои парҳезгорон ба таври хос мояи ҳидоят қарор дода ва онро раҳнамуде гардонидааст, ки мардумро аз гумроҳии куфр, аз гуноҳон ва аз ҷаҳолат ба сӯи имон, ба сӯи тақво ва ба сӯи дониш берун меоварад.  Худованд Қуръонро шифобахши дилҳо аз бемориҳое мисли шубҳаҳо ва шаҳавот гардонидааст ва ба василаи Қуръон поя ва асоси илму яқин ҳосил мегардад. Ҳамчунин Қуръон шифобахши бемориҳо ва дардҳои ҷисмонист ва Худованд хабар додааст, ки ба ҳеҷ ваҷҳ дар Қуръон шак ва тардиде нест, чун Қуръонро дар ахбор, дар амрҳо ва дар манъкардаҳои худ хуҷаста ва бобаракат нозил кардааст ва дар Қуръон хайр, баракат, дониши фаровон ва розҳои шигифтангез ва матолиби волое нуҳуфтаанд. Пас сарчашмаи ҳар баракате дар дунё ва охират амал кардан ба Қуръон ва пайравӣ кардан аз он аст ва Парвардигор хабар додааст, ки Қуръон тасдиқкунандаи китобҳои гузашта мебошад.  Ҳар он чи ки Қуръон ба он гувоҳӣ медиҳад, ҳақ аст ва ҳар он чиро, ки Қуръон рад мекунад, пас қабул нашуданӣ аст, зеро Қуръон дарбаргирандаи китобҳои гузашта ва такмилкунанди онҳост. Аллоҳи муттаъол дар мавриди Қуръон фармудааст:\n\n  يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ  \n\n  **Аллоҳ ба василаи он китоб касонеро, ки ҷуёи хушнудии Ӯ ҳастанд ба роҳҳои амн ва амон ҳидоят менамояд**¹\nПас Қуръон ба сарои биҳишт роҳнамоӣ мекунад, роҳи расидан ба биҳиштро баён медорад, мардумро барои дар пеш гирифтани роҳҳои биҳишт ташвиқ менамояд ва аз роҳҳое, ки инсонро ба сарои ранҷҳо мерасонад, парда бардошта ва аз онҳо барҳазар медорад. Аллоҳ таъоло дар мавриди Қуръон мефармояд:\n\n  الٓرۚ كِتَٰبٌ أُحۡكِمَتۡ ءَايَٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِيمٍ خَبِيرٍ  \n\n  **Алиф, лом, ро. Ин [Қуръон] китобест, ки оёти он  устувор ва маҳкам гардида ва сипас аз ҷониби ҳакими огоҳ ба равшанӣ баён шудааст**²\nОятҳои Қуръонро Худованд дар ниҳояти равшанӣ ва устуворӣ қарор дода ва бо равшан кардани ҳаққу ботил ва гумроҳиву ҳидоят, бо тарзҳои гуногун онро баён ва тавзеҳ додааст. Зеро ин китоб аз ҷониби Аллоҳи олиму огоҳ нозил гардидааст ва ҳарчи Қуръон мегӯяд рост, ҳақ ва яқин аст. Қуръон ҷуз ба адлу инсоф ва некукорӣ фармон намедиҳад ва ҷуз аз зиёнҳои динӣ ва дунявӣ наҳй намекунад.  Аллоҳ ба Қуръон савганд ёд карда ва онро “Маҷид” номидааст. Маҷид, яъне густарда будан ва бузург будани васфҳо, зеро мафҳумҳои Қуръон густардаву васеъ ва қавӣ мебошанд. Ҳамчунин Худованд Қуръонро соҳиби панду насиҳат номидааст, яъне ба он маъно, ки бо Қуръон илмҳои илоҳӣ, ахлоқи зебо ва корҳои шоиста ёдоварӣ мешаванд ва ҳар касе, ки аз Худо битарсад, аз он дарси ибрат мегирад. Аллоҳи муттаъол мефармояд:\n\n  إِنَّآ أَنزَلۡنَٰهُ قُرۡءَٰنًا عَرَبِيّٗا لَّعَلَّكُمۡ تَعۡقِلُونَ  \n\n  **Ба ростӣ, ки мо онро Қуръони арабӣ нозил фармудаем, то шумо андеша кунед**³\nПас Парвардигор Қуръонро ба забони арабӣ нозил фармуда, то мо онро бифаҳмем, дарк кунем ва ба мо амр намудааст,то дар он бияндешему фикр кунем ва аз Қуръон илмҳову донишҳояшро бароварда созем, зеро андешидан дар Қуръон калиди ҳар хайр ва хубист ва ба василаи он ҳамаи илмҳо ва асрор ба даст меоянд. Пас Худовандро ситоиш мекунем ва Ӯро сипос мегузорем, Худованде, ки китоби худро мояи ҳидоят, шифо, раҳмат ва нуру баракат ва мужда барои мусалмонҳо гардонидааст. Вақте матолиби мазкурро бидонем, хоҳем донист, ки ҳар фард уҳдадор ва вазифадор аст барои шинохти мафоҳими Қуръон ва ба иршоди он ниёз дорад. Банда бояд тамоми талоши худро барои омӯхтан ва фаҳмидани маъонии Қуръон бо наздиктарин василае, ки одамиро ба он мерасонад, дареғ надорад. Имомони дин тафсирҳои зиёде бар китоби Аллоҳ таъоло нигоштаанд ва баъзе тафсирҳо тулонӣ ҳастанд, ки дар бештари ҳуҷҷатҳои худ аз мавзӯъ хориҷ шудаанд ва баъзеи дигар бошанд, баръакс дар пардохтан ба мавзӯъи мавриди назар, кӯтоҳӣ варзидаанд ва танҳо ба ҳал ва шарҳи баъзе калимаҳо иктифо намудаанд. Ончи ки дар ин бора шоистааст, ин аст, ки **маънӣ (бояд) ҳадаф бошад ва калима василае барои расидан ба ҳадаф.**\nПас барои маънои оятро фаҳмидан ба равишҳои гуногун амал мекунем, масалан бояд дид, ки оят дар кадом масъала сухан мекунад ва баъдан ҳамон калимаро ба ҳамон маъно тарҷума мекунем. Ҳамин тавр аз равиши ҷумла низ маъноҳои оятро мешавад шарҳ дод ва ҳамчунин маънои калимаҳоро низ аз назар мегузаронем, ки оё тарҷумаи ҳамон калима ба ояти мавриди назар мутобиқат мекунад ё на. Дар навбати худ барои фаҳмо шудани оятҳо, ҳамчунин масъалаҳоеро низ аз дигар манбаъҳои шаръӣ нигоҳ мекунем, ки ҳамин масъала дар дигар манбаъҳо чигуна шарҳ дода шудааст, ки дар натиҷа маънои оятро бардошт мекунем, зеро чигунае ки зикр шуд, мақсад аз фаҳмидани калима василаест барои фаҳмидани маъно. Бояд донист, ки ин Қуръон барои ҳидояти ҳамаи мардум, чи олим ва чи ҷоҳил, чи шаҳрӣ ва чи рустоӣ (қишлоқӣ) фиристода ва оварда шудааст. Тааммул дар сиёқи (услуби) оятҳо, донистани ҳолатҳои Паёмбар саллаллоҳу алайҳи ва саллам ва сираи ӯ ва дӯстону душманонаш дар замони нузули оятҳо, бузургтарин омиле ҳастанд, ки дар ростои шинохт ва фаҳми манзур ва муроди оятҳо метавон аз онҳо кумак гирифт. Ба хусус агар шинохт ва донистани анвоъи улуми арабиро ба ин изофа кунем ва ҳар кас муваффақ ба чунин дастоварде шавад, чизе бар вай боқӣ намемонад, ҷуз ин ки бар фаҳм ва тадаббури он рӯй оварад ва дар алфоз, дар маъонӣ, дар лавозимот ва мазмунҳои он ва ончи ки оятҳо ба тариқи мантуқ (гуфташуда) ва мафҳум бар он далолат менамоянд, фаровон андеша кунад. Пас ҳар гоҳ дар ин маврид касе талош кунад, бояд донист, ки Парвардигор аз бандааш бузургвортар ва бахшандатар аст ва қатъан аз илмҳо ва донишҳои худ чизҳоеро ба рӯи ӯ хоҳад боз кард, ки ӯ худаш наметавонад ба даст биоварад. Аз онҷо, ки Аллоҳ бар ман ва бародаронам миннат гузорад, ки ба китоби Ӯ таъоло, бо қадри тавон ва ҳолати худ, машғул шавем, дӯст доштам ончи дар тавон доштам аз маъонии китоби Аллоҳро ёддошт кунам, то барои толибони ҳақ мояи ёдоварӣ бошад. Инчунин василае низ бошад барои касоне, ки мехоҳанд дарк кунанд ва кумаке бошад барои ононе, ки роҳи фаҳмидани Қуръонро дар пеш гирифтаанд. Аз ин рӯ аз тарси ин ки мабодо ин ёддоштҳо аз байн бираванд, онҳоро навиштам ва сабт кардам ва ҳадафи ман фақат тавзеҳи мақсуд ва муроди Қуръон будааст. Аз ин сабаб ба шарҳу тавзеҳоти калимаҳо ва алфози печида машғул нашудаам, чун муфассирони гузашта дар ин замина ба андозаи кофӣ кор кардаанд ва ниёз дар ин замина бароварда сохтаанд. Худованд ба онҳо подоши фаровон ва нек бидиҳад. Умед ба Худованд аст ва ба Ӯ таваккул менамоем ва аз Ӯ металабам ончиро, ки ирода намудаам бароям осон бигардонад. Чун агар Худованд онро осон накунад, роҳе барои ба даст омадани он нест ва агар Худованд бандаро кумак накунад, роҳе барои расидан ба орзуяш надорад.  Аз Аллоҳ мехоҳам, ки инро холисона барои худаш бигардонад ва нафъ ва суди онро васеъ бигардонад, ки бегумон Аллоҳ таъоло бахшандаи бузургвор аст. Равиши ман дар ин тафсир ин аст, ки дар бораи ҳар оя ончиро, ки дар зеҳнам мерасид биёварам ва дар тафсири оятҳое, ки як маънӣ доранд ва такрор шудаанд, ба якбор тафсири онҳо басанда накардаам. Зеро Парвардигори меҳрубон ин Қуръонро ба “Масонӣ” яъне такроршуда васф кардааст, ки дар он ахбор, достонҳо, ҳукмҳо ва ҳар ончиро, ки судманд бошад, бино ба ҳикмати болиғаи худ такрор кардааст. (Ба ҳамин ҷиҳат тафсири муҷаддад ва такрории чунин оятҳое, амри зарурӣ мебошад) Ҳамчунин Парвардигор ба тадаббур дар тамоми оятҳо амр намудааст, зеро тадаббур илм ва донишро меафзояд ва зоҳиру ботин ва тамоми корҳоро ислоҳ мекунад. Илоҳо, бар Муҳаммад ва хонадонаш ва саҳобагонаш дуруду салом бахш ва бар онҳо саломи фаровон ато кун.",
            "url": "",
            "sources": [
                {
                    "source": "¹(Моида: 16)"
                },
                {
                    "source": "²(Ҳуд: 1)"
                },
                {
                    "source": "³(Юсуф: 2)"
                }
                
            ]
        },

        {
            "id": 3,
            "subtitle": "Тафсири сураи Фотиҳа",
            "text": "Сураи маккӣ буда ва дорои 7 оят мебошад\n\n  **بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ** \n\n  **Ба номи Аллоҳи бисёр бахшанда ва бисёр** меҳрубон.\n\n  **ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ** \n\n  **Ҳамаи ситоишҳо шоистаи Аллоҳест, ки Парвардигори оламиён мебошад.**\n\n  **ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ** \n\n  **Бисёр бахшанда ва бисёр меҳрубон аст.**\n\n  **مَٰلِكِ يَوۡمِ ٱلدِّينِ** \n\n  **Молики рӯзи ҷазост.**\n\n  **إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ** \n\n  Танҳо Туро мепарастем ва танҳо аз Ту ёрӣ меҷӯем.\n\n  **ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ** \n\n  **Моро ба роҳи рост роҳнамоӣ фармо.**\n\n  **صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ** \n\n  Роҳи касоне, ки ба онҳо неъмат додаӣ.\n\n  **غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ** \n\n  **На роҳи касоне, ки бар онҳо хашм гирифтаӣ ва на роҳи гумроҳон**¹",
            "url": "",
            "sources": [
                {
                    "source": "¹(Фотиҳа: 1, то 7)"
                }
                
            ]
        },
        {
            "id": 4,
            "subtitle": "Тафсири Бисмиллоҳираҳмонираҳим",
            "text": "**بِسۡمِ ٱللَّهِ ** \n\n Бисмиллоҳ Яъне оғоз мекунам бо талаби кумак аз тамоми номҳои Аллоҳи муттаъол, зеро калимаи «اسم» муфрад ва иловашуда аст, бинобар ин тамоми асмои ҳусноро (номҳои зеборо) шомил мешавад.\n\n(ٱللَّهِ)\n\n **Аллоҳ** - ба маънои Зотест, ки ба ӯ ибодат карда мешавад ва аз онҷо, ки Парвардигор ба сифатҳои улуҳияте, ки сифатҳои камол ҳастанд доро мебошад, сазовор аст, ки танҳо Ӯ парастиш шавад.\n\n **ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ**\n\n **Раҳмонир раҳим** - ду исм аз исмҳои мубораки Аллоҳ ҳастанд ва баёнгари онанд, ки Ӯ таъоло дорои азамат ва раҳмати густардаест, ки ҳар чиз ва ҳар мавҷуди зиндаеро дар бар мегирад ва Аллоҳ бандагони парҳезгорашро, ки аз Паёмбаронаш пайравӣ мекунанд, аз он бархӯрдор месозад. Пас раҳмати илоҳӣ шомили ҳоли ин даста аз инсонҳо аст ва дигарон танҳо баҳрае аз он доранд. Бидон ки яке аз қоидаҳое, ки салаф ва пешвоёни ин уммат бар он иттифоқ доранд, имон ба исмҳо ва сифатҳои илоҳӣ ва аҳкоми мутааллиқ ба сифатҳо мебошад. Ба таври мисол онҳо боварӣ доштанд, ки Аллоҳи **Раҳмон** ва **Раҳим** бахшанда ва меҳрубон аст ва дорои раҳматест, ки ба онҳо васфшуда аст. Бинобар ин ҳамаи баракатҳо ва неъматҳо асаре аз осори раҳмати Ӯ мебошанд ва салаф ва пешвоёни ин уммат дар робита бо соири асмои илоҳӣ низ чунин эътиқод доштанд. Масалан онҳо боварӣ доштанд, ки **«علیم»** **(Алим)** ба маънии доно ва дорои илм аст ва ҳар чизеро медонад ва **«قدیر»** **(Қадир)** яъне Худое, ки дорои тавоноӣ аст ва бар ҳар чизе тавоноӣ дорад.",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        },
        {
            "id": 5,
            "subtitle": "Тафсири Алҳамдулиллоҳи Раббил оламин",
            "text": "**Алҳамдулиллоҳ** - ҳамд, яъне ситоиши Худованд ба хотири сифатҳои камол ва афъоле, ки аз фазл, аз бузургворӣ ва ё аз адли Ӯ содир мешавад, пас ситоиши комил барои Ӯст. “Раббил оламин” - Раб, яъне Парвардигори тамоми ҷаҳониён, чаро ки Худованд ҷаҳони ҳастӣ ва тамомии мавҷудотро офарида ва неъматҳои фаровонеро дар ихтиёри онон қарор додааст, ки агар онро аз даст бидиҳанд, бақо ва давоме барои онҳо мумкин нахоҳад буд. Пас Худованд мураббӣ ва Парвардигори онҳо аст, зеро онҳо ҳар неъматеро, ки доранд, аз ҷониби Аллоҳи таъоло аст. Худованд ба ду сурат офаридаҳояшро парвариш медиҳад, яке ба сурати ом ва фарогир ва дигаре ба сурати хос ва вижа. Парвариши ом ин аст, ки Ӯ таъоло офаридагонро офарида ва ба онҳо рӯзи дода ва онҳоро ба сӯи манфиатҳояшон, ки бақо ва ҳаёташон ба дунё ба он бастагӣ дорад, ҳидоят ва роҳнамоӣ кардааст. Парвариши хос низ иборат аз парвариши авлиёяш (дӯстонаш) мебошад. Худованд бо имон ва яқине, ки ба онон ато мекунад, онҳоро парвариш дода ва ба онҳо тавфиқ медиҳад, ки имон биёваранд ва имонро барои онҳо комил мегардонад ва монеъаҳоеро, ки миёни Ӯ таъоло ва онҳо вуҷуд доранд, дур мекунад. Ҳақиқати ин навъи тарбият иборат аст аз муваффақ шудан ба анҷом додани ҳар кори хайр ва амалҳои нек ва дур шудан аз ҳар бадӣ ва амалҳои зишт. Ба ҳамин хотир бештар дуъоҳои Паёмбарон бо калимаи «رب» шурӯъ шудааст, зеро ҳамаи хостаҳои онон дар чорчуби рубубияти хоси Аллоҳ таъоло таҳаққуқ ёфтааст, пас фармуда:\n\n**رَبِّ ٱلۡعَٰلَمِينَ**\n\n **Парвардигори ҷаҳониён аст** баёнгари ягона будани Худованд дар офаридан, дар тадбири умур, дар атои неъматҳо ва бениёзии Ӯ ва ниёзмандии тамоми ҷаҳониён ба Ӯ таъоло мебошад. ",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        },

        {
            "id": 6,
            "subtitle": "Тафсири Малики явмиддин",
            "text": "**Малики явмиддин** - Молик касест, ки сифати мулк ва подшоҳиро доро бошад, ба ҳамин хотир Молик амр ва наҳй мекунад, подош ва сазо медиҳад ва бо зердастонаш ҳар навъ, ки бихоҳад, рафтор мекунад. Дар ин оят »ملک« ба »دین« изофа шудааст ва »یوم الدین« ба маънии рӯзи қиёмат аст. Рӯзе, ки мардум подоши аъмоли хуб ва бади худро дарёфт мекунанд, зеро дар он рӯз ҳақиқати подшоҳӣ, адл ва ҳикмати худовандӣ ва нуфузи подшоҳии Офаридгор барои халоиқ равшан мегардад. То ҷое, ки дар он рӯз подшоҳон ва пайравонашон ва ҳама инсонҳо аз ҳуқуқи баробар бархӯрдор мешаванд ва ҳама дар баробари азамат ва шукуҳи илоҳӣ сари таслим фурӯд оварда ва дар интизори муҷозоти Ӯ таъоло ба сар мебаранд, умеди подош аз Ӯ доранд ва аз азоби Ӯ таъоло дар ҳаросанд. Ба ҳамин хотир Худованд баён дошта, ки молики рӯзи ҷазо аст, вагарна Худованд молики рӯзи қиёмат ва дигар рӯзҳост.",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        },
        {
            "id": 7,
            "subtitle": "Тафсири Ийяканаъйбуду ва ийяка настаъин",
            "text": "**Ийяканаъйбуду ва ийяка настаъин** - Яъне танҳо Туро мепарастем ва танҳо аз Ту ёрӣ меҷӯем, зеро тақдими оне, ки бояд баъд зикр мешуд, ибтидо зикр карда шуд. Ин амр далолат бар хос будани ибодат ва талаби кумакро танҳо аз Аллоҳ таъоло мекунад, пас яъне танҳо Туро мепарастем ва аз ибодати ғайри Ту рӯй бар метобем ва аз Ту ёрӣ талабида ва аз ғайри **استعانت** ибодат) бар( **عبادت** Ту ёрӣ намеҷӯем. Муқаддам кардани (истиъонат) аз боби тақдими ом бар хос, ба хотири эҳтимом варзидан ба ҳаққи Аллоҳи муттаъол ва ба хотири муқаддам доштани ҳаққи Аллоҳ таъоло бар ҳаққи банда мебошад. **Ибодат** - мафҳумои зиёдеро шомил шуда, ҳама амалҳо ва“  қавлҳои зоҳирӣ ва ботиниро, ки Худованд онҳоро дӯст медорад ва меписандад, дар бар мегирад.\n**Истиъонат** - низ ба маънии ёрӣ ҷустан аз Худованд ва“ такя кардан бар Ӯ ба манзури ҷалби манфиатҳо ва дафъи зиёнҳост ва бар замми ин одамӣ бояд итминон дошта бошад, ки бо такя бар Аллоҳ таъоло, кумаки Аллоҳ таъоло низ бар ӯ ноил мегардад.  Анҷом додани ибодат барои Аллоҳ таъоло ва ёрӣ ҷустан аз Ӯ, василаи касби саодати абадӣ ва наҷот аз ҳамаи бадиҳост, пас ба ҷуз ин ду роҳ, роҳе барои наҷот вуҷуд надорад. Ибодат ҳам замоне ибодати воқеъӣ маҳсуб мешавад, ки баргирифта аз суннат ва сираи Паёмбар саллаллоҳу алайҳи ва саллам ва мақсад аз анҷоми он ризои Худованд бошад. Пас ҳар амале, ки дорои ин ду хусусият ва вижагӣ бошад, яъне холисона барои ҷалби ризоияти Аллоҳ таъоло анҷом дода шавад ва мутобиқи суннати Расули Акрам саллаллоҳу алайҳи ва саллам бошад, пас ибодат маҳсуб мешавад. Аллоҳ таъоло истиъонатро пас аз ибодат зикр намуд, ганчанде ки истиъонат низ бахше аз ибодат мебошад, ба хотири ин ки банда дар анҷоми ибодат ба ёрии Худованд ниёзманд аст, зеро агар Худованд бандаро ёрӣ накунад, ӯ наметавонад амрҳои илоҳиро анҷом диҳад ва аз манъкардаҳои илоҳӣ парҳез кунад.",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        },
        {
            "id": 8,
            "subtitle": "Тафсири Иҳдинассироталмустақим",
            "text": "**Иҳдинассироталмустақим** - Яъне моро роҳнамоӣ ва ҳидоят фармо, то роҳи ростро биёбем ва роҳи рост роҳи равшанӣ аст, ки инсонро ба Аллоҳ таъоло ва биҳишт мерасонад. Роҳи рост иборат аст аз шинохти ҳақ ва амал намудан ба он, пас моро ба роҳи рост иноят фармо. Ҳидоят ба сӯи роҳи рост, яъне чанг задан ба дини На роҳи касоне, ки бар онҳо хашм гирифтаӣ, онҳое, ки ҳақро шинохтанд ва ба он амал накарданд, монанди яҳудиён ва амсоли онҳо. Ва на роҳи гумроҳон, ҳамонҳое, ки ба сабаби нодонӣ ва гумроҳӣ аз ҳақ рӯйгардон шуданд, монанди насоро ва амсоли онҳо.  Ин сура бо ин ки бисёр мухтасар аст, аммо дарбаргирандаи мафҳумҳоест, ки ҳеҷ сурае аз сураҳои Қуръон ингуна мафҳумҳоро дар бар надоранд. Ин сура тавҳиди сегонаро дар бар мегирад, бар ин шакл, ки тавҳиди рубубият аз Раббил оламин гирифта мешавад ва тавҳиди улуҳият, ки ба маънии парастиши Аллоҳи якто аст аз калимаи **Аллоҳ** ва **Ийяка найбуду ва ийяка настаъин** истинбот мешавад ва тавҳиди асмо ва сифот, ки ба маънии бовар доштан ба сифатҳои камол аст, ки Аллоҳ барои хеш собит намудааст ва Паёмбар саллаллоҳу алайҳи ва саллам низ бидуни таътил, ташбеҳ ва тамсил онҳоро барои Парвардигор собит кардааст, аз вожаи **Алҳамду** истинбот мешавад. Исботи нубуват аз **Иҳдинассироталмустақим** гирифта мешавад, зеро ҳидоят ёфтан ба роҳи рост ҷуз ба кумаки Расул ва рисолат имкон надорад ва исботи рӯзи ҷазову савоб ва иқоби ухравӣ аз **Моликиявмиддин** истинбот мегардад, зеро дин ба маънои подоши одилона аст. Ин сура инчунин қазо ва қадари илоҳиро исбот мекунад ва низ исбот мекунад, ки банда фоъили (анҷомдиҳандаи) ҳақиқӣ аст, бар хилофи андешаи гурӯҳҳое мисли Қадария ва Ҷабария, ки онҳо чунин эътиқодро надоранд. Ин сура ҳамчунин шомили радди назарияҳои аҳли бидъат ва гумроҳӣ аст ва ин матлаб аз\n\n**ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ**\n\n дарёфт мешавад, зеро роҳи рост ба маънии шинохти ҳақ ва амал кардан ба он аст, амре, ки ҳар бидъатгузор ва гумроҳе бо он мухолиф аст. Ин қисмати сура\n\n**إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ**\n\n дар баргирандаи он аст, ки убудият ва бандагӣ бояд холисона барои Аллоҳ сурат гирад ва бояд танҳо аз боргоҳи Ӯ таъоло истиъонат ҷуст. Пас сипос Худовандерост, ки Парвардигори ҷаҳониён мебошад. Поёни тафсири сураи Фотиҳа",
            "url": "",
            "sources": [
                {
                    "source": ""
                }
                
            ]
        }
        
    ]
}
